export function unicodeUsedBy(codePoint) {
  loadTables();
  return unicodeLookup(codePoint, usedByTable);
}

export function unicodeMadeOf(codePoint) {
  loadTables();
  return unicodeLookup(codePoint, madeOfTable);
}

function unicodeLookup(codePoint, table) {
  const char = String.fromCodePoint(codePoint);
  const values = table[char] || [];
  return values.map((c) => c.codePointAt(0));
}

let usedByTable, madeOfTable;

function loadTables() {
  if (usedByTable) {
    return;
  }
  usedByTable = {};
  madeOfTable = {};
  for (const line of usedByData.split("\n")) {
    const row = line.split("\t");
    const char = row[0];
    const usedByChars = row.splice(1);
    usedByTable[char] = usedByChars;
    for (const usedByChar of usedByChars) {
      if (!(usedByChar in madeOfTable)) {
        madeOfTable[usedByChar] = [];
      }
      madeOfTable[usedByChar].push(char);
    }
  }
}

// prettier-ignore
const usedByData = `
\u0020	\u00A0	\u2000	\u2001	\u2002	\u2003	\u2004	\u2005	\u2006	\u2007	\u2008	\u2009	\u200A	\u202F	\u205F	\u3000
!	‼	⁈	⁉	︕	﹗	！
"	＂
#	﹟	＃
$	﹩	＄
%	﹪	％
&	﹠	＆
'	＇
(	⁽	₍	⑴	⑵	⑶	⑷	⑸	⑹	⑺	⑻	⑼	⑽	⑾	⑿	⒀	⒁	⒂	⒃	⒄	⒅	⒆	⒇	⒜	⒝	⒞	⒟	⒠	⒡	⒢	⒣	⒤	⒥	⒦	⒧	⒨	⒩	⒪	⒫	⒬	⒭	⒮	⒯	⒰	⒱	⒲	⒳	⒴	⒵	㈀	㈁	㈂	㈃	㈄	㈅	㈆	㈇	㈈	㈉	㈊	㈋	㈌	㈍	㈎	㈏	㈐	㈑	㈒	㈓	㈔	㈕	㈖	㈗	㈘	㈙	㈚	㈛	㈜	㈝	㈞	㈠	㈡	㈢	㈣	㈤	㈥	㈦	㈧	㈨	㈩	㈪	㈫	㈬	㈭	㈮	㈯	㈰	㈱	㈲	㈳	㈴	㈵	㈶	㈷	㈸	㈹	㈺	㈻	㈼	㈽	㈾	㈿	㉀	㉁	㉂	㉃	︵	﹙	（	🄐	🄑	🄒	🄓	🄔	🄕	🄖	🄗	🄘	🄙	🄚	🄛	🄜	🄝	🄞	🄟	🄠	🄡	🄢	🄣	🄤	🄥	🄦	🄧	🄨	🄩
)	⁾	₎	⑴	⑵	⑶	⑷	⑸	⑹	⑺	⑻	⑼	⑽	⑾	⑿	⒀	⒁	⒂	⒃	⒄	⒅	⒆	⒇	⒜	⒝	⒞	⒟	⒠	⒡	⒢	⒣	⒤	⒥	⒦	⒧	⒨	⒩	⒪	⒫	⒬	⒭	⒮	⒯	⒰	⒱	⒲	⒳	⒴	⒵	㈀	㈁	㈂	㈃	㈄	㈅	㈆	㈇	㈈	㈉	㈊	㈋	㈌	㈍	㈎	㈏	㈐	㈑	㈒	㈓	㈔	㈕	㈖	㈗	㈘	㈙	㈚	㈛	㈜	㈝	㈞	㈠	㈡	㈢	㈣	㈤	㈥	㈦	㈧	㈨	㈩	㈪	㈫	㈬	㈭	㈮	㈯	㈰	㈱	㈲	㈳	㈴	㈵	㈶	㈷	㈸	㈹	㈺	㈻	㈼	㈽	㈾	㈿	㉀	㉁	㉂	㉃	︶	﹚	）	🄐	🄑	🄒	🄓	🄔	🄕	🄖	🄗	🄘	🄙	🄚	🄛	🄜	🄝	🄞	🄟	🄠	🄡	🄢	🄣	🄤	🄥	🄦	🄧	🄨	🄩
*	﹡	＊
+	⁺	₊	﬩	﹢	＋
,	︐	﹐	，	🄁	🄂	🄃	🄄	🄅	🄆	🄇	🄈	🄉	🄊
-	﹣	－
.	․	‥	…	⒈	⒉	⒊	⒋	⒌	⒍	⒎	⒏	⒐	⒑	⒒	⒓	⒔	⒕	⒖	⒗	⒘	⒙	⒚	⒛	㏂	㏇	㏘	︙	︰	﹒	．	🄀
/	℀	℁	℅	℆	／
0	⁰	₀	⅒	↉	⑩	⑳	⑽	⒇	⒑	⒛	⓪	㉚	㊵	㊿	㋉	㍘	㍢	㍬	㏩	㏳	㏽	０	𜳰	𝟎	𝟘	𝟢	𝟬	𝟶	🄀	🄁	🯰
1	¹	¼	½	₁	⅐	⅑	⅒	⅓	⅕	⅙	⅛	⅟	①	⑩	⑪	⑫	⑬	⑭	⑮	⑯	⑰	⑱	⑲	⑴	⑽	⑾	⑿	⒀	⒁	⒂	⒃	⒄	⒅	⒆	⒈	⒑	⒒	⒓	⒔	⒕	⒖	⒗	⒘	⒙	⒚	㉑	㉛	㊶	㋀	㋉	㋊	㋋	㍙	㍢	㍣	㍤	㍥	㍦	㍧	㍨	㍩	㍪	㍫	㍭	㏠	㏩	㏪	㏫	㏬	㏭	㏮	㏯	㏰	㏱	㏲	㏴	㏾	１	𜳱	𝟏	𝟙	𝟣	𝟭	𝟷	🄂	🯱
2	²	½	₂	⅔	⅖	②	⑫	⑳	⑵	⑿	⒇	⒉	⒓	⒛	㉑	㉒	㉓	㉔	㉕	㉖	㉗	㉘	㉙	㉜	㊷	㋁	㋋	㍚	㍤	㍬	㍭	㍮	㍯	㍰	㍸	㎟	㎠	㎡	㎢	㎨	㎯	㏡	㏫	㏳	㏴	㏵	㏶	㏷	㏸	㏹	㏺	㏻	㏼	２	𜳲	𝟐	𝟚	𝟤	𝟮	𝟸	🄃	🯲
3	³	¾	₃	⅓	⅔	⅗	⅜	↉	③	⑬	⑶	⒀	⒊	⒔	㉓	㉚	㉛	㉜	㉝	㉞	㉟	㊱	㊲	㊳	㊴	㊸	㋂	㍛	㍥	㍯	㍹	㎣	㎤	㎥	㎦	㏢	㏬	㏶	㏽	㏾	３	𜳳	𝟑	𝟛	𝟥	𝟯	𝟹	🄄	🯳
4	¼	¾	⁴	₄	⅘	④	⑭	⑷	⒁	⒋	⒕	㉔	㉞	㊵	㊶	㊷	㊸	㊹	㊺	㊻	㊼	㊽	㊾	㋃	㍜	㍦	㍰	㏣	㏭	㏷	４	𜳴	𝟒	𝟜	𝟦	𝟰	𝟺	🄅	🯴
5	⁵	₅	⅕	⅖	⅗	⅘	⅚	⅝	⑤	⑮	⑸	⒂	⒌	⒖	㉕	㉟	㊺	㊿	㋄	㍝	㍧	㏤	㏮	㏸	５	𜳵	𝟓	𝟝	𝟧	𝟱	𝟻	🄆	🯵
6	⁶	₆	⅙	⅚	⑥	⑯	⑹	⒃	⒍	⒗	㉖	㊱	㊻	㋅	㍞	㍨	㏥	㏯	㏹	６	𜳶	𝟔	𝟞	𝟨	𝟲	𝟼	🄇	🯶
7	⁷	₇	⅐	⅞	⑦	⑰	⑺	⒄	⒎	⒘	㉗	㊲	㊼	㋆	㍟	㍩	㏦	㏰	㏺	７	𜳷	𝟕	𝟟	𝟩	𝟳	𝟽	🄈	🯷
8	⁸	₈	⅛	⅜	⅝	⅞	⑧	⑱	⑻	⒅	⒏	⒙	㉘	㊳	㊽	㋇	㍠	㍪	㏧	㏱	㏻	８	𜳸	𝟖	𝟠	𝟪	𝟴	𝟾	🄉	🯸
9	⁹	₉	⅑	⑨	⑲	⑼	⒆	⒐	⒚	㉙	㊴	㊾	㋈	㍡	㍫	㏨	㏲	㏼	９	𜳹	𝟗	𝟡	𝟫	𝟵	𝟿	🄊	🯹
:	⩴	︓	﹕	：
;	;	︔	﹔	；
<	≮	﹤	＜
=	⁼	₌	≠	⩴	⩵	⩶	﹦	＝
>	≯	﹥	＞
?	⁇	⁈	⁉	︖	﹖	？
@	﹫	＠
A	À	Á	Â	Ã	Ä	Å	Ā	Ă	Ą	Ǎ	Ǟ	Ǡ	Ǻ	Ȁ	Ȃ	Ȧ	ᴬ	Ḁ	Ạ	Ả	Ấ	Ầ	Ẩ	Ẫ	Ậ	Ắ	Ằ	Ẳ	Ẵ	Ặ	Å	℻	Ⓐ	㍳	㎀	㎁	㎂	㎃	㎄	㏟	Ａ	𜳖	𝐀	𝐴	𝑨	𝒜	𝓐	𝔄	𝔸	𝕬	𝖠	𝗔	𝘈	𝘼	𝙰	🄐	🄰
B	ᴮ	Ḃ	Ḅ	Ḇ	ℬ	Ⓑ	㎅	㎆	㎇	㏃	㏈	Ｂ	𜳗	𝐁	𝐵	𝑩	𝓑	𝔅	𝔹	𝕭	𝖡	𝗕	𝘉	𝘽	𝙱	🄑	🄱
C	Ç	Ć	Ĉ	Ċ	Č	Ḉ	ℂ	℃	ℭ	Ⅽ	Ⓒ	㏆	㏇	ꟲ	Ｃ	𜳘	𝐂	𝐶	𝑪	𝒞	𝓒	𝕮	𝖢	𝗖	𝘊	𝘾	𝙲	🄒	🄫	🄭	🄲	🅏	🅪
D	Ď	Ǆ	ǅ	Ǳ	ǲ	ᴰ	Ḋ	Ḍ	Ḏ	Ḑ	Ḓ	ⅅ	Ⅾ	Ⓓ	㋏	Ｄ	𜳙	𝐃	𝐷	𝑫	𝒟	𝓓	𝔇	𝔻	𝕯	𝖣	𝗗	𝘋	𝘿	𝙳	🄓	🄭	🄳	🅌	🅫	🆐
E	È	É	Ê	Ë	Ē	Ĕ	Ė	Ę	Ě	Ȅ	Ȇ	Ȩ	ᴱ	Ḕ	Ḗ	Ḙ	Ḛ	Ḝ	Ẹ	Ẻ	Ẽ	Ế	Ề	Ể	Ễ	Ệ	℡	ℰ	Ⓔ	㉐	Ｅ	𜳚	𝐄	𝐸	𝑬	𝓔	𝔈	𝔼	𝕰	𝖤	𝗘	𝘌	𝙀	𝙴	🄔	🄴
F	Ḟ	℉	ℱ	℻	Ⓕ	㎊	㎋	㎌	ꟳ	Ｆ	𜳛	𝐅	𝐹	𝑭	𝓕	𝔉	𝔽	𝕱	𝖥	𝗙	𝘍	𝙁	𝙵	🄕	🄵
G	Ĝ	Ğ	Ġ	Ģ	Ǧ	Ǵ	ᴳ	Ḡ	Ⓖ	㎇	㎓	㎬	㏉	Ｇ	𜳜	𝐆	𝐺	𝑮	𝒢	𝓖	𝔊	𝔾	𝕲	𝖦	𝗚	𝘎	𝙂	𝙶	🄖	🄶
H	Ĥ	Ȟ	ᴴ	Ḣ	Ḥ	Ḧ	Ḩ	Ḫ	ℋ	ℌ	ℍ	Ⓗ	㋌	㎐	㎑	㎒	㎓	㎔	㏋	㏗	Ｈ	𜳝	𝐇	𝐻	𝑯	𝓗	𝕳	𝖧	𝗛	𝘏	𝙃	𝙷	🄗	🄷	🅊
I	Ì	Í	Î	Ï	Ĩ	Ī	Ĭ	Į	İ	Ĳ	Ǐ	Ȉ	Ȋ	ᴵ	Ḭ	Ḯ	Ỉ	Ị	ℐ	ℑ	Ⅰ	Ⅱ	Ⅲ	Ⅳ	Ⅵ	Ⅶ	Ⅷ	Ⅸ	Ⅺ	Ⅻ	Ⓘ	㍺	Ｉ	𜳞	𝐈	𝐼	𝑰	𝓘	𝕀	𝕴	𝖨	𝗜	𝘐	𝙄	𝙸	🄘	🄸
J	Ĳ	Ĵ	Ǉ	Ǌ	ᴶ	Ⓙ	Ｊ	𜳟	𝐉	𝐽	𝑱	𝒥	𝓙	𝔍	𝕁	𝕵	𝖩	𝗝	𝘑	𝙅	𝙹	🄙	🄹	🆐
K	Ķ	Ǩ	ᴷ	Ḱ	Ḳ	Ḵ	K	Ⓚ	㎅	㏍	㏎	Ｋ	𜳠	𝐊	𝐾	𝑲	𝒦	𝓚	𝔎	𝕂	𝕶	𝖪	𝗞	𝘒	𝙆	𝙺	🄚	🄺
L	Ĺ	Ļ	Ľ	Ŀ	Ǉ	ǈ	ᴸ	Ḷ	Ḹ	Ḻ	Ḽ	ℒ	℡	Ⅼ	Ⓛ	㋏	Ｌ	𜳡	𝐋	𝐿	𝑳	𝓛	𝔏	𝕃	𝕷	𝖫	𝗟	𝘓	𝙇	𝙻	🄛	🄻
M	ᴹ	Ḿ	Ṁ	Ṃ	℠	™	ℳ	Ⅿ	Ⓜ	㎆	㎒	㎫	㎹	㎿	㏁	㏎	㏙	Ｍ	𜳢	𝐌	𝑀	𝑴	𝓜	𝔐	𝕄	𝕸	𝖬	𝗠	𝘔	𝙈	𝙼	🄜	🄼	🅋	🅪	🅫	🅬
N	Ñ	Ń	Ņ	Ň	Ǌ	ǋ	Ǹ	ᴺ	Ṅ	Ṇ	Ṉ	Ṋ	ℕ	№	Ⓝ	Ｎ	𜳣	𝐍	𝑁	𝑵	𝒩	𝓝	𝔑	𝕹	𝖭	𝗡	𝘕	𝙉	𝙽	🄝	🄽
O	Ò	Ó	Ô	Õ	Ö	Ō	Ŏ	Ő	Ơ	Ǒ	Ǫ	Ǭ	Ȍ	Ȏ	Ȫ	Ȭ	Ȯ	Ȱ	ᴼ	Ṍ	Ṏ	Ṑ	Ṓ	Ọ	Ỏ	Ố	Ồ	Ổ	Ỗ	Ộ	Ớ	Ờ	Ở	Ỡ	Ợ	Ⓞ	Ｏ	𜳤	𝐎	𝑂	𝑶	𝒪	𝓞	𝔒	𝕆	𝕺	𝖮	𝗢	𝘖	𝙊	𝙾	🄞	🄾
P	ᴾ	Ṕ	Ṗ	ℙ	Ⓟ	㉐	㍱	㎩	㎪	㎫	㎬	㏋	㏗	㏙	㏚	Ｐ	𜳥	𝐏	𝑃	𝑷	𝒫	𝓟	𝔓	𝕻	𝖯	𝗣	𝘗	𝙋	𝙿	🄟	🄿	🅎
Q	ℚ	Ⓠ	ꟴ	Ｑ	𜳦	𝐐	𝑄	𝑸	𝒬	𝓠	𝔔	𝕼	𝖰	𝗤	𝘘	𝙌	𝚀	🄠	🅀
R	Ŕ	Ŗ	Ř	Ȑ	Ȓ	ᴿ	Ṙ	Ṛ	Ṝ	Ṟ	₨	ℛ	ℜ	ℝ	Ⓡ	㏚	Ｒ	𜳧	𝐑	𝑅	𝑹	𝓡	𝕽	𝖱	𝗥	𝘙	𝙍	𝚁	🄡	🄬	🅁	🅬
S	Ś	Ŝ	Ş	Š	Ș	Ṡ	Ṣ	Ṥ	Ṧ	Ṩ	℠	Ⓢ	㏜	Ｓ	𜳨	𝐒	𝑆	𝑺	𝒮	𝓢	𝔖	𝕊	𝕾	𝖲	𝗦	𝘚	𝙎	𝚂	🄢	🄪	🅂	🅌	🅍
T	Ţ	Ť	Ț	ᵀ	Ṫ	Ṭ	Ṯ	Ṱ	℡	™	Ⓣ	㉐	㋏	㎔	Ｔ	𜳩	𝐓	𝑇	𝑻	𝒯	𝓣	𝔗	𝕋	𝕿	𝖳	𝗧	𝘛	𝙏	𝚃	🄣	🅃
U	Ù	Ú	Û	Ü	Ũ	Ū	Ŭ	Ů	Ű	Ų	Ư	Ǔ	Ǖ	Ǘ	Ǚ	Ǜ	Ȕ	Ȗ	ᵁ	Ṳ	Ṵ	Ṷ	Ṹ	Ṻ	Ụ	Ủ	Ứ	Ừ	Ử	Ữ	Ự	Ⓤ	㍳	㍺	Ｕ	𜳪	𝐔	𝑈	𝑼	𝒰	𝓤	𝔘	𝕌	𝖀	𝖴	𝗨	𝘜	𝙐	𝚄	🄤	🅄
V	Ṽ	Ṿ	Ⅳ	Ⅴ	Ⅵ	Ⅶ	Ⅷ	Ⓥ	ⱽ	㋎	㍵	㎴	㎵	㎶	㎷	㎸	㎹	㏞	Ｖ	𜳫	𝐕	𝑉	𝑽	𝒱	𝓥	𝔙	𝕍	𝖁	𝖵	𝗩	𝘝	𝙑	𝚅	🄥	🅅	🅊	🅋	🅎
W	Ŵ	ᵂ	Ẁ	Ẃ	Ẅ	Ẇ	Ẉ	Ⓦ	㎺	㎻	㎼	㎽	㎾	㎿	㏝	Ｗ	𜳬	𝐖	𝑊	𝑾	𝒲	𝓦	𝔚	𝕎	𝖂	𝖶	𝗪	𝘞	𝙒	𝚆	🄦	🄮	🅆	🅏
X	Ẋ	Ẍ	℻	Ⅸ	Ⅹ	Ⅺ	Ⅻ	Ⓧ	Ｘ	𜳭	𝐗	𝑋	𝑿	𝒳	𝓧	𝔛	𝕏	𝖃	𝖷	𝗫	𝘟	𝙓	𝚇	🄧	🅇
Y	Ý	Ŷ	Ÿ	Ȳ	Ẏ	Ỳ	Ỵ	Ỷ	Ỹ	Ⓨ	Ｙ	𜳮	𝐘	𝑌	𝒀	𝒴	𝓨	𝔜	𝕐	𝖄	𝖸	𝗬	𝘠	𝙔	𝚈	🄨	🅈
Z	Ź	Ż	Ž	Ǆ	Ǳ	Ẑ	Ẓ	Ẕ	ℤ	ℨ	Ⓩ	Ｚ	𜳯	𝐙	𝑍	𝒁	𝒵	𝓩	𝖅	𝖹	𝗭	𝘡	𝙕	𝚉	🄩	🄮	🅉
[	﹇	［
\	﹨	＼
]	﹈	］
^	＾
_	︳	︴	﹍	﹎	﹏	＿
\u0060	`	｀
a	ª	à	á	â	ã	ä	å	ā	ă	ą	ǎ	ǟ	ǡ	ǻ	ȁ	ȃ	ȧ	ᵃ	ḁ	ẚ	ạ	ả	ấ	ầ	ẩ	ẫ	ậ	ắ	ằ	ẳ	ẵ	ặ	ₐ	℀	℁	⒜	ⓐ	㍱	㍲	㍴	㎈	㎉	㎩	㎪	㎫	㎬	㎭	㎮	㎯	㏂	㏊	㏿	ａ	𝐚	𝑎	𝒂	𝒶	𝓪	𝔞	𝕒	𝖆	𝖺	𝗮	𝘢	𝙖	𝚊
b	ᵇ	ḃ	ḅ	ḇ	⒝	ⓑ	㍴	㏔	㏝	ｂ	𝐛	𝑏	𝒃	𝒷	𝓫	𝔟	𝕓	𝖇	𝖻	𝗯	𝘣	𝙗	𝚋
c	ç	ć	ĉ	ċ	č	ᶜ	ḉ	℀	℅	℆	ⅽ	⒞	ⓒ	㍶	㎈	㎉	㎝	㎠	㎤	㏄	㏅	ｃ	𝐜	𝑐	𝒄	𝒸	𝓬	𝔠	𝕔	𝖈	𝖼	𝗰	𝘤	𝙘	𝚌
d	ď	ǆ	ǳ	ᵈ	ḋ	ḍ	ḏ	ḑ	ḓ	ⅆ	ⅾ	⒟	ⓓ	㍲	㍷	㍸	㍹	㎗	㎭	㎮	㎯	㏅	㏈	ｄ	𝐝	𝑑	𝒅	𝒹	𝓭	𝔡	𝕕	𝖉	𝖽	𝗱	𝘥	𝙙	𝚍
e	è	é	ê	ë	ē	ĕ	ė	ę	ě	ȅ	ȇ	ȩ	ᵉ	ḕ	ḗ	ḙ	ḛ	ḝ	ẹ	ẻ	ẽ	ế	ề	ể	ễ	ệ	ₑ	ℯ	ⅇ	⒠	ⓔ	㋍	㋎	ｅ	𝐞	𝑒	𝒆	𝓮	𝔢	𝕖	𝖊	𝖾	𝗲	𝘦	𝙚	𝚎
f	ᶠ	ḟ	⒡	ⓕ	㎙	ﬀ	ﬁ	ﬂ	ﬃ	ﬄ	ｆ	𝐟	𝑓	𝒇	𝒻	𝓯	𝔣	𝕗	𝖋	𝖿	𝗳	𝘧	𝙛	𝚏
g	ĝ	ğ	ġ	ģ	ǧ	ǵ	ᵍ	ḡ	ℊ	⒢	ⓖ	㋌	㋍	㎍	㎎	㎏	㏆	㏒	㏿	ｇ	𝐠	𝑔	𝒈	𝓰	𝔤	𝕘	𝖌	𝗀	𝗴	𝘨	𝙜	𝚐
h	ĥ	ȟ	ʰ	ḣ	ḥ	ḧ	ḩ	ḫ	ẖ	ₕ	ℎ	⒣	ⓗ	㍱	㏊	ｈ	𝐡	𝒉	𝒽	𝓱	𝔥	𝕙	𝖍	𝗁	𝗵	𝘩	𝙝	𝚑
i	ì	í	î	ï	ĩ	ī	ĭ	į	ĳ	ǐ	ȉ	ȋ	ᵢ	ḭ	ḯ	ỉ	ị	ⁱ	ℹ	ⅈ	ⅰ	ⅱ	ⅲ	ⅳ	ⅵ	ⅶ	ⅷ	ⅸ	ⅺ	ⅻ	⒤	ⓘ	㏌	㏕	ﬁ	ﬃ	ｉ	𝐢	𝑖	𝒊	𝒾	𝓲	𝔦	𝕚	𝖎	𝗂	𝗶	𝘪	𝙞	𝚒
j	ĳ	ĵ	ǈ	ǉ	ǋ	ǌ	ǰ	ʲ	ⅉ	⒥	ⓙ	ⱼ	ｊ	𝐣	𝑗	𝒋	𝒿	𝓳	𝔧	𝕛	𝖏	𝗃	𝗷	𝘫	𝙟	𝚓
k	ķ	ǩ	ᵏ	ḱ	ḳ	ḵ	ₖ	⒦	ⓚ	㎄	㎉	㎏	㎑	㎘	㎞	㎢	㎦	㎪	㎸	㎾	㏀	㏆	㏏	ｋ	𝐤	𝑘	𝒌	𝓀	𝓴	𝔨	𝕜	𝖐	𝗄	𝗸	𝘬	𝙠	𝚔
l	ĺ	ļ	ľ	ŀ	ǉ	ˡ	ḷ	ḹ	ḻ	ḽ	ₗ	ℓ	ⅼ	⒧	ⓛ	㎈	㎉	㎕	㎖	㎗	㎘	㏐	㏑	㏒	㏓	㏕	㏖	㏿	ﬂ	ﬄ	ｌ	𝐥	𝑙	𝒍	𝓁	𝓵	𝔩	𝕝	𝖑	𝗅	𝗹	𝘭	𝙡	𝚕
m	ᵐ	ḿ	ṁ	ṃ	ₘ	ⅿ	⒨	ⓜ	㍷	㍸	㍹	㎃	㎎	㎖	㎙	㎚	㎛	㎜	㎝	㎞	㎟	㎠	㎡	㎢	㎣	㎤	㎥	㎦	㎧	㎨	㎳	㎷	㎽	㏂	㏐	㏔	㏕	㏖	㏘	㏞	㏟	ｍ	𝐦	𝑚	𝒎	𝓂	𝓶	𝔪	𝕞	𝖒	𝗆	𝗺	𝘮	𝙢	𝚖
n	ñ	ń	ņ	ň	ŉ	ǌ	ǹ	ṅ	ṇ	ṉ	ṋ	ⁿ	ₙ	⒩	ⓝ	㎁	㎋	㎚	㎱	㎵	㎻	㏌	㏑	ｎ	𝐧	𝑛	𝒏	𝓃	𝓷	𝔫	𝕟	𝖓	𝗇	𝗻	𝘯	𝙣	𝚗
o	º	ò	ó	ô	õ	ö	ō	ŏ	ő	ơ	ǒ	ǫ	ǭ	ȍ	ȏ	ȫ	ȭ	ȯ	ȱ	ᵒ	ṍ	ṏ	ṑ	ṓ	ọ	ỏ	ố	ồ	ổ	ỗ	ộ	ớ	ờ	ở	ỡ	ợ	ₒ	℅	№	ℴ	⒪	ⓞ	㍵	㏇	㏒	㏖	ｏ	𝐨	𝑜	𝒐	𝓸	𝔬	𝕠	𝖔	𝗈	𝗼	𝘰	𝙤	𝚘
p	ᵖ	ṕ	ṗ	ₚ	⒫	ⓟ	㍶	㎀	㎊	㎰	㎴	㎺	㏘	ｐ	𝐩	𝑝	𝒑	𝓅	𝓹	𝔭	𝕡	𝖕	𝗉	𝗽	𝘱	𝙥	𝚙
q	⒬	ⓠ	㏃	ｑ	𐞥	𝐪	𝑞	𝒒	𝓆	𝓺	𝔮	𝕢	𝖖	𝗊	𝗾	𝘲	𝙦	𝚚
r	ŕ	ŗ	ř	ȑ	ȓ	ʳ	ᵣ	ṙ	ṛ	ṝ	ṟ	⒭	ⓡ	㋍	㍴	㎭	㎮	㎯	㏛	ｒ	𝐫	𝑟	𝒓	𝓇	𝓻	𝔯	𝕣	𝖗	𝗋	𝗿	𝘳	𝙧	𝚛
s	ś	ŝ	ş	š	ſ	ș	ˢ	ṡ	ṣ	ṥ	ṧ	ṩ	ẛ	ₛ	₨	℁	⒮	ⓢ	㎧	㎨	㎮	㎯	㎰	㎱	㎲	㎳	㏛	ﬅ	ﬆ	ｓ	𝐬	𝑠	𝒔	𝓈	𝓼	𝔰	𝕤	𝖘	𝗌	𝘀	𝘴	𝙨	𝚜
t	ţ	ť	ț	ᵗ	ṫ	ṭ	ṯ	ṱ	ẗ	ₜ	⒯	ⓣ	㏏	ﬅ	ﬆ	ｔ	𝐭	𝑡	𝒕	𝓉	𝓽	𝔱	𝕥	𝖙	𝗍	𝘁	𝘵	𝙩	𝚝
u	ù	ú	û	ü	ũ	ū	ŭ	ů	ű	ų	ư	ǔ	ǖ	ǘ	ǚ	ǜ	ȕ	ȗ	ᵘ	ᵤ	ṳ	ṵ	ṷ	ṹ	ṻ	ụ	ủ	ứ	ừ	ử	ữ	ự	℆	⒰	ⓤ	ｕ	𝐮	𝑢	𝒖	𝓊	𝓾	𝔲	𝕦	𝖚	𝗎	𝘂	𝘶	𝙪	𝚞
v	ᵛ	ᵥ	ṽ	ṿ	ⅳ	ⅴ	ⅵ	ⅶ	ⅷ	⒱	ⓥ	㏜	ｖ	𝐯	𝑣	𝒗	𝓋	𝓿	𝔳	𝕧	𝖛	𝗏	𝘃	𝘷	𝙫	𝚟
w	ŵ	ʷ	ẁ	ẃ	ẅ	ẇ	ẉ	ẘ	⒲	ⓦ	ｗ	𝐰	𝑤	𝒘	𝓌	𝔀	𝔴	𝕨	𝖜	𝗐	𝘄	𝘸	𝙬	𝚠
x	ˣ	ẋ	ẍ	ₓ	ⅸ	ⅹ	ⅺ	ⅻ	⒳	ⓧ	㏓	ｘ	𝐱	𝑥	𝒙	𝓍	𝔁	𝔵	𝕩	𝖝	𝗑	𝘅	𝘹	𝙭	𝚡
y	ý	ÿ	ŷ	ȳ	ʸ	ẏ	ẙ	ỳ	ỵ	ỷ	ỹ	⒴	ⓨ	㏉	ｙ	𝐲	𝑦	𝒚	𝓎	𝔂	𝔶	𝕪	𝖞	𝗒	𝘆	𝘺	𝙮	𝚢
z	ź	ż	ž	ǅ	ǆ	ǲ	ǳ	ᶻ	ẑ	ẓ	ẕ	⒵	ⓩ	㎐	㎑	㎒	㎓	㎔	ｚ	𝐳	𝑧	𝒛	𝓏	𝔃	𝔷	𝕫	𝖟	𝗓	𝘇	𝘻	𝙯	𝚣
{	︷	﹛	｛
|	｜
}	︸	﹜	｝
~	～
¢	￠
£	￡
¥	￥
¦	￤
¬	￢
°	℃	℉
·	Ŀ	ŀ	·
Æ	Ǣ	Ǽ	ᴭ
Ø	Ǿ
æ	ǣ	ǽ	𐞃
ð	ᶞ
ø	ǿ	𐞢
Ħ	ꟸ
ħ	ℏ	𐞕
ı	𝚤
ŋ	ᵑ
œ	ꟹ
Ǝ	ᴲ
Ɛ	ℇ
ƫ	ᶵ
Ʒ	Ǯ
ǀ	𐞶
ǁ	𐞷
ǂ	𐞸
Ȣ	ᴽ
ȷ	𝚥
ɐ	ᵄ
ɑ	ᵅ
ɒ	ᶛ
ɓ	𐞅
ɔ	ᵓ
ɕ	ᶝ
ɖ	𐞋
ɗ	𐞌
ɘ	𐞎
ə	ᵊ	ₔ
ɛ	ᵋ
ɜ	ᵌ	ᶟ
ɞ	𐞏
ɟ	ᶡ
ɠ	𐞓
ɡ	ᶢ
ɢ	𐞒
ɣ	ˠ
ɤ	𐞑
ɥ	ᶣ
ɦ	ʱ
ɧ	𐞗
ɨ	ᶤ
ɩ	ᶥ
ɪ	ᶦ
ɫ	ꭞ
ɬ	𐞛
ɭ	ᶩ
ɮ	𐞞
ɯ	ᵚ
ɰ	ᶭ
ɱ	ᶬ
ɲ	ᶮ
ɳ	ᶯ
ɴ	ᶰ
ɵ	ᶱ
ɶ	𐞣
ɷ	𐞤
ɸ	ᶲ
ɹ	ʴ
ɺ	𐞦
ɻ	ʵ
ɽ	𐞨
ɾ	𐞩
ʀ	𐞪
ʁ	ʶ
ʂ	ᶳ
ʃ	ᶴ
ʄ	𐞘
ʈ	𐞯
ʉ	ᶶ
ʊ	ᶷ
ʋ	ᶹ
ʌ	ᶺ
ʍ	ꭩ
ʎ	𐞠
ʏ	𐞲
ʐ	ᶼ
ʑ	ᶽ
ʒ	ǯ	ᶾ
ʕ	ˤ
ʘ	𐞵
ʙ	𐞄
ʛ	𐞔
ʜ	𐞖
ʝ	ᶨ
ʟ	ᶫ
ʡ	𐞳
ʢ	𐞴
ʣ	𐞇
ʤ	𐞊
ʥ	𐞉
ʦ	𐞬
ʧ	𐞮
ʨ	𐞫
ʩ	𐞐
ʪ	𐞙
ʫ	𐞚
ʹ	ʹ
ʼ	ŉ
ʾ	ẚ
ː	𐞁
ˑ	𐞂
̀	À	È	Ì	Ò	Ù	à	è	ì	ò	ù	Ǜ	ǜ	Ǹ	ǹ	̀	Ѐ	Ѝ	ѐ	ѝ	Ḕ	ḕ	Ṑ	ṑ	Ẁ	ẁ	Ầ	ầ	Ằ	ằ	Ề	ề	Ồ	ồ	Ờ	ờ	Ừ	ừ	Ỳ	ỳ	ἂ	ἃ	Ἂ	Ἃ	ἒ	ἓ	Ἒ	Ἓ	ἢ	ἣ	Ἢ	Ἣ	ἲ	ἳ	Ἲ	Ἳ	ὂ	ὃ	Ὂ	Ὃ	ὒ	ὓ	Ὓ	ὢ	ὣ	Ὢ	Ὣ	ὰ	ὲ	ὴ	ὶ	ὸ	ὺ	ὼ	ᾂ	ᾃ	ᾊ	ᾋ	ᾒ	ᾓ	ᾚ	ᾛ	ᾢ	ᾣ	ᾪ	ᾫ	ᾲ	Ὰ	ῂ	Ὲ	Ὴ	῍	ῒ	Ὶ	῝	ῢ	Ὺ	῭	ῲ	Ὸ	Ὼ
́	´	Á	É	Í	Ó	Ú	Ý	á	é	í	ó	ú	ý	Ć	ć	Ĺ	ĺ	Ń	ń	Ŕ	ŕ	Ś	ś	Ź	ź	Ǘ	ǘ	Ǵ	ǵ	Ǻ	ǻ	Ǽ	ǽ	Ǿ	ǿ	́	̈́	΄	΅	Ά	Έ	Ή	Ί	Ό	Ύ	Ώ	ΐ	ά	έ	ή	ί	ΰ	ό	ύ	ώ	ϓ	Ѓ	Ќ	ѓ	ќ	Ḉ	ḉ	Ḗ	ḗ	Ḯ	ḯ	Ḱ	ḱ	Ḿ	ḿ	Ṍ	ṍ	Ṓ	ṓ	Ṕ	ṕ	Ṥ	ṥ	Ṹ	ṹ	Ẃ	ẃ	Ấ	ấ	Ắ	ắ	Ế	ế	Ố	ố	Ớ	ớ	Ứ	ứ	ἄ	ἅ	Ἄ	Ἅ	ἔ	ἕ	Ἔ	Ἕ	ἤ	ἥ	Ἤ	Ἥ	ἴ	ἵ	Ἴ	Ἵ	ὄ	ὅ	Ὄ	Ὅ	ὔ	ὕ	Ὕ	ὤ	ὥ	Ὤ	Ὥ	ά	έ	ή	ί	ό	ύ	ώ	ᾄ	ᾅ	ᾌ	ᾍ	ᾔ	ᾕ	ᾜ	ᾝ	ᾤ	ᾥ	ᾬ	ᾭ	ᾴ	Ά	ῄ	Έ	Ή	῎	ΐ	Ί	῞	ΰ	Ύ	΅	ῴ	Ό	Ώ	´
̂	Â	Ê	Î	Ô	Û	â	ê	î	ô	û	Ĉ	ĉ	Ĝ	ĝ	Ĥ	ĥ	Ĵ	ĵ	Ŝ	ŝ	Ŵ	ŵ	Ŷ	ŷ	Ẑ	ẑ	Ấ	ấ	Ầ	ầ	Ẩ	ẩ	Ẫ	ẫ	Ậ	ậ	Ế	ế	Ề	ề	Ể	ể	Ễ	ễ	Ệ	ệ	Ố	ố	Ồ	ồ	Ổ	ổ	Ỗ	ỗ	Ộ	ộ
̃	Ã	Ñ	Õ	ã	ñ	õ	Ĩ	ĩ	Ũ	ũ	Ȭ	ȭ	˜	Ṍ	ṍ	Ṏ	ṏ	Ṹ	ṹ	Ṽ	ṽ	Ẫ	ẫ	Ẵ	ẵ	Ẽ	ẽ	Ễ	ễ	Ỗ	ỗ	Ỡ	ỡ	Ữ	ữ	Ỹ	ỹ
̄	¯	Ā	ā	Ē	ē	Ī	ī	Ō	ō	Ū	ū	Ǖ	ǖ	Ǟ	ǟ	Ǡ	ǡ	Ǣ	ǣ	Ǭ	ǭ	Ȫ	ȫ	Ȭ	ȭ	Ȱ	ȱ	Ȳ	ȳ	Ӣ	ӣ	Ӯ	ӯ	Ḕ	ḕ	Ḗ	ḗ	Ḡ	ḡ	Ḹ	ḹ	Ṑ	ṑ	Ṓ	ṓ	Ṝ	ṝ	Ṻ	ṻ	ᾱ	Ᾱ	ῑ	Ῑ	ῡ	Ῡ	￣
̅	‾	﹉	﹊	﹋	﹌
̆	Ă	ă	Ĕ	ĕ	Ğ	ğ	Ĭ	ĭ	Ŏ	ŏ	Ŭ	ŭ	˘	Ў	Й	й	ў	Ӂ	ӂ	Ӑ	ӑ	Ӗ	ӗ	Ḝ	ḝ	Ắ	ắ	Ằ	ằ	Ẳ	ẳ	Ẵ	ẵ	Ặ	ặ	ᾰ	Ᾰ	ῐ	Ῐ	ῠ	Ῠ
̇	Ċ	ċ	Ė	ė	Ġ	ġ	İ	Ż	ż	Ǡ	ǡ	Ȧ	ȧ	Ȯ	ȯ	Ȱ	ȱ	˙	Ḃ	ḃ	Ḋ	ḋ	Ḟ	ḟ	Ḣ	ḣ	Ṁ	ṁ	Ṅ	ṅ	Ṗ	ṗ	Ṙ	ṙ	Ṡ	ṡ	Ṥ	ṥ	Ṧ	ṧ	Ṩ	ṩ	Ṫ	ṫ	Ẇ	ẇ	Ẋ	ẋ	Ẏ	ẏ	ẛ	𐗉	𐗤
̈	¨	Ä	Ë	Ï	Ö	Ü	ä	ë	ï	ö	ü	ÿ	Ÿ	Ǖ	ǖ	Ǘ	ǘ	Ǚ	ǚ	Ǜ	ǜ	Ǟ	ǟ	Ȫ	ȫ	̈́	΅	ΐ	Ϊ	Ϋ	ΰ	ϊ	ϋ	ϔ	Ё	Ї	ё	ї	Ӓ	ӓ	Ӛ	ӛ	Ӝ	ӝ	Ӟ	ӟ	Ӥ	ӥ	Ӧ	ӧ	Ӫ	ӫ	Ӭ	ӭ	Ӱ	ӱ	Ӵ	ӵ	Ӹ	ӹ	Ḧ	ḧ	Ḯ	ḯ	Ṏ	ṏ	Ṻ	ṻ	Ẅ	ẅ	Ẍ	ẍ	ẗ	῁	ῒ	ΐ	ῗ	ῢ	ΰ	ῧ	῭	΅
̉	Ả	ả	Ẩ	ẩ	Ẳ	ẳ	Ẻ	ẻ	Ể	ể	Ỉ	ỉ	Ỏ	ỏ	Ổ	ổ	Ở	ở	Ủ	ủ	Ử	ử	Ỷ	ỷ
̊	Å	å	Ů	ů	Ǻ	ǻ	˚	ẘ	ẙ	Å
̋	Ő	ő	Ű	ű	˝	Ӳ	ӳ
̌	Č	č	Ď	ď	Ě	ě	Ľ	ľ	Ň	ň	Ř	ř	Š	š	Ť	ť	Ž	ž	Ǆ	ǅ	ǆ	Ǎ	ǎ	Ǐ	ǐ	Ǒ	ǒ	Ǔ	ǔ	Ǚ	ǚ	Ǧ	ǧ	Ǩ	ǩ	Ǯ	ǯ	ǰ	Ȟ	ȟ	Ṧ	ṧ
̏	Ȁ	ȁ	Ȅ	ȅ	Ȉ	ȉ	Ȍ	ȍ	Ȑ	ȑ	Ȕ	ȕ	Ѷ	ѷ
̑	Ȃ	ȃ	Ȇ	ȇ	Ȋ	ȋ	Ȏ	ȏ	Ȓ	ȓ	Ȗ	ȗ
̓	̓	ἀ	ἂ	ἄ	ἆ	Ἀ	Ἂ	Ἄ	Ἆ	ἐ	ἒ	ἔ	Ἐ	Ἒ	Ἔ	ἠ	ἢ	ἤ	ἦ	Ἠ	Ἢ	Ἤ	Ἦ	ἰ	ἲ	ἴ	ἶ	Ἰ	Ἲ	Ἴ	Ἶ	ὀ	ὂ	ὄ	Ὀ	Ὂ	Ὄ	ὐ	ὒ	ὔ	ὖ	ὠ	ὢ	ὤ	ὦ	Ὠ	Ὢ	Ὤ	Ὦ	ᾀ	ᾂ	ᾄ	ᾆ	ᾈ	ᾊ	ᾌ	ᾎ	ᾐ	ᾒ	ᾔ	ᾖ	ᾘ	ᾚ	ᾜ	ᾞ	ᾠ	ᾢ	ᾤ	ᾦ	ᾨ	ᾪ	ᾬ	ᾮ	᾽	᾿	῍	῎	῏	ῤ
̔	ἁ	ἃ	ἅ	ἇ	Ἁ	Ἃ	Ἅ	Ἇ	ἑ	ἓ	ἕ	Ἑ	Ἓ	Ἕ	ἡ	ἣ	ἥ	ἧ	Ἡ	Ἣ	Ἥ	Ἧ	ἱ	ἳ	ἵ	ἷ	Ἱ	Ἳ	Ἵ	Ἷ	ὁ	ὃ	ὅ	Ὁ	Ὃ	Ὅ	ὑ	ὓ	ὕ	ὗ	Ὑ	Ὓ	Ὕ	Ὗ	ὡ	ὣ	ὥ	ὧ	Ὡ	Ὣ	Ὥ	Ὧ	ᾁ	ᾃ	ᾅ	ᾇ	ᾉ	ᾋ	ᾍ	ᾏ	ᾑ	ᾓ	ᾕ	ᾗ	ᾙ	ᾛ	ᾝ	ᾟ	ᾡ	ᾣ	ᾥ	ᾧ	ᾩ	ᾫ	ᾭ	ᾯ	῝	῞	῟	ῥ	Ῥ	῾
̛	Ơ	ơ	Ư	ư	Ớ	ớ	Ờ	ờ	Ở	ở	Ỡ	ỡ	Ợ	ợ	Ứ	ứ	Ừ	ừ	Ử	ử	Ữ	ữ	Ự	ự
̣	Ḅ	ḅ	Ḍ	ḍ	Ḥ	ḥ	Ḳ	ḳ	Ḷ	ḷ	Ḹ	ḹ	Ṃ	ṃ	Ṇ	ṇ	Ṛ	ṛ	Ṝ	ṝ	Ṣ	ṣ	Ṩ	ṩ	Ṭ	ṭ	Ṿ	ṿ	Ẉ	ẉ	Ẓ	ẓ	Ạ	ạ	Ậ	ậ	Ặ	ặ	Ẹ	ẹ	Ệ	ệ	Ị	ị	Ọ	ọ	Ộ	ộ	Ợ	ợ	Ụ	ụ	Ự	ự	Ỵ	ỵ
̤	Ṳ	ṳ
̥	Ḁ	ḁ
̦	Ș	ș	Ț	ț
̧	¸	Ç	ç	Ģ	ģ	Ķ	ķ	Ļ	ļ	Ņ	ņ	Ŗ	ŗ	Ş	ş	Ţ	ţ	Ȩ	ȩ	Ḉ	ḉ	Ḑ	ḑ	Ḝ	ḝ	Ḩ	ḩ
̨	Ą	ą	Ę	ę	Į	į	Ų	ų	Ǫ	ǫ	Ǭ	ǭ	˛
̭	Ḓ	ḓ	Ḙ	ḙ	Ḽ	ḽ	Ṋ	ṋ	Ṱ	ṱ	Ṷ	ṷ
̮	Ḫ	ḫ
̰	Ḛ	ḛ	Ḭ	ḭ	Ṵ	ṵ
̱	Ḇ	ḇ	Ḏ	ḏ	Ḵ	ḵ	Ḻ	ḻ	Ṉ	ṉ	Ṟ	ṟ	Ṯ	ṯ	Ẕ	ẕ	ẖ
̳	‗
̸	↚	↛	↮	⇍	⇎	⇏	∄	∉	∌	∤	∦	≁	≄	≇	≉	≠	≢	≭	≮	≯	≰	≱	≴	≵	≸	≹	⊀	⊁	⊄	⊅	⊈	⊉	⊬	⊭	⊮	⊯	⋠	⋡	⋢	⋣	⋪	⋫	⋬	⋭	⫝̸
͂	ἆ	ἇ	Ἆ	Ἇ	ἦ	ἧ	Ἦ	Ἧ	ἶ	ἷ	Ἶ	Ἷ	ὖ	ὗ	Ὗ	ὦ	ὧ	Ὦ	Ὧ	ᾆ	ᾇ	ᾎ	ᾏ	ᾖ	ᾗ	ᾞ	ᾟ	ᾦ	ᾧ	ᾮ	ᾯ	ᾶ	ᾷ	῀	῁	ῆ	ῇ	῏	ῖ	ῗ	῟	ῦ	ῧ	ῶ	ῷ
ͅ	ͺ	ᾀ	ᾁ	ᾂ	ᾃ	ᾄ	ᾅ	ᾆ	ᾇ	ᾈ	ᾉ	ᾊ	ᾋ	ᾌ	ᾍ	ᾎ	ᾏ	ᾐ	ᾑ	ᾒ	ᾓ	ᾔ	ᾕ	ᾖ	ᾗ	ᾘ	ᾙ	ᾚ	ᾛ	ᾜ	ᾝ	ᾞ	ᾟ	ᾠ	ᾡ	ᾢ	ᾣ	ᾤ	ᾥ	ᾦ	ᾧ	ᾨ	ᾩ	ᾪ	ᾫ	ᾬ	ᾭ	ᾮ	ᾯ	ᾲ	ᾳ	ᾴ	ᾷ	ᾼ	ῂ	ῃ	ῄ	ῇ	ῌ	ῲ	ῳ	ῴ	ῷ	ῼ
Α	Ά	Ἀ	Ἁ	Ἂ	Ἃ	Ἄ	Ἅ	Ἆ	Ἇ	ᾈ	ᾉ	ᾊ	ᾋ	ᾌ	ᾍ	ᾎ	ᾏ	Ᾰ	Ᾱ	Ὰ	Ά	ᾼ	𝚨	𝛢	𝜜	𝝖	𝞐
Β	𝚩	𝛣	𝜝	𝝗	𝞑
Γ	ℾ	𝚪	𝛤	𝜞	𝝘	𝞒
Δ	𝚫	𝛥	𝜟	𝝙	𝞓
Ε	Έ	Ἐ	Ἑ	Ἒ	Ἓ	Ἔ	Ἕ	Ὲ	Έ	𝚬	𝛦	𝜠	𝝚	𝞔
Ζ	𝚭	𝛧	𝜡	𝝛	𝞕
Η	Ή	Ἠ	Ἡ	Ἢ	Ἣ	Ἤ	Ἥ	Ἦ	Ἧ	ᾘ	ᾙ	ᾚ	ᾛ	ᾜ	ᾝ	ᾞ	ᾟ	Ὴ	Ή	ῌ	𝚮	𝛨	𝜢	𝝜	𝞖
Θ	ϴ	𝚯	𝚹	𝛩	𝛳	𝜣	𝜭	𝝝	𝝧	𝞗	𝞡
Ι	Ί	Ϊ	Ἰ	Ἱ	Ἲ	Ἳ	Ἴ	Ἵ	Ἶ	Ἷ	Ῐ	Ῑ	Ὶ	Ί	𝚰	𝛪	𝜤	𝝞	𝞘
Κ	𝚱	𝛫	𝜥	𝝟	𝞙
Λ	𝚲	𝛬	𝜦	𝝠	𝞚
Μ	𝚳	𝛭	𝜧	𝝡	𝞛
Ν	𝚴	𝛮	𝜨	𝝢	𝞜
Ξ	𝚵	𝛯	𝜩	𝝣	𝞝
Ο	Ό	Ὀ	Ὁ	Ὂ	Ὃ	Ὄ	Ὅ	Ὸ	Ό	𝚶	𝛰	𝜪	𝝤	𝞞
Π	ℿ	𝚷	𝛱	𝜫	𝝥	𝞟
Ρ	Ῥ	𝚸	𝛲	𝜬	𝝦	𝞠
Σ	Ϲ	𝚺	𝛴	𝜮	𝝨	𝞢
Τ	𝚻	𝛵	𝜯	𝝩	𝞣
Υ	Ύ	Ϋ	ϒ	ϓ	ϔ	Ὑ	Ὓ	Ὕ	Ὗ	Ῠ	Ῡ	Ὺ	Ύ	𝚼	𝛶	𝜰	𝝪	𝞤
Φ	𝚽	𝛷	𝜱	𝝫	𝞥
Χ	𝚾	𝛸	𝜲	𝝬	𝞦
Ψ	𝚿	𝛹	𝜳	𝝭	𝞧
Ω	Ώ	Ὠ	Ὡ	Ὢ	Ὣ	Ὤ	Ὥ	Ὦ	Ὧ	ᾨ	ᾩ	ᾪ	ᾫ	ᾬ	ᾭ	ᾮ	ᾯ	Ὼ	Ώ	ῼ	Ω	㏀	㏁	𝛀	𝛺	𝜴	𝝮	𝞨
α	ά	ἀ	ἁ	ἂ	ἃ	ἄ	ἅ	ἆ	ἇ	ὰ	ά	ᾀ	ᾁ	ᾂ	ᾃ	ᾄ	ᾅ	ᾆ	ᾇ	ᾰ	ᾱ	ᾲ	ᾳ	ᾴ	ᾶ	ᾷ	𝛂	𝛼	𝜶	𝝰	𝞪
β	ϐ	ᵝ	ᵦ	𝛃	𝛽	𝜷	𝝱	𝞫
γ	ᵞ	ᵧ	ℽ	𝛄	𝛾	𝜸	𝝲	𝞬
δ	ᵟ	𝛅	𝛿	𝜹	𝝳	𝞭
ε	έ	ϵ	ἐ	ἑ	ἒ	ἓ	ἔ	ἕ	ὲ	έ	𝛆	𝛜	𝜀	𝜖	𝜺	𝝐	𝝴	𝞊	𝞮	𝟄
ζ	𝛇	𝜁	𝜻	𝝵	𝞯
η	ή	ἠ	ἡ	ἢ	ἣ	ἤ	ἥ	ἦ	ἧ	ὴ	ή	ᾐ	ᾑ	ᾒ	ᾓ	ᾔ	ᾕ	ᾖ	ᾗ	ῂ	ῃ	ῄ	ῆ	ῇ	𝛈	𝜂	𝜼	𝝶	𝞰
θ	ϑ	ᶿ	𝛉	𝛝	𝜃	𝜗	𝜽	𝝑	𝝷	𝞋	𝞱	𝟅
ι	ΐ	ί	ϊ	ἰ	ἱ	ἲ	ἳ	ἴ	ἵ	ἶ	ἷ	ὶ	ί	ι	ῐ	ῑ	ῒ	ΐ	ῖ	ῗ	𝛊	𝜄	𝜾	𝝸	𝞲
κ	ϰ	𝛋	𝛞	𝜅	𝜘	𝜿	𝝒	𝝹	𝞌	𝞳	𝟆
λ	𝛌	𝜆	𝝀	𝝺	𝞴
μ	µ	㎂	㎌	㎍	㎕	㎛	㎲	㎶	㎼	𝛍	𝜇	𝝁	𝝻	𝞵
ν	𝛎	𝜈	𝝂	𝝼	𝞶
ξ	𝛏	𝜉	𝝃	𝝽	𝞷
ο	ό	ὀ	ὁ	ὂ	ὃ	ὄ	ὅ	ὸ	ό	𝛐	𝜊	𝝄	𝝾	𝞸
π	ϖ	ℼ	𝛑	𝛡	𝜋	𝜛	𝝅	𝝕	𝝿	𝞏	𝞹	𝟉
ρ	ϱ	ᵨ	ῤ	ῥ	𝛒	𝛠	𝜌	𝜚	𝝆	𝝔	𝞀	𝞎	𝞺	𝟈
ς	ϲ	𝛓	𝜍	𝝇	𝞁	𝞻
σ	𝛔	𝜎	𝝈	𝞂	𝞼
τ	𝛕	𝜏	𝝉	𝞃	𝞽
υ	ΰ	ϋ	ύ	ὐ	ὑ	ὒ	ὓ	ὔ	ὕ	ὖ	ὗ	ὺ	ύ	ῠ	ῡ	ῢ	ΰ	ῦ	ῧ	𝛖	𝜐	𝝊	𝞄	𝞾
φ	ϕ	ᵠ	ᵩ	𝛗	𝛟	𝜑	𝜙	𝝋	𝝓	𝞅	𝞍	𝞿	𝟇
χ	ᵡ	ᵪ	𝛘	𝜒	𝝌	𝞆	𝟀
ψ	𝛙	𝜓	𝝍	𝞇	𝟁
ω	ώ	ὠ	ὡ	ὢ	ὣ	ὤ	ὥ	ὦ	ὧ	ὼ	ώ	ᾠ	ᾡ	ᾢ	ᾣ	ᾤ	ᾥ	ᾦ	ᾧ	ῲ	ῳ	ῴ	ῶ	ῷ	𝛚	𝜔	𝝎	𝞈	𝟂
Ϝ	𝟊
ϝ	𝟋
І	Ї
А	Ӑ	Ӓ
Г	Ѓ
Е	Ѐ	Ё	Ӗ
Ж	Ӂ	Ӝ
З	Ӟ
И	Ѝ	Й	Ӣ	Ӥ
К	Ќ
О	Ӧ
У	Ў	Ӯ	Ӱ	Ӳ
Ч	Ӵ
Ы	Ӹ
Э	Ӭ
а	ӑ	ӓ	𞀰	𞁑
б	𞀱	𞁒
в	𞀲	𞁓
г	ѓ	𞀳	𞁔
д	𞀴	𞁕
е	ѐ	ё	ӗ	𞀵	𞁖
ж	ӂ	ӝ	𞀶	𞁗
з	ӟ	𞀷	𞁘
и	й	ѝ	ӣ	ӥ	𞀸	𞁙
к	ќ	𞀹	𞁚
л	𞀺	𞁛
м	𞀻
н	ᵸ
о	ӧ	𞀼	𞁜
п	𞀽	𞁝
р	𞀾
с	𞀿	𞁞
т	𞁀
у	ў	ӯ	ӱ	ӳ	𞁁	𞁟
ф	𞁂	𞁠
х	𞁃	𞁡
ц	𞁄	𞁢
ч	ӵ	𞁅	𞁣
ш	𞁆	𞁤
ъ	ꚜ	𞁥
ы	ӹ	𞁇	𞁦
ь	ꚝ
э	ӭ	𞁈
ю	𞁉
ѕ	𞁩
і	ї	𞁌	𞁨
ј	𞁍
џ	𞁪
Ѵ	Ѷ
ѵ	ѷ
ґ	𞁧
ҫ	𞁫
ү	𞁏
ұ	𞁭
ӏ	𞁐
Ә	Ӛ
ә	ӛ	𞁋
Ө	Ӫ
ө	ӫ	𞁎
ե	և	ﬔ
ի	ﬕ
խ	ﬗ
մ	ﬓ	ﬔ	ﬕ	ﬗ
ն	ﬓ	ﬖ
վ	ﬖ
ւ	և
ִ	יִ
ַ	ײַ	אַ
ָ	אָ
ֹ	וֹ
ּ	שּׁ	שּׂ	אּ	בּ	גּ	דּ	הּ	וּ	זּ	טּ	יּ	ךּ	כּ	לּ	מּ	נּ	סּ	ףּ	פּ	צּ	קּ	רּ	שּ	תּ
ֿ	בֿ	כֿ	פֿ
ׁ	שׁ	שּׁ
ׂ	שׂ	שּׂ
א	ℵ	ﬡ	אַ	אָ	אּ	ﭏ
ב	ℶ	בּ	בֿ
ג	ℷ	גּ
ד	ℸ	ﬢ	דּ
ה	ﬣ	הּ
ו	וּ	וֹ
ז	זּ
ט	טּ
י	יִ	יּ
ך	ךּ
כ	ﬤ	כּ	כֿ
ל	ﬥ	לּ	ﭏ
ם	ﬦ
מ	מּ
נ	נּ
ס	סּ
ע	ﬠ
ף	ףּ
פ	פּ	פֿ
צ	צּ
ק	קּ
ר	ﬧ	רּ
ש	שׁ	שׂ	שּׁ	שּׂ	שּ
ת	ﬨ	תּ
ײ	ײַ
ء	ﺀ
ا	آ	أ	إ	ٵ	ﯪ	ﯫ	ﰷ	ﲀ	ﲈ	ﴼ	ﴽ	ﷲ	ﷳ	ﷺ	ﷻ	﷼	ﺁ	ﺂ	ﺃ	ﺄ	ﺇ	ﺈ	ﺍ	ﺎ	ﻵ	ﻶ	ﻷ	ﻸ	ﻹ	ﻺ	ﻻ	ﻼ	𞸀	𞺀
ب	ﰅ	ﰆ	ﰇ	ﰈ	ﰉ	ﰊ	ﱪ	ﱫ	ﱬ	ﱭ	ﱮ	ﱯ	ﲜ	ﲝ	ﲞ	ﲟ	ﲠ	ﳡ	ﳢ	ﶞ	ﷂ	ﷳ	ﺏ	ﺐ	ﺑ	ﺒ	𞸁	𞸡	𞹡	𞺁	𞺡
ة	ﺓ	ﺔ
ت	ﰋ	ﰌ	ﰍ	ﰎ	ﰏ	ﰐ	ﱰ	ﱱ	ﱲ	ﱳ	ﱴ	ﱵ	ﲡ	ﲢ	ﲣ	ﲤ	ﲥ	ﳣ	ﳤ	ﵐ	ﵑ	ﵒ	ﵓ	ﵔ	ﵕ	ﵖ	ﵗ	ﶟ	ﶠ	ﶡ	ﶢ	ﶣ	ﶤ	ﺕ	ﺖ	ﺗ	ﺘ	𞸕	𞸵	𞹵	𞺕	𞺵
ث	ﰑ	ﰒ	ﰓ	ﰔ	ﱶ	ﱷ	ﱸ	ﱹ	ﱺ	ﱻ	ﲦ	ﳥ	ﳦ	ﺙ	ﺚ	ﺛ	ﺜ	𞸖	𞸶	𞹶	𞺖	𞺶
ج	ﰀ	ﰅ	ﰋ	ﰑ	ﰕ	ﰖ	ﰗ	ﰙ	ﰜ	ﰢ	ﰩ	ﰫ	ﰭ	ﰸ	ﰿ	ﱅ	ﱋ	ﱑ	ﱕ	ﲗ	ﲜ	ﲡ	ﲧ	ﲨ	ﲩ	ﲫ	ﲭ	ﲴ	ﲺ	ﲼ	ﲾ	ﳄ	ﳉ	ﳎ	ﳒ	ﳗ	ﳚ	ﴁ	ﴂ	ﴉ	ﴝ	ﴞ	ﴥ	ﴭ	ﴴ	ﴷ	ﵐ	ﵑ	ﵒ	ﵕ	ﵘ	ﵙ	ﵜ	ﵝ	ﵞ	ﵡ	ﵩ	ﵵ	ﶃ	ﶄ	ﶉ	ﶌ	ﶍ	ﶎ	ﶒ	ﶓ	ﶗ	ﶘ	ﶙ	ﶟ	ﶠ	ﶥ	ﶦ	ﶧ	ﶬ	ﶯ	ﶸ	ﶺ	ﶼ	ﶽ	ﶾ	ﶿ	ﷀ	ﷄ	ﷇ	ﷻ	ﺝ	ﺞ	ﺟ	ﺠ	𞸂	𞸢	𞹂	𞹢	𞺂	𞺢
ح	ﰁ	ﰆ	ﰌ	ﰕ	ﰗ	ﰘ	ﰚ	ﰝ	ﰠ	ﰣ	ﰦ	ﰮ	ﰳ	ﰹ	ﱀ	ﱆ	ﱌ	ﱖ	ﲘ	ﲝ	ﲢ	ﲧ	ﲩ	ﲪ	ﲮ	ﲱ	ﲵ	ﲸ	ﲿ	ﳂ	ﳅ	ﳊ	ﳏ	ﳓ	ﳛ	ﳿ	ﴀ	ﴊ	ﴛ	ﴜ	ﴦ	ﴮ	ﴵ	ﴸ	ﵑ	ﵒ	ﵓ	ﵖ	ﵘ	ﵙ	ﵚ	ﵛ	ﵜ	ﵝ	ﵟ	ﵠ	ﵤ	ﵥ	ﵧ	ﵨ	ﵮ	ﵱ	ﵲ	ﵾ	ﶀ	ﶁ	ﶂ	ﶇ	ﶈ	ﶉ	ﶊ	ﶋ	ﶌ	ﶕ	ﶖ	ﶦ	ﶩ	ﶪ	ﶫ	ﶮ	ﶳ	ﶴ	ﶵ	ﶸ	ﶽ	ﶾ	ﶿ	ﷂ	ﷴ	ﺡ	ﺢ	ﺣ	ﺤ	𞸇	𞸧	𞹇	𞹧	𞺇	𞺧
خ	ﰇ	ﰍ	ﰙ	ﰚ	ﰛ	ﰞ	ﰤ	ﰯ	ﰺ	ﱁ	ﱇ	ﱍ	ﱗ	ﲙ	ﲞ	ﲣ	ﲫ	ﲬ	ﲯ	ﲲ	ﲶ	ﳀ	ﳆ	ﳋ	ﳐ	ﳔ	ﳜ	ﴃ	ﴄ	ﴋ	ﴟ	ﴠ	ﴧ	ﴯ	ﴶ	ﴹ	ﵔ	ﵗ	ﵪ	ﵫ	ﵯ	ﵰ	ﵼ	ﵽ	ﶅ	ﶆ	ﶎ	ﶏ	ﶒ	ﶞ	ﶡ	ﶢ	ﶨ	ﶹ	ﷆ	ﺥ	ﺦ	ﺧ	ﺨ	𞸗	𞸷	𞹗	𞹷	𞺗	𞺷
د	ﷴ	ﺩ	ﺪ	𞸃	𞺃	𞺣
ذ	ﱛ	ﺫ	ﺬ	𞸘	𞺘	𞺸
ر	ﱜ	ﱤ	ﱪ	ﱰ	ﱶ	ﲊ	ﲑ	ﴍ	ﴎ	ﴏ	ﴐ	ﴩ	ﴪ	ﴫ	ﴬ	ﷳ	ﷶ	﷼	ﺭ	ﺮ	𞸓	𞺓	𞺳
ز	ﱥ	ﱫ	ﱱ	ﱷ	ﲋ	ﲒ	ﺯ	ﺰ	𞸆	𞺆	𞺦
س	ﰜ	ﰝ	ﰞ	ﰟ	ﲭ	ﲮ	ﲯ	ﲰ	ﳧ	ﳨ	ﳻ	ﳼ	ﴎ	ﴗ	ﴘ	ﴪ	ﴱ	ﴴ	ﴵ	ﴶ	ﵜ	ﵝ	ﵞ	ﵟ	ﵠ	ﵡ	ﵢ	ﵣ	ﶨ	ﷆ	ﷶ	ﷸ	ﷺ	ﺱ	ﺲ	ﺳ	ﺴ	𞸎	𞸮	𞹎	𞹮	𞺎	𞺮
ش	ﳩ	ﳪ	ﳽ	ﳾ	ﴉ	ﴊ	ﴋ	ﴌ	ﴍ	ﴙ	ﴚ	ﴥ	ﴦ	ﴧ	ﴨ	ﴩ	ﴭ	ﴮ	ﴯ	ﴰ	ﴲ	ﴷ	ﴸ	ﴹ	ﵧ	ﵨ	ﵩ	ﵪ	ﵫ	ﵬ	ﵭ	ﶪ	ﺵ	ﺶ	ﺷ	ﺸ	𞸔	𞸴	𞹔	𞹴	𞺔	𞺴
ص	ﰠ	ﰡ	ﲱ	ﲲ	ﲳ	ﴅ	ﴆ	ﴏ	ﴡ	ﴢ	ﴫ	ﵤ	ﵥ	ﵦ	ﶩ	ﷅ	ﷰ	ﷵ	ﷹ	ﷺ	ﺹ	ﺺ	ﺻ	ﺼ	𞸑	𞸱	𞹑	𞹱	𞺑	𞺱
ض	ﰢ	ﰣ	ﰤ	ﰥ	ﲴ	ﲵ	ﲶ	ﲷ	ﴇ	ﴈ	ﴐ	ﴣ	ﴤ	ﴬ	ﵮ	ﵯ	ﵰ	ﶫ	ﺽ	ﺾ	ﺿ	ﻀ	𞸙	𞸹	𞹙	𞹹	𞺙	𞺹
ط	ﰦ	ﰧ	ﲸ	ﳵ	ﳶ	ﴑ	ﴒ	ﴳ	ﴺ	ﵱ	ﵲ	ﵳ	ﵴ	ﻁ	ﻂ	ﻃ	ﻄ	𞸈	𞹨	𞺈	𞺨
ظ	ﰨ	ﲹ	ﴻ	ﻅ	ﻆ	ﻇ	ﻈ	𞸚	𞹺	𞺚	𞺺
ع	ﰩ	ﰪ	ﲺ	ﲻ	ﳷ	ﳸ	ﴓ	ﴔ	ﵵ	ﵶ	ﵷ	ﵸ	ﶶ	ﷄ	ﷵ	ﷷ	ﷺ	ﻉ	ﻊ	ﻋ	ﻌ	𞸏	𞸯	𞹏	𞹯	𞺏	𞺯
غ	ﰫ	ﰬ	ﲼ	ﲽ	ﳹ	ﳺ	ﴕ	ﴖ	ﵹ	ﵺ	ﵻ	ﻍ	ﻎ	ﻏ	ﻐ	𞸛	𞸻	𞹛	𞹻	𞺛	𞺻
ـ	ﳲ	ﳳ	ﳴ	ﹱ	ﹷ	ﹹ	ﹻ	ﹽ	ﹿ
ف	ﰭ	ﰮ	ﰯ	ﰰ	ﰱ	ﰲ	ﱼ	ﱽ	ﲾ	ﲿ	ﳀ	ﳁ	ﵼ	ﵽ	ﷁ	ﻑ	ﻒ	ﻓ	ﻔ	𞸐	𞸰	𞹰	𞺐	𞺰
ق	ﰳ	ﰴ	ﰵ	ﰶ	ﱾ	ﱿ	ﳂ	ﳃ	ﵾ	ﵿ	ﶲ	ﶴ	ﷱ	ﻕ	ﻖ	ﻗ	ﻘ	𞸒	𞸲	𞹒	𞹲	𞺒	𞺲
ك	ﰷ	ﰸ	ﰹ	ﰺ	ﰻ	ﰼ	ﰽ	ﰾ	ﲀ	ﲁ	ﲂ	ﲃ	ﲄ	ﳄ	ﳅ	ﳆ	ﳇ	ﳈ	ﳫ	ﳬ	ﶷ	ﶻ	ﷃ	ﷳ	ﻙ	ﻚ	ﻛ	ﻜ	𞸊	𞸪	𞹪
ل	ﰻ	ﰿ	ﱀ	ﱁ	ﱂ	ﱃ	ﱄ	ﲁ	ﲅ	ﲆ	ﲇ	ﳇ	ﳉ	ﳊ	ﳋ	ﳌ	ﳍ	ﳫ	ﳭ	ﶀ	ﶁ	ﶂ	ﶃ	ﶄ	ﶅ	ﶆ	ﶇ	ﶈ	ﶬ	ﶭ	ﶵ	ﶺ	ﶼ	ﷰ	ﷱ	ﷲ	ﷵ	ﷶ	ﷷ	ﷸ	ﷹ	ﷺ	ﷻ	﷼	ﻝ	ﻞ	ﻟ	ﻠ	ﻵ	ﻶ	ﻷ	ﻸ	ﻹ	ﻺ	ﻻ	ﻼ	𞸋	𞸫	𞹋	𞺋	𞺫
م	ﰂ	ﰈ	ﰎ	ﰒ	ﰖ	ﰘ	ﰛ	ﰟ	ﰡ	ﰥ	ﰧ	ﰨ	ﰪ	ﰬ	ﰰ	ﰴ	ﰼ	ﱂ	ﱅ	ﱆ	ﱇ	ﱈ	ﱉ	ﱊ	ﱎ	ﱒ	ﱘ	ﱦ	ﱬ	ﱲ	ﱸ	ﲂ	ﲅ	ﲈ	ﲉ	ﲌ	ﲓ	ﲚ	ﲟ	ﲤ	ﲦ	ﲨ	ﲪ	ﲬ	ﲰ	ﲳ	ﲷ	ﲹ	ﲻ	ﲽ	ﳁ	ﳃ	ﳈ	ﳌ	ﳎ	ﳏ	ﳐ	ﳑ	ﳕ	ﳘ	ﳝ	ﳟ	ﳡ	ﳣ	ﳥ	ﳧ	ﳩ	ﳬ	ﳭ	ﳮ	ﳰ	ﴌ	ﴨ	ﴰ	ﴳ	ﴺ	ﴻ	ﵐ	ﵓ	ﵔ	ﵕ	ﵖ	ﵗ	ﵘ	ﵙ	ﵚ	ﵛ	ﵟ	ﵠ	ﵡ	ﵢ	ﵣ	ﵦ	ﵧ	ﵨ	ﵪ	ﵫ	ﵬ	ﵭ	ﵯ	ﵰ	ﵱ	ﵲ	ﵳ	ﵴ	ﵵ	ﵶ	ﵷ	ﵸ	ﵹ	ﵺ	ﵻ	ﵼ	ﵽ	ﵾ	ﵿ	ﶀ	ﶅ	ﶆ	ﶇ	ﶈ	ﶉ	ﶊ	ﶋ	ﶌ	ﶍ	ﶎ	ﶏ	ﶒ	ﶓ	ﶔ	ﶕ	ﶗ	ﶘ	ﶚ	ﶛ	ﶜ	ﶝ	ﶣ	ﶤ	ﶥ	ﶧ	ﶭ	ﶰ	ﶱ	ﶲ	ﶴ	ﶵ	ﶶ	ﶷ	ﶹ	ﶺ	ﶻ	ﶼ	ﷀ	ﷁ	ﷃ	ﷄ	ﷅ	ﷴ	ﷵ	ﷸ	ﷺ	ﻡ	ﻢ	ﻣ	ﻤ	𞸌	𞸬	𞹬	𞺌	𞺬
ن	ﱋ	ﱌ	ﱍ	ﱎ	ﱏ	ﱐ	ﱧ	ﱭ	ﱳ	ﱹ	ﲊ	ﲋ	ﲌ	ﲍ	ﲎ	ﲏ	ﲔ	ﳒ	ﳓ	ﳔ	ﳕ	ﳖ	ﳮ	ﳯ	ﶕ	ﶖ	ﶗ	ﶘ	ﶙ	ﶚ	ﶛ	ﶳ	ﶸ	ﶽ	ﷇ	ﻥ	ﻦ	ﻧ	ﻨ	𞸍	𞸭	𞹍	𞹭	𞺍	𞺭
ه	ﱑ	ﱒ	ﱓ	ﱔ	ﲛ	ﲠ	ﲥ	ﳍ	ﳖ	ﳗ	ﳘ	ﳙ	ﳞ	ﳠ	ﳢ	ﳤ	ﳦ	ﳨ	ﳪ	ﳯ	ﳱ	ﴱ	ﴲ	ﶓ	ﶔ	ﷲ	ﷷ	ﷺ	ﷻ	ﻩ	ﻪ	ﻫ	ﻬ	𞸤	𞹤	𞺄
و	ؤ	ٶ	ﯮ	ﯯ	ﷶ	ﷸ	ﷺ	ﺅ	ﺆ	ﻭ	ﻮ	𞸅	𞺅	𞺥
ى	ﯨ	ﯩ	ﯹ	ﯺ	ﯻ	ﰃ	ﰉ	ﰏ	ﰓ	ﰱ	ﰵ	ﰽ	ﱃ	ﱉ	ﱏ	ﱓ	ﱙ	ﱝ	ﱨ	ﱮ	ﱴ	ﱺ	ﱼ	ﱾ	ﲃ	ﲆ	ﲎ	ﲐ	ﲕ	ﳵ	ﳷ	ﳹ	ﳻ	ﳽ	ﳿ	ﴁ	ﴃ	ﴅ	ﴇ	ﴑ	ﴓ	ﴕ	ﴗ	ﴙ	ﴛ	ﴝ	ﴟ	ﴡ	ﴣ	ﵛ	ﵞ	ﵮ	ﵸ	ﵻ	ﶂ	ﶖ	ﶙ	ﶛ	ﶠ	ﶢ	ﶤ	ﶦ	ﶧ	ﶨ	ﷹ	ﷺ	ﻯ	ﻰ
ي	ئ	ٸ	ﯪ	ﯫ	ﯬ	ﯭ	ﯮ	ﯯ	ﯰ	ﯱ	ﯲ	ﯳ	ﯴ	ﯵ	ﯶ	ﯷ	ﯸ	ﯹ	ﯺ	ﯻ	ﰀ	ﰁ	ﰂ	ﰃ	ﰄ	ﰊ	ﰐ	ﰔ	ﰲ	ﰶ	ﰾ	ﱄ	ﱊ	ﱐ	ﱔ	ﱕ	ﱖ	ﱗ	ﱘ	ﱙ	ﱚ	ﱤ	ﱥ	ﱦ	ﱧ	ﱨ	ﱩ	ﱯ	ﱵ	ﱻ	ﱽ	ﱿ	ﲄ	ﲇ	ﲏ	ﲑ	ﲒ	ﲓ	ﲔ	ﲕ	ﲖ	ﲗ	ﲘ	ﲙ	ﲚ	ﲛ	ﳚ	ﳛ	ﳜ	ﳝ	ﳞ	ﳟ	ﳠ	ﳰ	ﳱ	ﳶ	ﳸ	ﳺ	ﳼ	ﳾ	ﴀ	ﴂ	ﴄ	ﴆ	ﴈ	ﴒ	ﴔ	ﴖ	ﴘ	ﴚ	ﴜ	ﴞ	ﴠ	ﴢ	ﴤ	ﵚ	ﵩ	ﵴ	ﵺ	ﶁ	ﶋ	ﶚ	ﶜ	ﶝ	ﶞ	ﶟ	ﶡ	ﶣ	ﶥ	ﶩ	ﶪ	ﶫ	ﶬ	ﶭ	ﶮ	ﶯ	ﶰ	ﶱ	ﶲ	ﶳ	ﶶ	ﶷ	ﶹ	ﶾ	ﶿ	ﷀ	ﷁ	ﷂ	ﷆ	ﷇ	ﷷ	ﷺ	ﺉ	ﺊ	ﺋ	ﺌ	ﻱ	ﻲ	ﻳ	ﻴ	𞸉	𞸩	𞹉	𞹩	𞺉	𞺩
ً	ﴼ	ﴽ	ﹰ	ﹱ
ٌ	ﱞ	ﹲ
ٍ	ﱟ	ﹴ
َ	ﱠ	ﳲ	ﹶ	ﹷ
ُ	ﱡ	ﳳ	ﹸ	ﹹ
ِ	ﱢ	ﳴ	ﹺ	ﹻ
ّ	ﱞ	ﱟ	ﱠ	ﱡ	ﱢ	ﱣ	ﳲ	ﳳ	ﳴ	ﹼ	ﹽ
ْ	ﹾ	ﹿ
ٓ	آ	ﺁ	ﺂ	ﻵ	ﻶ
ٔ	أ	ؤ	ئ	ۀ	ۂ	ۓ	ﮤ	ﮥ	ﮰ	ﮱ	ﯪ	ﯫ	ﯬ	ﯭ	ﯮ	ﯯ	ﯰ	ﯱ	ﯲ	ﯳ	ﯴ	ﯵ	ﯶ	ﯷ	ﯸ	ﯹ	ﯺ	ﯻ	ﰀ	ﰁ	ﰂ	ﰃ	ﰄ	ﱤ	ﱥ	ﱦ	ﱧ	ﱨ	ﱩ	ﲗ	ﲘ	ﲙ	ﲚ	ﲛ	ﳟ	ﳠ	ﺃ	ﺄ	ﺅ	ﺆ	ﺉ	ﺊ	ﺋ	ﺌ	ﻷ	ﻸ
ٕ	إ	ﺇ	ﺈ	ﻹ	ﻺ
ٮ	𞸜	𞹼
ٯ	𞸟	𞹟
ٰ	ﱛ	ﱜ	ﱝ	ﱣ	ﲐ	ﳙ
ٱ	ﭐ	ﭑ
ٴ	ٵ	ٶ	ٷ	ٸ	ﯝ
ٹ	ﭦ	ﭧ	ﭨ	ﭩ
ٺ	ﭞ	ﭟ	ﭠ	ﭡ
ٻ	ﭒ	ﭓ	ﭔ	ﭕ
پ	ﭖ	ﭗ	ﭘ	ﭙ
ٿ	ﭢ	ﭣ	ﭤ	ﭥ
ڀ	ﭚ	ﭛ	ﭜ	ﭝ
ڃ	ﭶ	ﭷ	ﭸ	ﭹ
ڄ	ﭲ	ﭳ	ﭴ	ﭵ
چ	ﭺ	ﭻ	ﭼ	ﭽ
ڇ	ﭾ	ﭿ	ﮀ	ﮁ
ڈ	ﮈ	ﮉ
ڌ	ﮄ	ﮅ
ڍ	ﮂ	ﮃ
ڎ	ﮆ	ﮇ
ڑ	ﮌ	ﮍ
ژ	ﮊ	ﮋ
ڡ	𞸞	𞹾
ڤ	ﭪ	ﭫ	ﭬ	ﭭ
ڦ	ﭮ	ﭯ	ﭰ	ﭱ
ک	ﮎ	ﮏ	ﮐ	ﮑ
ڭ	ﯓ	ﯔ	ﯕ	ﯖ
گ	ﮒ	ﮓ	ﮔ	ﮕ
ڱ	ﮚ	ﮛ	ﮜ	ﮝ
ڳ	ﮖ	ﮗ	ﮘ	ﮙ
ں	ﮞ	ﮟ	𞸝	𞹝
ڻ	ﮠ	ﮡ	ﮢ	ﮣ
ھ	ﮪ	ﮫ	ﮬ	ﮭ
ہ	ۂ	ﮦ	ﮧ	ﮨ	ﮩ
ۅ	ﯠ	ﯡ
ۆ	ﯙ	ﯚ	ﯲ	ﯳ
ۇ	ٷ	ﯗ	ﯘ	ﯝ	ﯰ	ﯱ
ۈ	ﯛ	ﯜ	ﯴ	ﯵ
ۉ	ﯢ	ﯣ
ۋ	ﯞ	ﯟ
ی	ﯼ	ﯽ	ﯾ	ﯿ	﷼
ې	ﯤ	ﯥ	ﯦ	ﯧ	ﯶ	ﯷ	ﯸ
ے	ۓ	ﮮ	ﮯ	ﮰ	ﮱ	ﷰ	ﷱ
ە	ۀ	ﮤ	ﮥ	ﯬ	ﯭ
क	क़
ख	ख़
ग	ग़
ज	ज़
ड	ड़
ढ	ढ़
न	ऩ
फ	फ़
य	य़
र	ऱ
ळ	ऴ
़	ऩ	ऱ	ऴ	क़	ख़	ग़	ज़	ड़	ढ़	फ़	य़
ড	ড়
ঢ	ঢ়
য	য়
়	ড়	ঢ়	য়
া	ো
ে	ো	ৌ
ৗ	ৌ
ਖ	ਖ਼
ਗ	ਗ਼
ਜ	ਜ਼
ਫ	ਫ਼
ਲ	ਲ਼
ਸ	ਸ਼
਼	ਲ਼	ਸ਼	ਖ਼	ਗ਼	ਜ਼	ਫ਼
ଡ	ଡ଼
ଢ	ଢ଼
଼	ଡ଼	ଢ଼
ା	ୋ
େ	ୈ	ୋ	ୌ
ୖ	ୈ
ୗ	ୌ
ஒ	ஔ
ா	ொ	ோ
ெ	ொ	ௌ
ே	ோ
ௗ	ஔ	ௌ
ె	ై
ౖ	ై
ಿ	ೀ
ೂ	ೊ	ೋ
ೆ	ೇ	ೈ	ೊ	ೋ
ೕ	ೀ	ೇ	ೋ
ೖ	ೈ
ാ	ൊ	ോ
െ	ൊ	ൌ
േ	ോ
ൗ	ൌ
්	ේ	ෝ
ා	ො	ෝ
ෙ	ේ	ො	ෝ	ෞ
ෟ	ෞ
า	ำ
ํ	ำ
ນ	ໜ
ມ	ໝ
ຫ	ໜ	ໝ
າ	ຳ
ໍ	ຳ
་	༌
ཀ	ཀྵ
ག	གྷ
ཌ	ཌྷ
ད	དྷ
བ	བྷ
ཛ	ཛྷ
ཱ	ཱི	ཱུ	ཷ	ཹ	ཱྀ
ི	ཱི
ུ	ཱུ
ྀ	ྲྀ	ཷ	ླྀ	ཹ	ཱྀ
ྐ	ྐྵ
ྒ	ྒྷ
ྜ	ྜྷ
ྡ	ྡྷ
ྦ	ྦྷ
ྫ	ྫྷ
ྲ	ྲྀ	ཷ
ླ	ླྀ	ཹ
ྵ	ཀྵ	ྐྵ
ྷ	གྷ	ཌྷ	དྷ	བྷ	ཛྷ	ྒྷ	ྜྷ	ྡྷ	ྦྷ	ྫྷ
ဥ	ဦ
ီ	ဦ
ნ	ჼ
ᄀ	ㄱ	㈀	㈎	㉠	㉮	㉼	가	각	갂	갃	간	갅	갆	갇	갈	갉	갊	갋	갌	갍	갎	갏	감	갑	값	갓	갔	강	갖	갗	갘	같	갚	갛	개	객	갞	갟	갠	갡	갢	갣	갤	갥	갦	갧	갨	갩	갪	갫	갬	갭	갮	갯	갰	갱	갲	갳	갴	갵	갶	갷	갸	갹	갺	갻	갼	갽	갾	갿	걀	걁	걂	걃	걄	걅	걆	걇	걈	걉	걊	걋	걌	걍	걎	걏	걐	걑	걒	걓	걔	걕	걖	걗	걘	걙	걚	걛	걜	걝	걞	걟	걠	걡	걢	걣	걤	걥	걦	걧	걨	걩	걪	걫	걬	걭	걮	걯	거	걱	걲	걳	건	걵	걶	걷	걸	걹	걺	걻	걼	걽	걾	걿	검	겁	겂	것	겄	겅	겆	겇	겈	겉	겊	겋	게	겍	겎	겏	겐	겑	겒	겓	겔	겕	겖	겗	겘	겙	겚	겛	겜	겝	겞	겟	겠	겡	겢	겣	겤	겥	겦	겧	겨	격	겪	겫	견	겭	겮	겯	결	겱	겲	겳	겴	겵	겶	겷	겸	겹	겺	겻	겼	경	겾	겿	곀	곁	곂	곃	계	곅	곆	곇	곈	곉	곊	곋	곌	곍	곎	곏	곐	곑	곒	곓	곔	곕	곖	곗	곘	곙	곚	곛	곜	곝	곞	곟	고	곡	곢	곣	곤	곥	곦	곧	골	곩	곪	곫	곬	곭	곮	곯	곰	곱	곲	곳	곴	공	곶	곷	곸	곹	곺	곻	과	곽	곾	곿	관	괁	괂	괃	괄	괅	괆	괇	괈	괉	괊	괋	괌	괍	괎	괏	괐	광	괒	괓	괔	괕	괖	괗	괘	괙	괚	괛	괜	괝	괞	괟	괠	괡	괢	괣	괤	괥	괦	괧	괨	괩	괪	괫	괬	괭	괮	괯	괰	괱	괲	괳	괴	괵	괶	괷	괸	괹	괺	괻	괼	괽	괾	괿	굀	굁	굂	굃	굄	굅	굆	굇	굈	굉	굊	굋	굌	굍	굎	굏	교	굑	굒	굓	굔	굕	굖	굗	굘	굙	굚	굛	굜	굝	굞	굟	굠	굡	굢	굣	굤	굥	굦	굧	굨	굩	굪	굫	구	국	굮	굯	군	굱	굲	굳	굴	굵	굶	굷	굸	굹	굺	굻	굼	굽	굾	굿	궀	궁	궂	궃	궄	궅	궆	궇	궈	궉	궊	궋	권	궍	궎	궏	궐	궑	궒	궓	궔	궕	궖	궗	궘	궙	궚	궛	궜	궝	궞	궟	궠	궡	궢	궣	궤	궥	궦	궧	궨	궩	궪	궫	궬	궭	궮	궯	궰	궱	궲	궳	궴	궵	궶	궷	궸	궹	궺	궻	궼	궽	궾	궿	귀	귁	귂	귃	귄	귅	귆	귇	귈	귉	귊	귋	귌	귍	귎	귏	귐	귑	귒	귓	귔	귕	귖	귗	귘	귙	귚	귛	규	귝	귞	귟	균	귡	귢	귣	귤	귥	귦	귧	귨	귩	귪	귫	귬	귭	귮	귯	귰	귱	귲	귳	귴	귵	귶	귷	그	극	귺	귻	근	귽	귾	귿	글	긁	긂	긃	긄	긅	긆	긇	금	급	긊	긋	긌	긍	긎	긏	긐	긑	긒	긓	긔	긕	긖	긗	긘	긙	긚	긛	긜	긝	긞	긟	긠	긡	긢	긣	긤	긥	긦	긧	긨	긩	긪	긫	긬	긭	긮	긯	기	긱	긲	긳	긴	긵	긶	긷	길	긹	긺	긻	긼	긽	긾	긿	김	깁	깂	깃	깄	깅	깆	깇	깈	깉	깊	깋	ﾡ
ᄁ	ㄲ	까	깍	깎	깏	깐	깑	깒	깓	깔	깕	깖	깗	깘	깙	깚	깛	깜	깝	깞	깟	깠	깡	깢	깣	깤	깥	깦	깧	깨	깩	깪	깫	깬	깭	깮	깯	깰	깱	깲	깳	깴	깵	깶	깷	깸	깹	깺	깻	깼	깽	깾	깿	꺀	꺁	꺂	꺃	꺄	꺅	꺆	꺇	꺈	꺉	꺊	꺋	꺌	꺍	꺎	꺏	꺐	꺑	꺒	꺓	꺔	꺕	꺖	꺗	꺘	꺙	꺚	꺛	꺜	꺝	꺞	꺟	꺠	꺡	꺢	꺣	꺤	꺥	꺦	꺧	꺨	꺩	꺪	꺫	꺬	꺭	꺮	꺯	꺰	꺱	꺲	꺳	꺴	꺵	꺶	꺷	꺸	꺹	꺺	꺻	꺼	꺽	꺾	꺿	껀	껁	껂	껃	껄	껅	껆	껇	껈	껉	껊	껋	껌	껍	껎	껏	껐	껑	껒	껓	껔	껕	껖	껗	께	껙	껚	껛	껜	껝	껞	껟	껠	껡	껢	껣	껤	껥	껦	껧	껨	껩	껪	껫	껬	껭	껮	껯	껰	껱	껲	껳	껴	껵	껶	껷	껸	껹	껺	껻	껼	껽	껾	껿	꼀	꼁	꼂	꼃	꼄	꼅	꼆	꼇	꼈	꼉	꼊	꼋	꼌	꼍	꼎	꼏	꼐	꼑	꼒	꼓	꼔	꼕	꼖	꼗	꼘	꼙	꼚	꼛	꼜	꼝	꼞	꼟	꼠	꼡	꼢	꼣	꼤	꼥	꼦	꼧	꼨	꼩	꼪	꼫	꼬	꼭	꼮	꼯	꼰	꼱	꼲	꼳	꼴	꼵	꼶	꼷	꼸	꼹	꼺	꼻	꼼	꼽	꼾	꼿	꽀	꽁	꽂	꽃	꽄	꽅	꽆	꽇	꽈	꽉	꽊	꽋	꽌	꽍	꽎	꽏	꽐	꽑	꽒	꽓	꽔	꽕	꽖	꽗	꽘	꽙	꽚	꽛	꽜	꽝	꽞	꽟	꽠	꽡	꽢	꽣	꽤	꽥	꽦	꽧	꽨	꽩	꽪	꽫	꽬	꽭	꽮	꽯	꽰	꽱	꽲	꽳	꽴	꽵	꽶	꽷	꽸	꽹	꽺	꽻	꽼	꽽	꽾	꽿	꾀	꾁	꾂	꾃	꾄	꾅	꾆	꾇	꾈	꾉	꾊	꾋	꾌	꾍	꾎	꾏	꾐	꾑	꾒	꾓	꾔	꾕	꾖	꾗	꾘	꾙	꾚	꾛	꾜	꾝	꾞	꾟	꾠	꾡	꾢	꾣	꾤	꾥	꾦	꾧	꾨	꾩	꾪	꾫	꾬	꾭	꾮	꾯	꾰	꾱	꾲	꾳	꾴	꾵	꾶	꾷	꾸	꾹	꾺	꾻	꾼	꾽	꾾	꾿	꿀	꿁	꿂	꿃	꿄	꿅	꿆	꿇	꿈	꿉	꿊	꿋	꿌	꿍	꿎	꿏	꿐	꿑	꿒	꿓	꿔	꿕	꿖	꿗	꿘	꿙	꿚	꿛	꿜	꿝	꿞	꿟	꿠	꿡	꿢	꿣	꿤	꿥	꿦	꿧	꿨	꿩	꿪	꿫	꿬	꿭	꿮	꿯	꿰	꿱	꿲	꿳	꿴	꿵	꿶	꿷	꿸	꿹	꿺	꿻	꿼	꿽	꿾	꿿	뀀	뀁	뀂	뀃	뀄	뀅	뀆	뀇	뀈	뀉	뀊	뀋	뀌	뀍	뀎	뀏	뀐	뀑	뀒	뀓	뀔	뀕	뀖	뀗	뀘	뀙	뀚	뀛	뀜	뀝	뀞	뀟	뀠	뀡	뀢	뀣	뀤	뀥	뀦	뀧	뀨	뀩	뀪	뀫	뀬	뀭	뀮	뀯	뀰	뀱	뀲	뀳	뀴	뀵	뀶	뀷	뀸	뀹	뀺	뀻	뀼	뀽	뀾	뀿	끀	끁	끂	끃	끄	끅	끆	끇	끈	끉	끊	끋	끌	끍	끎	끏	끐	끑	끒	끓	끔	끕	끖	끗	끘	끙	끚	끛	끜	끝	끞	끟	끠	끡	끢	끣	끤	끥	끦	끧	끨	끩	끪	끫	끬	끭	끮	끯	끰	끱	끲	끳	끴	끵	끶	끷	끸	끹	끺	끻	끼	끽	끾	끿	낀	낁	낂	낃	낄	낅	낆	낇	낈	낉	낊	낋	낌	낍	낎	낏	낐	낑	낒	낓	낔	낕	낖	낗	ﾢ
ᄂ	ㄴ	㈁	㈏	㉡	㉯	나	낙	낚	낛	난	낝	낞	낟	날	낡	낢	낣	낤	낥	낦	낧	남	납	낪	낫	났	낭	낮	낯	낰	낱	낲	낳	내	낵	낶	낷	낸	낹	낺	낻	낼	낽	낾	낿	냀	냁	냂	냃	냄	냅	냆	냇	냈	냉	냊	냋	냌	냍	냎	냏	냐	냑	냒	냓	냔	냕	냖	냗	냘	냙	냚	냛	냜	냝	냞	냟	냠	냡	냢	냣	냤	냥	냦	냧	냨	냩	냪	냫	냬	냭	냮	냯	냰	냱	냲	냳	냴	냵	냶	냷	냸	냹	냺	냻	냼	냽	냾	냿	넀	넁	넂	넃	넄	넅	넆	넇	너	넉	넊	넋	넌	넍	넎	넏	널	넑	넒	넓	넔	넕	넖	넗	넘	넙	넚	넛	넜	넝	넞	넟	넠	넡	넢	넣	네	넥	넦	넧	넨	넩	넪	넫	넬	넭	넮	넯	넰	넱	넲	넳	넴	넵	넶	넷	넸	넹	넺	넻	넼	넽	넾	넿	녀	녁	녂	녃	년	녅	녆	녇	녈	녉	녊	녋	녌	녍	녎	녏	념	녑	녒	녓	녔	녕	녖	녗	녘	녙	녚	녛	녜	녝	녞	녟	녠	녡	녢	녣	녤	녥	녦	녧	녨	녩	녪	녫	녬	녭	녮	녯	녰	녱	녲	녳	녴	녵	녶	녷	노	녹	녺	녻	논	녽	녾	녿	놀	놁	놂	놃	놄	놅	놆	놇	놈	놉	놊	놋	놌	농	놎	놏	놐	놑	높	놓	놔	놕	놖	놗	놘	놙	놚	놛	놜	놝	놞	놟	놠	놡	놢	놣	놤	놥	놦	놧	놨	놩	놪	놫	놬	놭	놮	놯	놰	놱	놲	놳	놴	놵	놶	놷	놸	놹	놺	놻	놼	놽	놾	놿	뇀	뇁	뇂	뇃	뇄	뇅	뇆	뇇	뇈	뇉	뇊	뇋	뇌	뇍	뇎	뇏	뇐	뇑	뇒	뇓	뇔	뇕	뇖	뇗	뇘	뇙	뇚	뇛	뇜	뇝	뇞	뇟	뇠	뇡	뇢	뇣	뇤	뇥	뇦	뇧	뇨	뇩	뇪	뇫	뇬	뇭	뇮	뇯	뇰	뇱	뇲	뇳	뇴	뇵	뇶	뇷	뇸	뇹	뇺	뇻	뇼	뇽	뇾	뇿	눀	눁	눂	눃	누	눅	눆	눇	눈	눉	눊	눋	눌	눍	눎	눏	눐	눑	눒	눓	눔	눕	눖	눗	눘	눙	눚	눛	눜	눝	눞	눟	눠	눡	눢	눣	눤	눥	눦	눧	눨	눩	눪	눫	눬	눭	눮	눯	눰	눱	눲	눳	눴	눵	눶	눷	눸	눹	눺	눻	눼	눽	눾	눿	뉀	뉁	뉂	뉃	뉄	뉅	뉆	뉇	뉈	뉉	뉊	뉋	뉌	뉍	뉎	뉏	뉐	뉑	뉒	뉓	뉔	뉕	뉖	뉗	뉘	뉙	뉚	뉛	뉜	뉝	뉞	뉟	뉠	뉡	뉢	뉣	뉤	뉥	뉦	뉧	뉨	뉩	뉪	뉫	뉬	뉭	뉮	뉯	뉰	뉱	뉲	뉳	뉴	뉵	뉶	뉷	뉸	뉹	뉺	뉻	뉼	뉽	뉾	뉿	늀	늁	늂	늃	늄	늅	늆	늇	늈	늉	늊	늋	늌	늍	늎	늏	느	늑	늒	늓	는	늕	늖	늗	늘	늙	늚	늛	늜	늝	늞	늟	늠	늡	늢	늣	늤	능	늦	늧	늨	늩	늪	늫	늬	늭	늮	늯	늰	늱	늲	늳	늴	늵	늶	늷	늸	늹	늺	늻	늼	늽	늾	늿	닀	닁	닂	닃	닄	닅	닆	닇	니	닉	닊	닋	닌	닍	닎	닏	닐	닑	닒	닓	닔	닕	닖	닗	님	닙	닚	닛	닜	닝	닞	닟	닠	닡	닢	닣	ﾤ
ᄃ	ㄷ	㈂	㈐	㉢	㉰	다	닥	닦	닧	단	닩	닪	닫	달	닭	닮	닯	닰	닱	닲	닳	담	답	닶	닷	닸	당	닺	닻	닼	닽	닾	닿	대	댁	댂	댃	댄	댅	댆	댇	댈	댉	댊	댋	댌	댍	댎	댏	댐	댑	댒	댓	댔	댕	댖	댗	댘	댙	댚	댛	댜	댝	댞	댟	댠	댡	댢	댣	댤	댥	댦	댧	댨	댩	댪	댫	댬	댭	댮	댯	댰	댱	댲	댳	댴	댵	댶	댷	댸	댹	댺	댻	댼	댽	댾	댿	덀	덁	덂	덃	덄	덅	덆	덇	덈	덉	덊	덋	덌	덍	덎	덏	덐	덑	덒	덓	더	덕	덖	덗	던	덙	덚	덛	덜	덝	덞	덟	덠	덡	덢	덣	덤	덥	덦	덧	덨	덩	덪	덫	덬	덭	덮	덯	데	덱	덲	덳	덴	덵	덶	덷	델	덹	덺	덻	덼	덽	덾	덿	뎀	뎁	뎂	뎃	뎄	뎅	뎆	뎇	뎈	뎉	뎊	뎋	뎌	뎍	뎎	뎏	뎐	뎑	뎒	뎓	뎔	뎕	뎖	뎗	뎘	뎙	뎚	뎛	뎜	뎝	뎞	뎟	뎠	뎡	뎢	뎣	뎤	뎥	뎦	뎧	뎨	뎩	뎪	뎫	뎬	뎭	뎮	뎯	뎰	뎱	뎲	뎳	뎴	뎵	뎶	뎷	뎸	뎹	뎺	뎻	뎼	뎽	뎾	뎿	돀	돁	돂	돃	도	독	돆	돇	돈	돉	돊	돋	돌	돍	돎	돏	돐	돑	돒	돓	돔	돕	돖	돗	돘	동	돚	돛	돜	돝	돞	돟	돠	돡	돢	돣	돤	돥	돦	돧	돨	돩	돪	돫	돬	돭	돮	돯	돰	돱	돲	돳	돴	돵	돶	돷	돸	돹	돺	돻	돼	돽	돾	돿	됀	됁	됂	됃	됄	됅	됆	됇	됈	됉	됊	됋	됌	됍	됎	됏	됐	됑	됒	됓	됔	됕	됖	됗	되	됙	됚	됛	된	됝	됞	됟	될	됡	됢	됣	됤	됥	됦	됧	됨	됩	됪	됫	됬	됭	됮	됯	됰	됱	됲	됳	됴	됵	됶	됷	됸	됹	됺	됻	됼	됽	됾	됿	둀	둁	둂	둃	둄	둅	둆	둇	둈	둉	둊	둋	둌	둍	둎	둏	두	둑	둒	둓	둔	둕	둖	둗	둘	둙	둚	둛	둜	둝	둞	둟	둠	둡	둢	둣	둤	둥	둦	둧	둨	둩	둪	둫	둬	둭	둮	둯	둰	둱	둲	둳	둴	둵	둶	둷	둸	둹	둺	둻	둼	둽	둾	둿	뒀	뒁	뒂	뒃	뒄	뒅	뒆	뒇	뒈	뒉	뒊	뒋	뒌	뒍	뒎	뒏	뒐	뒑	뒒	뒓	뒔	뒕	뒖	뒗	뒘	뒙	뒚	뒛	뒜	뒝	뒞	뒟	뒠	뒡	뒢	뒣	뒤	뒥	뒦	뒧	뒨	뒩	뒪	뒫	뒬	뒭	뒮	뒯	뒰	뒱	뒲	뒳	뒴	뒵	뒶	뒷	뒸	뒹	뒺	뒻	뒼	뒽	뒾	뒿	듀	듁	듂	듃	듄	듅	듆	듇	듈	듉	듊	듋	듌	듍	듎	듏	듐	듑	듒	듓	듔	듕	듖	듗	듘	듙	듚	듛	드	득	듞	듟	든	듡	듢	듣	들	듥	듦	듧	듨	듩	듪	듫	듬	듭	듮	듯	듰	등	듲	듳	듴	듵	듶	듷	듸	듹	듺	듻	듼	듽	듾	듿	딀	딁	딂	딃	딄	딅	딆	딇	딈	딉	딊	딋	딌	딍	딎	딏	딐	딑	딒	딓	디	딕	딖	딗	딘	딙	딚	딛	딜	딝	딞	딟	딠	딡	딢	딣	딤	딥	딦	딧	딨	딩	딪	딫	딬	딭	딮	딯	ﾧ
ᄄ	ㄸ	따	딱	딲	딳	딴	딵	딶	딷	딸	딹	딺	딻	딼	딽	딾	딿	땀	땁	땂	땃	땄	땅	땆	땇	땈	땉	땊	땋	때	땍	땎	땏	땐	땑	땒	땓	땔	땕	땖	땗	땘	땙	땚	땛	땜	땝	땞	땟	땠	땡	땢	땣	땤	땥	땦	땧	땨	땩	땪	땫	땬	땭	땮	땯	땰	땱	땲	땳	땴	땵	땶	땷	땸	땹	땺	땻	땼	땽	땾	땿	떀	떁	떂	떃	떄	떅	떆	떇	떈	떉	떊	떋	떌	떍	떎	떏	떐	떑	떒	떓	떔	떕	떖	떗	떘	떙	떚	떛	떜	떝	떞	떟	떠	떡	떢	떣	떤	떥	떦	떧	떨	떩	떪	떫	떬	떭	떮	떯	떰	떱	떲	떳	떴	떵	떶	떷	떸	떹	떺	떻	떼	떽	떾	떿	뗀	뗁	뗂	뗃	뗄	뗅	뗆	뗇	뗈	뗉	뗊	뗋	뗌	뗍	뗎	뗏	뗐	뗑	뗒	뗓	뗔	뗕	뗖	뗗	뗘	뗙	뗚	뗛	뗜	뗝	뗞	뗟	뗠	뗡	뗢	뗣	뗤	뗥	뗦	뗧	뗨	뗩	뗪	뗫	뗬	뗭	뗮	뗯	뗰	뗱	뗲	뗳	뗴	뗵	뗶	뗷	뗸	뗹	뗺	뗻	뗼	뗽	뗾	뗿	똀	똁	똂	똃	똄	똅	똆	똇	똈	똉	똊	똋	똌	똍	똎	똏	또	똑	똒	똓	똔	똕	똖	똗	똘	똙	똚	똛	똜	똝	똞	똟	똠	똡	똢	똣	똤	똥	똦	똧	똨	똩	똪	똫	똬	똭	똮	똯	똰	똱	똲	똳	똴	똵	똶	똷	똸	똹	똺	똻	똼	똽	똾	똿	뙀	뙁	뙂	뙃	뙄	뙅	뙆	뙇	뙈	뙉	뙊	뙋	뙌	뙍	뙎	뙏	뙐	뙑	뙒	뙓	뙔	뙕	뙖	뙗	뙘	뙙	뙚	뙛	뙜	뙝	뙞	뙟	뙠	뙡	뙢	뙣	뙤	뙥	뙦	뙧	뙨	뙩	뙪	뙫	뙬	뙭	뙮	뙯	뙰	뙱	뙲	뙳	뙴	뙵	뙶	뙷	뙸	뙹	뙺	뙻	뙼	뙽	뙾	뙿	뚀	뚁	뚂	뚃	뚄	뚅	뚆	뚇	뚈	뚉	뚊	뚋	뚌	뚍	뚎	뚏	뚐	뚑	뚒	뚓	뚔	뚕	뚖	뚗	뚘	뚙	뚚	뚛	뚜	뚝	뚞	뚟	뚠	뚡	뚢	뚣	뚤	뚥	뚦	뚧	뚨	뚩	뚪	뚫	뚬	뚭	뚮	뚯	뚰	뚱	뚲	뚳	뚴	뚵	뚶	뚷	뚸	뚹	뚺	뚻	뚼	뚽	뚾	뚿	뛀	뛁	뛂	뛃	뛄	뛅	뛆	뛇	뛈	뛉	뛊	뛋	뛌	뛍	뛎	뛏	뛐	뛑	뛒	뛓	뛔	뛕	뛖	뛗	뛘	뛙	뛚	뛛	뛜	뛝	뛞	뛟	뛠	뛡	뛢	뛣	뛤	뛥	뛦	뛧	뛨	뛩	뛪	뛫	뛬	뛭	뛮	뛯	뛰	뛱	뛲	뛳	뛴	뛵	뛶	뛷	뛸	뛹	뛺	뛻	뛼	뛽	뛾	뛿	뜀	뜁	뜂	뜃	뜄	뜅	뜆	뜇	뜈	뜉	뜊	뜋	뜌	뜍	뜎	뜏	뜐	뜑	뜒	뜓	뜔	뜕	뜖	뜗	뜘	뜙	뜚	뜛	뜜	뜝	뜞	뜟	뜠	뜡	뜢	뜣	뜤	뜥	뜦	뜧	뜨	뜩	뜪	뜫	뜬	뜭	뜮	뜯	뜰	뜱	뜲	뜳	뜴	뜵	뜶	뜷	뜸	뜹	뜺	뜻	뜼	뜽	뜾	뜿	띀	띁	띂	띃	띄	띅	띆	띇	띈	띉	띊	띋	띌	띍	띎	띏	띐	띑	띒	띓	띔	띕	띖	띗	띘	띙	띚	띛	띜	띝	띞	띟	띠	띡	띢	띣	띤	띥	띦	띧	띨	띩	띪	띫	띬	띭	띮	띯	띰	띱	띲	띳	띴	띵	띶	띷	띸	띹	띺	띻	ﾨ
ᄅ	ㄹ	㈃	㈑	㉣	㉱	라	락	띾	띿	란	랁	랂	랃	랄	랅	랆	랇	랈	랉	랊	랋	람	랍	랎	랏	랐	랑	랒	랓	랔	랕	랖	랗	래	랙	랚	랛	랜	랝	랞	랟	랠	랡	랢	랣	랤	랥	랦	랧	램	랩	랪	랫	랬	랭	랮	랯	랰	랱	랲	랳	랴	략	랶	랷	랸	랹	랺	랻	랼	랽	랾	랿	럀	럁	럂	럃	럄	럅	럆	럇	럈	량	럊	럋	럌	럍	럎	럏	럐	럑	럒	럓	럔	럕	럖	럗	럘	럙	럚	럛	럜	럝	럞	럟	럠	럡	럢	럣	럤	럥	럦	럧	럨	럩	럪	럫	러	럭	럮	럯	런	럱	럲	럳	럴	럵	럶	럷	럸	럹	럺	럻	럼	럽	럾	럿	렀	렁	렂	렃	렄	렅	렆	렇	레	렉	렊	렋	렌	렍	렎	렏	렐	렑	렒	렓	렔	렕	렖	렗	렘	렙	렚	렛	렜	렝	렞	렟	렠	렡	렢	렣	려	력	렦	렧	련	렩	렪	렫	렬	렭	렮	렯	렰	렱	렲	렳	렴	렵	렶	렷	렸	령	렺	렻	렼	렽	렾	렿	례	롁	롂	롃	롄	롅	롆	롇	롈	롉	롊	롋	롌	롍	롎	롏	롐	롑	롒	롓	롔	롕	롖	롗	롘	롙	롚	롛	로	록	롞	롟	론	롡	롢	롣	롤	롥	롦	롧	롨	롩	롪	롫	롬	롭	롮	롯	롰	롱	롲	롳	롴	롵	롶	롷	롸	롹	롺	롻	롼	롽	롾	롿	뢀	뢁	뢂	뢃	뢄	뢅	뢆	뢇	뢈	뢉	뢊	뢋	뢌	뢍	뢎	뢏	뢐	뢑	뢒	뢓	뢔	뢕	뢖	뢗	뢘	뢙	뢚	뢛	뢜	뢝	뢞	뢟	뢠	뢡	뢢	뢣	뢤	뢥	뢦	뢧	뢨	뢩	뢪	뢫	뢬	뢭	뢮	뢯	뢰	뢱	뢲	뢳	뢴	뢵	뢶	뢷	뢸	뢹	뢺	뢻	뢼	뢽	뢾	뢿	룀	룁	룂	룃	룄	룅	룆	룇	룈	룉	룊	룋	료	룍	룎	룏	룐	룑	룒	룓	룔	룕	룖	룗	룘	룙	룚	룛	룜	룝	룞	룟	룠	룡	룢	룣	룤	룥	룦	룧	루	룩	룪	룫	룬	룭	룮	룯	룰	룱	룲	룳	룴	룵	룶	룷	룸	룹	룺	룻	룼	룽	룾	룿	뤀	뤁	뤂	뤃	뤄	뤅	뤆	뤇	뤈	뤉	뤊	뤋	뤌	뤍	뤎	뤏	뤐	뤑	뤒	뤓	뤔	뤕	뤖	뤗	뤘	뤙	뤚	뤛	뤜	뤝	뤞	뤟	뤠	뤡	뤢	뤣	뤤	뤥	뤦	뤧	뤨	뤩	뤪	뤫	뤬	뤭	뤮	뤯	뤰	뤱	뤲	뤳	뤴	뤵	뤶	뤷	뤸	뤹	뤺	뤻	뤼	뤽	뤾	뤿	륀	륁	륂	륃	륄	륅	륆	륇	륈	륉	륊	륋	륌	륍	륎	륏	륐	륑	륒	륓	륔	륕	륖	륗	류	륙	륚	륛	륜	륝	륞	륟	률	륡	륢	륣	륤	륥	륦	륧	륨	륩	륪	륫	륬	륭	륮	륯	륰	륱	륲	륳	르	륵	륶	륷	른	륹	륺	륻	를	륽	륾	륿	릀	릁	릂	릃	름	릅	릆	릇	릈	릉	릊	릋	릌	릍	릎	릏	릐	릑	릒	릓	릔	릕	릖	릗	릘	릙	릚	릛	릜	릝	릞	릟	릠	릡	릢	릣	릤	릥	릦	릧	릨	릩	릪	릫	리	릭	릮	릯	린	릱	릲	릳	릴	릵	릶	릷	릸	릹	릺	릻	림	립	릾	릿	맀	링	맂	맃	맄	맅	맆	맇	ﾩ
ᄆ	ㅁ	㈄	㈒	㉤	㉲	마	막	맊	맋	만	맍	많	맏	말	맑	맒	맓	맔	맕	맖	맗	맘	맙	맚	맛	맜	망	맞	맟	맠	맡	맢	맣	매	맥	맦	맧	맨	맩	맪	맫	맬	맭	맮	맯	맰	맱	맲	맳	맴	맵	맶	맷	맸	맹	맺	맻	맼	맽	맾	맿	먀	먁	먂	먃	먄	먅	먆	먇	먈	먉	먊	먋	먌	먍	먎	먏	먐	먑	먒	먓	먔	먕	먖	먗	먘	먙	먚	먛	먜	먝	먞	먟	먠	먡	먢	먣	먤	먥	먦	먧	먨	먩	먪	먫	먬	먭	먮	먯	먰	먱	먲	먳	먴	먵	먶	먷	머	먹	먺	먻	먼	먽	먾	먿	멀	멁	멂	멃	멄	멅	멆	멇	멈	멉	멊	멋	멌	멍	멎	멏	멐	멑	멒	멓	메	멕	멖	멗	멘	멙	멚	멛	멜	멝	멞	멟	멠	멡	멢	멣	멤	멥	멦	멧	멨	멩	멪	멫	멬	멭	멮	멯	며	멱	멲	멳	면	멵	멶	멷	멸	멹	멺	멻	멼	멽	멾	멿	몀	몁	몂	몃	몄	명	몆	몇	몈	몉	몊	몋	몌	몍	몎	몏	몐	몑	몒	몓	몔	몕	몖	몗	몘	몙	몚	몛	몜	몝	몞	몟	몠	몡	몢	몣	몤	몥	몦	몧	모	목	몪	몫	몬	몭	몮	몯	몰	몱	몲	몳	몴	몵	몶	몷	몸	몹	몺	못	몼	몽	몾	몿	뫀	뫁	뫂	뫃	뫄	뫅	뫆	뫇	뫈	뫉	뫊	뫋	뫌	뫍	뫎	뫏	뫐	뫑	뫒	뫓	뫔	뫕	뫖	뫗	뫘	뫙	뫚	뫛	뫜	뫝	뫞	뫟	뫠	뫡	뫢	뫣	뫤	뫥	뫦	뫧	뫨	뫩	뫪	뫫	뫬	뫭	뫮	뫯	뫰	뫱	뫲	뫳	뫴	뫵	뫶	뫷	뫸	뫹	뫺	뫻	뫼	뫽	뫾	뫿	묀	묁	묂	묃	묄	묅	묆	묇	묈	묉	묊	묋	묌	묍	묎	묏	묐	묑	묒	묓	묔	묕	묖	묗	묘	묙	묚	묛	묜	묝	묞	묟	묠	묡	묢	묣	묤	묥	묦	묧	묨	묩	묪	묫	묬	묭	묮	묯	묰	묱	묲	묳	무	묵	묶	묷	문	묹	묺	묻	물	묽	묾	묿	뭀	뭁	뭂	뭃	뭄	뭅	뭆	뭇	뭈	뭉	뭊	뭋	뭌	뭍	뭎	뭏	뭐	뭑	뭒	뭓	뭔	뭕	뭖	뭗	뭘	뭙	뭚	뭛	뭜	뭝	뭞	뭟	뭠	뭡	뭢	뭣	뭤	뭥	뭦	뭧	뭨	뭩	뭪	뭫	뭬	뭭	뭮	뭯	뭰	뭱	뭲	뭳	뭴	뭵	뭶	뭷	뭸	뭹	뭺	뭻	뭼	뭽	뭾	뭿	뮀	뮁	뮂	뮃	뮄	뮅	뮆	뮇	뮈	뮉	뮊	뮋	뮌	뮍	뮎	뮏	뮐	뮑	뮒	뮓	뮔	뮕	뮖	뮗	뮘	뮙	뮚	뮛	뮜	뮝	뮞	뮟	뮠	뮡	뮢	뮣	뮤	뮥	뮦	뮧	뮨	뮩	뮪	뮫	뮬	뮭	뮮	뮯	뮰	뮱	뮲	뮳	뮴	뮵	뮶	뮷	뮸	뮹	뮺	뮻	뮼	뮽	뮾	뮿	므	믁	믂	믃	믄	믅	믆	믇	믈	믉	믊	믋	믌	믍	믎	믏	믐	믑	믒	믓	믔	믕	믖	믗	믘	믙	믚	믛	믜	믝	믞	믟	믠	믡	믢	믣	믤	믥	믦	믧	믨	믩	믪	믫	믬	믭	믮	믯	믰	믱	믲	믳	믴	믵	믶	믷	미	믹	믺	믻	민	믽	믾	믿	밀	밁	밂	밃	밄	밅	밆	밇	밈	밉	밊	밋	밌	밍	밎	및	밐	밑	밒	밓	ﾱ
ᄇ	ㅂ	㈅	㈓	㉥	㉳	바	박	밖	밗	반	밙	밚	받	발	밝	밞	밟	밠	밡	밢	밣	밤	밥	밦	밧	밨	방	밪	밫	밬	밭	밮	밯	배	백	밲	밳	밴	밵	밶	밷	밸	밹	밺	밻	밼	밽	밾	밿	뱀	뱁	뱂	뱃	뱄	뱅	뱆	뱇	뱈	뱉	뱊	뱋	뱌	뱍	뱎	뱏	뱐	뱑	뱒	뱓	뱔	뱕	뱖	뱗	뱘	뱙	뱚	뱛	뱜	뱝	뱞	뱟	뱠	뱡	뱢	뱣	뱤	뱥	뱦	뱧	뱨	뱩	뱪	뱫	뱬	뱭	뱮	뱯	뱰	뱱	뱲	뱳	뱴	뱵	뱶	뱷	뱸	뱹	뱺	뱻	뱼	뱽	뱾	뱿	벀	벁	벂	벃	버	벅	벆	벇	번	벉	벊	벋	벌	벍	벎	벏	벐	벑	벒	벓	범	법	벖	벗	벘	벙	벚	벛	벜	벝	벞	벟	베	벡	벢	벣	벤	벥	벦	벧	벨	벩	벪	벫	벬	벭	벮	벯	벰	벱	벲	벳	벴	벵	벶	벷	벸	벹	벺	벻	벼	벽	벾	벿	변	볁	볂	볃	별	볅	볆	볇	볈	볉	볊	볋	볌	볍	볎	볏	볐	병	볒	볓	볔	볕	볖	볗	볘	볙	볚	볛	볜	볝	볞	볟	볠	볡	볢	볣	볤	볥	볦	볧	볨	볩	볪	볫	볬	볭	볮	볯	볰	볱	볲	볳	보	복	볶	볷	본	볹	볺	볻	볼	볽	볾	볿	봀	봁	봂	봃	봄	봅	봆	봇	봈	봉	봊	봋	봌	봍	봎	봏	봐	봑	봒	봓	봔	봕	봖	봗	봘	봙	봚	봛	봜	봝	봞	봟	봠	봡	봢	봣	봤	봥	봦	봧	봨	봩	봪	봫	봬	봭	봮	봯	봰	봱	봲	봳	봴	봵	봶	봷	봸	봹	봺	봻	봼	봽	봾	봿	뵀	뵁	뵂	뵃	뵄	뵅	뵆	뵇	뵈	뵉	뵊	뵋	뵌	뵍	뵎	뵏	뵐	뵑	뵒	뵓	뵔	뵕	뵖	뵗	뵘	뵙	뵚	뵛	뵜	뵝	뵞	뵟	뵠	뵡	뵢	뵣	뵤	뵥	뵦	뵧	뵨	뵩	뵪	뵫	뵬	뵭	뵮	뵯	뵰	뵱	뵲	뵳	뵴	뵵	뵶	뵷	뵸	뵹	뵺	뵻	뵼	뵽	뵾	뵿	부	북	붂	붃	분	붅	붆	붇	불	붉	붊	붋	붌	붍	붎	붏	붐	붑	붒	붓	붔	붕	붖	붗	붘	붙	붚	붛	붜	붝	붞	붟	붠	붡	붢	붣	붤	붥	붦	붧	붨	붩	붪	붫	붬	붭	붮	붯	붰	붱	붲	붳	붴	붵	붶	붷	붸	붹	붺	붻	붼	붽	붾	붿	뷀	뷁	뷂	뷃	뷄	뷅	뷆	뷇	뷈	뷉	뷊	뷋	뷌	뷍	뷎	뷏	뷐	뷑	뷒	뷓	뷔	뷕	뷖	뷗	뷘	뷙	뷚	뷛	뷜	뷝	뷞	뷟	뷠	뷡	뷢	뷣	뷤	뷥	뷦	뷧	뷨	뷩	뷪	뷫	뷬	뷭	뷮	뷯	뷰	뷱	뷲	뷳	뷴	뷵	뷶	뷷	뷸	뷹	뷺	뷻	뷼	뷽	뷾	뷿	븀	븁	븂	븃	븄	븅	븆	븇	븈	븉	븊	븋	브	븍	븎	븏	븐	븑	븒	븓	블	븕	븖	븗	븘	븙	븚	븛	븜	븝	븞	븟	븠	븡	븢	븣	븤	븥	븦	븧	븨	븩	븪	븫	븬	븭	븮	븯	븰	븱	븲	븳	븴	븵	븶	븷	븸	븹	븺	븻	븼	븽	븾	븿	빀	빁	빂	빃	비	빅	빆	빇	빈	빉	빊	빋	빌	빍	빎	빏	빐	빑	빒	빓	빔	빕	빖	빗	빘	빙	빚	빛	빜	빝	빞	빟	ﾲ
ᄈ	ㅃ	빠	빡	빢	빣	빤	빥	빦	빧	빨	빩	빪	빫	빬	빭	빮	빯	빰	빱	빲	빳	빴	빵	빶	빷	빸	빹	빺	빻	빼	빽	빾	빿	뺀	뺁	뺂	뺃	뺄	뺅	뺆	뺇	뺈	뺉	뺊	뺋	뺌	뺍	뺎	뺏	뺐	뺑	뺒	뺓	뺔	뺕	뺖	뺗	뺘	뺙	뺚	뺛	뺜	뺝	뺞	뺟	뺠	뺡	뺢	뺣	뺤	뺥	뺦	뺧	뺨	뺩	뺪	뺫	뺬	뺭	뺮	뺯	뺰	뺱	뺲	뺳	뺴	뺵	뺶	뺷	뺸	뺹	뺺	뺻	뺼	뺽	뺾	뺿	뻀	뻁	뻂	뻃	뻄	뻅	뻆	뻇	뻈	뻉	뻊	뻋	뻌	뻍	뻎	뻏	뻐	뻑	뻒	뻓	뻔	뻕	뻖	뻗	뻘	뻙	뻚	뻛	뻜	뻝	뻞	뻟	뻠	뻡	뻢	뻣	뻤	뻥	뻦	뻧	뻨	뻩	뻪	뻫	뻬	뻭	뻮	뻯	뻰	뻱	뻲	뻳	뻴	뻵	뻶	뻷	뻸	뻹	뻺	뻻	뻼	뻽	뻾	뻿	뼀	뼁	뼂	뼃	뼄	뼅	뼆	뼇	뼈	뼉	뼊	뼋	뼌	뼍	뼎	뼏	뼐	뼑	뼒	뼓	뼔	뼕	뼖	뼗	뼘	뼙	뼚	뼛	뼜	뼝	뼞	뼟	뼠	뼡	뼢	뼣	뼤	뼥	뼦	뼧	뼨	뼩	뼪	뼫	뼬	뼭	뼮	뼯	뼰	뼱	뼲	뼳	뼴	뼵	뼶	뼷	뼸	뼹	뼺	뼻	뼼	뼽	뼾	뼿	뽀	뽁	뽂	뽃	뽄	뽅	뽆	뽇	뽈	뽉	뽊	뽋	뽌	뽍	뽎	뽏	뽐	뽑	뽒	뽓	뽔	뽕	뽖	뽗	뽘	뽙	뽚	뽛	뽜	뽝	뽞	뽟	뽠	뽡	뽢	뽣	뽤	뽥	뽦	뽧	뽨	뽩	뽪	뽫	뽬	뽭	뽮	뽯	뽰	뽱	뽲	뽳	뽴	뽵	뽶	뽷	뽸	뽹	뽺	뽻	뽼	뽽	뽾	뽿	뾀	뾁	뾂	뾃	뾄	뾅	뾆	뾇	뾈	뾉	뾊	뾋	뾌	뾍	뾎	뾏	뾐	뾑	뾒	뾓	뾔	뾕	뾖	뾗	뾘	뾙	뾚	뾛	뾜	뾝	뾞	뾟	뾠	뾡	뾢	뾣	뾤	뾥	뾦	뾧	뾨	뾩	뾪	뾫	뾬	뾭	뾮	뾯	뾰	뾱	뾲	뾳	뾴	뾵	뾶	뾷	뾸	뾹	뾺	뾻	뾼	뾽	뾾	뾿	뿀	뿁	뿂	뿃	뿄	뿅	뿆	뿇	뿈	뿉	뿊	뿋	뿌	뿍	뿎	뿏	뿐	뿑	뿒	뿓	뿔	뿕	뿖	뿗	뿘	뿙	뿚	뿛	뿜	뿝	뿞	뿟	뿠	뿡	뿢	뿣	뿤	뿥	뿦	뿧	뿨	뿩	뿪	뿫	뿬	뿭	뿮	뿯	뿰	뿱	뿲	뿳	뿴	뿵	뿶	뿷	뿸	뿹	뿺	뿻	뿼	뿽	뿾	뿿	쀀	쀁	쀂	쀃	쀄	쀅	쀆	쀇	쀈	쀉	쀊	쀋	쀌	쀍	쀎	쀏	쀐	쀑	쀒	쀓	쀔	쀕	쀖	쀗	쀘	쀙	쀚	쀛	쀜	쀝	쀞	쀟	쀠	쀡	쀢	쀣	쀤	쀥	쀦	쀧	쀨	쀩	쀪	쀫	쀬	쀭	쀮	쀯	쀰	쀱	쀲	쀳	쀴	쀵	쀶	쀷	쀸	쀹	쀺	쀻	쀼	쀽	쀾	쀿	쁀	쁁	쁂	쁃	쁄	쁅	쁆	쁇	쁈	쁉	쁊	쁋	쁌	쁍	쁎	쁏	쁐	쁑	쁒	쁓	쁔	쁕	쁖	쁗	쁘	쁙	쁚	쁛	쁜	쁝	쁞	쁟	쁠	쁡	쁢	쁣	쁤	쁥	쁦	쁧	쁨	쁩	쁪	쁫	쁬	쁭	쁮	쁯	쁰	쁱	쁲	쁳	쁴	쁵	쁶	쁷	쁸	쁹	쁺	쁻	쁼	쁽	쁾	쁿	삀	삁	삂	삃	삄	삅	삆	삇	삈	삉	삊	삋	삌	삍	삎	삏	삐	삑	삒	삓	삔	삕	삖	삗	삘	삙	삚	삛	삜	삝	삞	삟	삠	삡	삢	삣	삤	삥	삦	삧	삨	삩	삪	삫	ﾳ
ᄉ	ㅅ	㈆	㈔	㉦	㉴	사	삭	삮	삯	산	삱	삲	삳	살	삵	삶	삷	삸	삹	삺	삻	삼	삽	삾	삿	샀	상	샂	샃	샄	샅	샆	샇	새	색	샊	샋	샌	샍	샎	샏	샐	샑	샒	샓	샔	샕	샖	샗	샘	샙	샚	샛	샜	생	샞	샟	샠	샡	샢	샣	샤	샥	샦	샧	샨	샩	샪	샫	샬	샭	샮	샯	샰	샱	샲	샳	샴	샵	샶	샷	샸	샹	샺	샻	샼	샽	샾	샿	섀	섁	섂	섃	섄	섅	섆	섇	섈	섉	섊	섋	섌	섍	섎	섏	섐	섑	섒	섓	섔	섕	섖	섗	섘	섙	섚	섛	서	석	섞	섟	선	섡	섢	섣	설	섥	섦	섧	섨	섩	섪	섫	섬	섭	섮	섯	섰	성	섲	섳	섴	섵	섶	섷	세	섹	섺	섻	센	섽	섾	섿	셀	셁	셂	셃	셄	셅	셆	셇	셈	셉	셊	셋	셌	셍	셎	셏	셐	셑	셒	셓	셔	셕	셖	셗	션	셙	셚	셛	셜	셝	셞	셟	셠	셡	셢	셣	셤	셥	셦	셧	셨	셩	셪	셫	셬	셭	셮	셯	셰	셱	셲	셳	셴	셵	셶	셷	셸	셹	셺	셻	셼	셽	셾	셿	솀	솁	솂	솃	솄	솅	솆	솇	솈	솉	솊	솋	소	속	솎	솏	손	솑	솒	솓	솔	솕	솖	솗	솘	솙	솚	솛	솜	솝	솞	솟	솠	송	솢	솣	솤	솥	솦	솧	솨	솩	솪	솫	솬	솭	솮	솯	솰	솱	솲	솳	솴	솵	솶	솷	솸	솹	솺	솻	솼	솽	솾	솿	쇀	쇁	쇂	쇃	쇄	쇅	쇆	쇇	쇈	쇉	쇊	쇋	쇌	쇍	쇎	쇏	쇐	쇑	쇒	쇓	쇔	쇕	쇖	쇗	쇘	쇙	쇚	쇛	쇜	쇝	쇞	쇟	쇠	쇡	쇢	쇣	쇤	쇥	쇦	쇧	쇨	쇩	쇪	쇫	쇬	쇭	쇮	쇯	쇰	쇱	쇲	쇳	쇴	쇵	쇶	쇷	쇸	쇹	쇺	쇻	쇼	쇽	쇾	쇿	숀	숁	숂	숃	숄	숅	숆	숇	숈	숉	숊	숋	숌	숍	숎	숏	숐	숑	숒	숓	숔	숕	숖	숗	수	숙	숚	숛	순	숝	숞	숟	술	숡	숢	숣	숤	숥	숦	숧	숨	숩	숪	숫	숬	숭	숮	숯	숰	숱	숲	숳	숴	숵	숶	숷	숸	숹	숺	숻	숼	숽	숾	숿	쉀	쉁	쉂	쉃	쉄	쉅	쉆	쉇	쉈	쉉	쉊	쉋	쉌	쉍	쉎	쉏	쉐	쉑	쉒	쉓	쉔	쉕	쉖	쉗	쉘	쉙	쉚	쉛	쉜	쉝	쉞	쉟	쉠	쉡	쉢	쉣	쉤	쉥	쉦	쉧	쉨	쉩	쉪	쉫	쉬	쉭	쉮	쉯	쉰	쉱	쉲	쉳	쉴	쉵	쉶	쉷	쉸	쉹	쉺	쉻	쉼	쉽	쉾	쉿	슀	슁	슂	슃	슄	슅	슆	슇	슈	슉	슊	슋	슌	슍	슎	슏	슐	슑	슒	슓	슔	슕	슖	슗	슘	슙	슚	슛	슜	슝	슞	슟	슠	슡	슢	슣	스	슥	슦	슧	슨	슩	슪	슫	슬	슭	슮	슯	슰	슱	슲	슳	슴	습	슶	슷	슸	승	슺	슻	슼	슽	슾	슿	싀	싁	싂	싃	싄	싅	싆	싇	싈	싉	싊	싋	싌	싍	싎	싏	싐	싑	싒	싓	싔	싕	싖	싗	싘	싙	싚	싛	시	식	싞	싟	신	싡	싢	싣	실	싥	싦	싧	싨	싩	싪	싫	심	십	싮	싯	싰	싱	싲	싳	싴	싵	싶	싷	ﾵ
ᄊ	ㅆ	싸	싹	싺	싻	싼	싽	싾	싿	쌀	쌁	쌂	쌃	쌄	쌅	쌆	쌇	쌈	쌉	쌊	쌋	쌌	쌍	쌎	쌏	쌐	쌑	쌒	쌓	쌔	쌕	쌖	쌗	쌘	쌙	쌚	쌛	쌜	쌝	쌞	쌟	쌠	쌡	쌢	쌣	쌤	쌥	쌦	쌧	쌨	쌩	쌪	쌫	쌬	쌭	쌮	쌯	쌰	쌱	쌲	쌳	쌴	쌵	쌶	쌷	쌸	쌹	쌺	쌻	쌼	쌽	쌾	쌿	썀	썁	썂	썃	썄	썅	썆	썇	썈	썉	썊	썋	썌	썍	썎	썏	썐	썑	썒	썓	썔	썕	썖	썗	썘	썙	썚	썛	썜	썝	썞	썟	썠	썡	썢	썣	썤	썥	썦	썧	써	썩	썪	썫	썬	썭	썮	썯	썰	썱	썲	썳	썴	썵	썶	썷	썸	썹	썺	썻	썼	썽	썾	썿	쎀	쎁	쎂	쎃	쎄	쎅	쎆	쎇	쎈	쎉	쎊	쎋	쎌	쎍	쎎	쎏	쎐	쎑	쎒	쎓	쎔	쎕	쎖	쎗	쎘	쎙	쎚	쎛	쎜	쎝	쎞	쎟	쎠	쎡	쎢	쎣	쎤	쎥	쎦	쎧	쎨	쎩	쎪	쎫	쎬	쎭	쎮	쎯	쎰	쎱	쎲	쎳	쎴	쎵	쎶	쎷	쎸	쎹	쎺	쎻	쎼	쎽	쎾	쎿	쏀	쏁	쏂	쏃	쏄	쏅	쏆	쏇	쏈	쏉	쏊	쏋	쏌	쏍	쏎	쏏	쏐	쏑	쏒	쏓	쏔	쏕	쏖	쏗	쏘	쏙	쏚	쏛	쏜	쏝	쏞	쏟	쏠	쏡	쏢	쏣	쏤	쏥	쏦	쏧	쏨	쏩	쏪	쏫	쏬	쏭	쏮	쏯	쏰	쏱	쏲	쏳	쏴	쏵	쏶	쏷	쏸	쏹	쏺	쏻	쏼	쏽	쏾	쏿	쐀	쐁	쐂	쐃	쐄	쐅	쐆	쐇	쐈	쐉	쐊	쐋	쐌	쐍	쐎	쐏	쐐	쐑	쐒	쐓	쐔	쐕	쐖	쐗	쐘	쐙	쐚	쐛	쐜	쐝	쐞	쐟	쐠	쐡	쐢	쐣	쐤	쐥	쐦	쐧	쐨	쐩	쐪	쐫	쐬	쐭	쐮	쐯	쐰	쐱	쐲	쐳	쐴	쐵	쐶	쐷	쐸	쐹	쐺	쐻	쐼	쐽	쐾	쐿	쑀	쑁	쑂	쑃	쑄	쑅	쑆	쑇	쑈	쑉	쑊	쑋	쑌	쑍	쑎	쑏	쑐	쑑	쑒	쑓	쑔	쑕	쑖	쑗	쑘	쑙	쑚	쑛	쑜	쑝	쑞	쑟	쑠	쑡	쑢	쑣	쑤	쑥	쑦	쑧	쑨	쑩	쑪	쑫	쑬	쑭	쑮	쑯	쑰	쑱	쑲	쑳	쑴	쑵	쑶	쑷	쑸	쑹	쑺	쑻	쑼	쑽	쑾	쑿	쒀	쒁	쒂	쒃	쒄	쒅	쒆	쒇	쒈	쒉	쒊	쒋	쒌	쒍	쒎	쒏	쒐	쒑	쒒	쒓	쒔	쒕	쒖	쒗	쒘	쒙	쒚	쒛	쒜	쒝	쒞	쒟	쒠	쒡	쒢	쒣	쒤	쒥	쒦	쒧	쒨	쒩	쒪	쒫	쒬	쒭	쒮	쒯	쒰	쒱	쒲	쒳	쒴	쒵	쒶	쒷	쒸	쒹	쒺	쒻	쒼	쒽	쒾	쒿	쓀	쓁	쓂	쓃	쓄	쓅	쓆	쓇	쓈	쓉	쓊	쓋	쓌	쓍	쓎	쓏	쓐	쓑	쓒	쓓	쓔	쓕	쓖	쓗	쓘	쓙	쓚	쓛	쓜	쓝	쓞	쓟	쓠	쓡	쓢	쓣	쓤	쓥	쓦	쓧	쓨	쓩	쓪	쓫	쓬	쓭	쓮	쓯	쓰	쓱	쓲	쓳	쓴	쓵	쓶	쓷	쓸	쓹	쓺	쓻	쓼	쓽	쓾	쓿	씀	씁	씂	씃	씄	씅	씆	씇	씈	씉	씊	씋	씌	씍	씎	씏	씐	씑	씒	씓	씔	씕	씖	씗	씘	씙	씚	씛	씜	씝	씞	씟	씠	씡	씢	씣	씤	씥	씦	씧	씨	씩	씪	씫	씬	씭	씮	씯	씰	씱	씲	씳	씴	씵	씶	씷	씸	씹	씺	씻	씼	씽	씾	씿	앀	앁	앂	앃	ﾶ
ᄋ	ㅇ	㈇	㈕	㈝	㈞	㉧	㉵	㉽	㉾	아	악	앆	앇	안	앉	않	앋	알	앍	앎	앏	앐	앑	앒	앓	암	압	앖	앗	았	앙	앚	앛	앜	앝	앞	앟	애	액	앢	앣	앤	앥	앦	앧	앨	앩	앪	앫	앬	앭	앮	앯	앰	앱	앲	앳	앴	앵	앶	앷	앸	앹	앺	앻	야	약	앾	앿	얀	얁	얂	얃	얄	얅	얆	얇	얈	얉	얊	얋	얌	얍	얎	얏	얐	양	얒	얓	얔	얕	얖	얗	얘	얙	얚	얛	얜	얝	얞	얟	얠	얡	얢	얣	얤	얥	얦	얧	얨	얩	얪	얫	얬	얭	얮	얯	얰	얱	얲	얳	어	억	얶	얷	언	얹	얺	얻	얼	얽	얾	얿	엀	엁	엂	엃	엄	업	없	엇	었	엉	엊	엋	엌	엍	엎	엏	에	엑	엒	엓	엔	엕	엖	엗	엘	엙	엚	엛	엜	엝	엞	엟	엠	엡	엢	엣	엤	엥	엦	엧	엨	엩	엪	엫	여	역	엮	엯	연	엱	엲	엳	열	엵	엶	엷	엸	엹	엺	엻	염	엽	엾	엿	였	영	옂	옃	옄	옅	옆	옇	예	옉	옊	옋	옌	옍	옎	옏	옐	옑	옒	옓	옔	옕	옖	옗	옘	옙	옚	옛	옜	옝	옞	옟	옠	옡	옢	옣	오	옥	옦	옧	온	옩	옪	옫	올	옭	옮	옯	옰	옱	옲	옳	옴	옵	옶	옷	옸	옹	옺	옻	옼	옽	옾	옿	와	왁	왂	왃	완	왅	왆	왇	왈	왉	왊	왋	왌	왍	왎	왏	왐	왑	왒	왓	왔	왕	왖	왗	왘	왙	왚	왛	왜	왝	왞	왟	왠	왡	왢	왣	왤	왥	왦	왧	왨	왩	왪	왫	왬	왭	왮	왯	왰	왱	왲	왳	왴	왵	왶	왷	외	왹	왺	왻	왼	왽	왾	왿	욀	욁	욂	욃	욄	욅	욆	욇	욈	욉	욊	욋	욌	욍	욎	욏	욐	욑	욒	욓	요	욕	욖	욗	욘	욙	욚	욛	욜	욝	욞	욟	욠	욡	욢	욣	욤	욥	욦	욧	욨	용	욪	욫	욬	욭	욮	욯	우	욱	욲	욳	운	욵	욶	욷	울	욹	욺	욻	욼	욽	욾	욿	움	웁	웂	웃	웄	웅	웆	웇	웈	웉	웊	웋	워	웍	웎	웏	원	웑	웒	웓	월	웕	웖	웗	웘	웙	웚	웛	웜	웝	웞	웟	웠	웡	웢	웣	웤	웥	웦	웧	웨	웩	웪	웫	웬	웭	웮	웯	웰	웱	웲	웳	웴	웵	웶	웷	웸	웹	웺	웻	웼	웽	웾	웿	윀	윁	윂	윃	위	윅	윆	윇	윈	윉	윊	윋	윌	윍	윎	윏	윐	윑	윒	윓	윔	윕	윖	윗	윘	윙	윚	윛	윜	윝	윞	윟	유	육	윢	윣	윤	윥	윦	윧	율	윩	윪	윫	윬	윭	윮	윯	윰	윱	윲	윳	윴	융	윶	윷	윸	윹	윺	윻	으	윽	윾	윿	은	읁	읂	읃	을	읅	읆	읇	읈	읉	읊	읋	음	읍	읎	읏	읐	응	읒	읓	읔	읕	읖	읗	의	읙	읚	읛	읜	읝	읞	읟	읠	읡	읢	읣	읤	읥	읦	읧	읨	읩	읪	읫	읬	읭	읮	읯	읰	읱	읲	읳	이	익	읶	읷	인	읹	읺	읻	일	읽	읾	읿	잀	잁	잂	잃	임	입	잆	잇	있	잉	잊	잋	잌	잍	잎	잏	ﾷ
ᄌ	ㅈ	㈈	㈖	㈜	㈝	㉨	㉶	㉽	자	작	잒	잓	잔	잕	잖	잗	잘	잙	잚	잛	잜	잝	잞	잟	잠	잡	잢	잣	잤	장	잦	잧	잨	잩	잪	잫	재	잭	잮	잯	잰	잱	잲	잳	잴	잵	잶	잷	잸	잹	잺	잻	잼	잽	잾	잿	쟀	쟁	쟂	쟃	쟄	쟅	쟆	쟇	쟈	쟉	쟊	쟋	쟌	쟍	쟎	쟏	쟐	쟑	쟒	쟓	쟔	쟕	쟖	쟗	쟘	쟙	쟚	쟛	쟜	쟝	쟞	쟟	쟠	쟡	쟢	쟣	쟤	쟥	쟦	쟧	쟨	쟩	쟪	쟫	쟬	쟭	쟮	쟯	쟰	쟱	쟲	쟳	쟴	쟵	쟶	쟷	쟸	쟹	쟺	쟻	쟼	쟽	쟾	쟿	저	적	젂	젃	전	젅	젆	젇	절	젉	젊	젋	젌	젍	젎	젏	점	접	젒	젓	젔	정	젖	젗	젘	젙	젚	젛	제	젝	젞	젟	젠	젡	젢	젣	젤	젥	젦	젧	젨	젩	젪	젫	젬	젭	젮	젯	젰	젱	젲	젳	젴	젵	젶	젷	져	젹	젺	젻	젼	젽	젾	젿	졀	졁	졂	졃	졄	졅	졆	졇	졈	졉	졊	졋	졌	졍	졎	졏	졐	졑	졒	졓	졔	졕	졖	졗	졘	졙	졚	졛	졜	졝	졞	졟	졠	졡	졢	졣	졤	졥	졦	졧	졨	졩	졪	졫	졬	졭	졮	졯	조	족	졲	졳	존	졵	졶	졷	졸	졹	졺	졻	졼	졽	졾	졿	좀	좁	좂	좃	좄	종	좆	좇	좈	좉	좊	좋	좌	좍	좎	좏	좐	좑	좒	좓	좔	좕	좖	좗	좘	좙	좚	좛	좜	좝	좞	좟	좠	좡	좢	좣	좤	좥	좦	좧	좨	좩	좪	좫	좬	좭	좮	좯	좰	좱	좲	좳	좴	좵	좶	좷	좸	좹	좺	좻	좼	좽	좾	좿	죀	죁	죂	죃	죄	죅	죆	죇	죈	죉	죊	죋	죌	죍	죎	죏	죐	죑	죒	죓	죔	죕	죖	죗	죘	죙	죚	죛	죜	죝	죞	죟	죠	죡	죢	죣	죤	죥	죦	죧	죨	죩	죪	죫	죬	죭	죮	죯	죰	죱	죲	죳	죴	죵	죶	죷	죸	죹	죺	죻	주	죽	죾	죿	준	줁	줂	줃	줄	줅	줆	줇	줈	줉	줊	줋	줌	줍	줎	줏	줐	중	줒	줓	줔	줕	줖	줗	줘	줙	줚	줛	줜	줝	줞	줟	줠	줡	줢	줣	줤	줥	줦	줧	줨	줩	줪	줫	줬	줭	줮	줯	줰	줱	줲	줳	줴	줵	줶	줷	줸	줹	줺	줻	줼	줽	줾	줿	쥀	쥁	쥂	쥃	쥄	쥅	쥆	쥇	쥈	쥉	쥊	쥋	쥌	쥍	쥎	쥏	쥐	쥑	쥒	쥓	쥔	쥕	쥖	쥗	쥘	쥙	쥚	쥛	쥜	쥝	쥞	쥟	쥠	쥡	쥢	쥣	쥤	쥥	쥦	쥧	쥨	쥩	쥪	쥫	쥬	쥭	쥮	쥯	쥰	쥱	쥲	쥳	쥴	쥵	쥶	쥷	쥸	쥹	쥺	쥻	쥼	쥽	쥾	쥿	즀	즁	즂	즃	즄	즅	즆	즇	즈	즉	즊	즋	즌	즍	즎	즏	즐	즑	즒	즓	즔	즕	즖	즗	즘	즙	즚	즛	즜	증	즞	즟	즠	즡	즢	즣	즤	즥	즦	즧	즨	즩	즪	즫	즬	즭	즮	즯	즰	즱	즲	즳	즴	즵	즶	즷	즸	즹	즺	즻	즼	즽	즾	즿	지	직	짂	짃	진	짅	짆	짇	질	짉	짊	짋	짌	짍	짎	짏	짐	집	짒	짓	짔	징	짖	짗	짘	짙	짚	짛	ﾸ
ᄍ	ㅉ	짜	짝	짞	짟	짠	짡	짢	짣	짤	짥	짦	짧	짨	짩	짪	짫	짬	짭	짮	짯	짰	짱	짲	짳	짴	짵	짶	짷	째	짹	짺	짻	짼	짽	짾	짿	쨀	쨁	쨂	쨃	쨄	쨅	쨆	쨇	쨈	쨉	쨊	쨋	쨌	쨍	쨎	쨏	쨐	쨑	쨒	쨓	쨔	쨕	쨖	쨗	쨘	쨙	쨚	쨛	쨜	쨝	쨞	쨟	쨠	쨡	쨢	쨣	쨤	쨥	쨦	쨧	쨨	쨩	쨪	쨫	쨬	쨭	쨮	쨯	쨰	쨱	쨲	쨳	쨴	쨵	쨶	쨷	쨸	쨹	쨺	쨻	쨼	쨽	쨾	쨿	쩀	쩁	쩂	쩃	쩄	쩅	쩆	쩇	쩈	쩉	쩊	쩋	쩌	쩍	쩎	쩏	쩐	쩑	쩒	쩓	쩔	쩕	쩖	쩗	쩘	쩙	쩚	쩛	쩜	쩝	쩞	쩟	쩠	쩡	쩢	쩣	쩤	쩥	쩦	쩧	쩨	쩩	쩪	쩫	쩬	쩭	쩮	쩯	쩰	쩱	쩲	쩳	쩴	쩵	쩶	쩷	쩸	쩹	쩺	쩻	쩼	쩽	쩾	쩿	쪀	쪁	쪂	쪃	쪄	쪅	쪆	쪇	쪈	쪉	쪊	쪋	쪌	쪍	쪎	쪏	쪐	쪑	쪒	쪓	쪔	쪕	쪖	쪗	쪘	쪙	쪚	쪛	쪜	쪝	쪞	쪟	쪠	쪡	쪢	쪣	쪤	쪥	쪦	쪧	쪨	쪩	쪪	쪫	쪬	쪭	쪮	쪯	쪰	쪱	쪲	쪳	쪴	쪵	쪶	쪷	쪸	쪹	쪺	쪻	쪼	쪽	쪾	쪿	쫀	쫁	쫂	쫃	쫄	쫅	쫆	쫇	쫈	쫉	쫊	쫋	쫌	쫍	쫎	쫏	쫐	쫑	쫒	쫓	쫔	쫕	쫖	쫗	쫘	쫙	쫚	쫛	쫜	쫝	쫞	쫟	쫠	쫡	쫢	쫣	쫤	쫥	쫦	쫧	쫨	쫩	쫪	쫫	쫬	쫭	쫮	쫯	쫰	쫱	쫲	쫳	쫴	쫵	쫶	쫷	쫸	쫹	쫺	쫻	쫼	쫽	쫾	쫿	쬀	쬁	쬂	쬃	쬄	쬅	쬆	쬇	쬈	쬉	쬊	쬋	쬌	쬍	쬎	쬏	쬐	쬑	쬒	쬓	쬔	쬕	쬖	쬗	쬘	쬙	쬚	쬛	쬜	쬝	쬞	쬟	쬠	쬡	쬢	쬣	쬤	쬥	쬦	쬧	쬨	쬩	쬪	쬫	쬬	쬭	쬮	쬯	쬰	쬱	쬲	쬳	쬴	쬵	쬶	쬷	쬸	쬹	쬺	쬻	쬼	쬽	쬾	쬿	쭀	쭁	쭂	쭃	쭄	쭅	쭆	쭇	쭈	쭉	쭊	쭋	쭌	쭍	쭎	쭏	쭐	쭑	쭒	쭓	쭔	쭕	쭖	쭗	쭘	쭙	쭚	쭛	쭜	쭝	쭞	쭟	쭠	쭡	쭢	쭣	쭤	쭥	쭦	쭧	쭨	쭩	쭪	쭫	쭬	쭭	쭮	쭯	쭰	쭱	쭲	쭳	쭴	쭵	쭶	쭷	쭸	쭹	쭺	쭻	쭼	쭽	쭾	쭿	쮀	쮁	쮂	쮃	쮄	쮅	쮆	쮇	쮈	쮉	쮊	쮋	쮌	쮍	쮎	쮏	쮐	쮑	쮒	쮓	쮔	쮕	쮖	쮗	쮘	쮙	쮚	쮛	쮜	쮝	쮞	쮟	쮠	쮡	쮢	쮣	쮤	쮥	쮦	쮧	쮨	쮩	쮪	쮫	쮬	쮭	쮮	쮯	쮰	쮱	쮲	쮳	쮴	쮵	쮶	쮷	쮸	쮹	쮺	쮻	쮼	쮽	쮾	쮿	쯀	쯁	쯂	쯃	쯄	쯅	쯆	쯇	쯈	쯉	쯊	쯋	쯌	쯍	쯎	쯏	쯐	쯑	쯒	쯓	쯔	쯕	쯖	쯗	쯘	쯙	쯚	쯛	쯜	쯝	쯞	쯟	쯠	쯡	쯢	쯣	쯤	쯥	쯦	쯧	쯨	쯩	쯪	쯫	쯬	쯭	쯮	쯯	쯰	쯱	쯲	쯳	쯴	쯵	쯶	쯷	쯸	쯹	쯺	쯻	쯼	쯽	쯾	쯿	찀	찁	찂	찃	찄	찅	찆	찇	찈	찉	찊	찋	찌	찍	찎	찏	찐	찑	찒	찓	찔	찕	찖	찗	찘	찙	찚	찛	찜	찝	찞	찟	찠	찡	찢	찣	찤	찥	찦	찧	ﾹ
ᄎ	ㅊ	㈉	㈗	㉩	㉷	㉼	차	착	찪	찫	찬	찭	찮	찯	찰	찱	찲	찳	찴	찵	찶	찷	참	찹	찺	찻	찼	창	찾	찿	챀	챁	챂	챃	채	책	챆	챇	챈	챉	챊	챋	챌	챍	챎	챏	챐	챑	챒	챓	챔	챕	챖	챗	챘	챙	챚	챛	챜	챝	챞	챟	챠	챡	챢	챣	챤	챥	챦	챧	챨	챩	챪	챫	챬	챭	챮	챯	챰	챱	챲	챳	챴	챵	챶	챷	챸	챹	챺	챻	챼	챽	챾	챿	첀	첁	첂	첃	첄	첅	첆	첇	첈	첉	첊	첋	첌	첍	첎	첏	첐	첑	첒	첓	첔	첕	첖	첗	처	척	첚	첛	천	첝	첞	첟	철	첡	첢	첣	첤	첥	첦	첧	첨	첩	첪	첫	첬	청	첮	첯	첰	첱	첲	첳	체	첵	첶	첷	첸	첹	첺	첻	첼	첽	첾	첿	쳀	쳁	쳂	쳃	쳄	쳅	쳆	쳇	쳈	쳉	쳊	쳋	쳌	쳍	쳎	쳏	쳐	쳑	쳒	쳓	쳔	쳕	쳖	쳗	쳘	쳙	쳚	쳛	쳜	쳝	쳞	쳟	쳠	쳡	쳢	쳣	쳤	쳥	쳦	쳧	쳨	쳩	쳪	쳫	쳬	쳭	쳮	쳯	쳰	쳱	쳲	쳳	쳴	쳵	쳶	쳷	쳸	쳹	쳺	쳻	쳼	쳽	쳾	쳿	촀	촁	촂	촃	촄	촅	촆	촇	초	촉	촊	촋	촌	촍	촎	촏	촐	촑	촒	촓	촔	촕	촖	촗	촘	촙	촚	촛	촜	총	촞	촟	촠	촡	촢	촣	촤	촥	촦	촧	촨	촩	촪	촫	촬	촭	촮	촯	촰	촱	촲	촳	촴	촵	촶	촷	촸	촹	촺	촻	촼	촽	촾	촿	쵀	쵁	쵂	쵃	쵄	쵅	쵆	쵇	쵈	쵉	쵊	쵋	쵌	쵍	쵎	쵏	쵐	쵑	쵒	쵓	쵔	쵕	쵖	쵗	쵘	쵙	쵚	쵛	최	쵝	쵞	쵟	쵠	쵡	쵢	쵣	쵤	쵥	쵦	쵧	쵨	쵩	쵪	쵫	쵬	쵭	쵮	쵯	쵰	쵱	쵲	쵳	쵴	쵵	쵶	쵷	쵸	쵹	쵺	쵻	쵼	쵽	쵾	쵿	춀	춁	춂	춃	춄	춅	춆	춇	춈	춉	춊	춋	춌	춍	춎	춏	춐	춑	춒	춓	추	축	춖	춗	춘	춙	춚	춛	출	춝	춞	춟	춠	춡	춢	춣	춤	춥	춦	춧	춨	충	춪	춫	춬	춭	춮	춯	춰	춱	춲	춳	춴	춵	춶	춷	춸	춹	춺	춻	춼	춽	춾	춿	췀	췁	췂	췃	췄	췅	췆	췇	췈	췉	췊	췋	췌	췍	췎	췏	췐	췑	췒	췓	췔	췕	췖	췗	췘	췙	췚	췛	췜	췝	췞	췟	췠	췡	췢	췣	췤	췥	췦	췧	취	췩	췪	췫	췬	췭	췮	췯	췰	췱	췲	췳	췴	췵	췶	췷	췸	췹	췺	췻	췼	췽	췾	췿	츀	츁	츂	츃	츄	츅	츆	츇	츈	츉	츊	츋	츌	츍	츎	츏	츐	츑	츒	츓	츔	츕	츖	츗	츘	츙	츚	츛	츜	츝	츞	츟	츠	측	츢	츣	츤	츥	츦	츧	츨	츩	츪	츫	츬	츭	츮	츯	츰	츱	츲	츳	츴	층	츶	츷	츸	츹	츺	츻	츼	츽	츾	츿	칀	칁	칂	칃	칄	칅	칆	칇	칈	칉	칊	칋	칌	칍	칎	칏	칐	칑	칒	칓	칔	칕	칖	칗	치	칙	칚	칛	친	칝	칞	칟	칠	칡	칢	칣	칤	칥	칦	칧	침	칩	칪	칫	칬	칭	칮	칯	칰	칱	칲	칳	ﾺ
ᄏ	ㅋ	㈊	㈘	㉪	㉸	카	칵	칶	칷	칸	칹	칺	칻	칼	칽	칾	칿	캀	캁	캂	캃	캄	캅	캆	캇	캈	캉	캊	캋	캌	캍	캎	캏	캐	캑	캒	캓	캔	캕	캖	캗	캘	캙	캚	캛	캜	캝	캞	캟	캠	캡	캢	캣	캤	캥	캦	캧	캨	캩	캪	캫	캬	캭	캮	캯	캰	캱	캲	캳	캴	캵	캶	캷	캸	캹	캺	캻	캼	캽	캾	캿	컀	컁	컂	컃	컄	컅	컆	컇	컈	컉	컊	컋	컌	컍	컎	컏	컐	컑	컒	컓	컔	컕	컖	컗	컘	컙	컚	컛	컜	컝	컞	컟	컠	컡	컢	컣	커	컥	컦	컧	컨	컩	컪	컫	컬	컭	컮	컯	컰	컱	컲	컳	컴	컵	컶	컷	컸	컹	컺	컻	컼	컽	컾	컿	케	켁	켂	켃	켄	켅	켆	켇	켈	켉	켊	켋	켌	켍	켎	켏	켐	켑	켒	켓	켔	켕	켖	켗	켘	켙	켚	켛	켜	켝	켞	켟	켠	켡	켢	켣	켤	켥	켦	켧	켨	켩	켪	켫	켬	켭	켮	켯	켰	켱	켲	켳	켴	켵	켶	켷	켸	켹	켺	켻	켼	켽	켾	켿	콀	콁	콂	콃	콄	콅	콆	콇	콈	콉	콊	콋	콌	콍	콎	콏	콐	콑	콒	콓	코	콕	콖	콗	콘	콙	콚	콛	콜	콝	콞	콟	콠	콡	콢	콣	콤	콥	콦	콧	콨	콩	콪	콫	콬	콭	콮	콯	콰	콱	콲	콳	콴	콵	콶	콷	콸	콹	콺	콻	콼	콽	콾	콿	쾀	쾁	쾂	쾃	쾄	쾅	쾆	쾇	쾈	쾉	쾊	쾋	쾌	쾍	쾎	쾏	쾐	쾑	쾒	쾓	쾔	쾕	쾖	쾗	쾘	쾙	쾚	쾛	쾜	쾝	쾞	쾟	쾠	쾡	쾢	쾣	쾤	쾥	쾦	쾧	쾨	쾩	쾪	쾫	쾬	쾭	쾮	쾯	쾰	쾱	쾲	쾳	쾴	쾵	쾶	쾷	쾸	쾹	쾺	쾻	쾼	쾽	쾾	쾿	쿀	쿁	쿂	쿃	쿄	쿅	쿆	쿇	쿈	쿉	쿊	쿋	쿌	쿍	쿎	쿏	쿐	쿑	쿒	쿓	쿔	쿕	쿖	쿗	쿘	쿙	쿚	쿛	쿜	쿝	쿞	쿟	쿠	쿡	쿢	쿣	쿤	쿥	쿦	쿧	쿨	쿩	쿪	쿫	쿬	쿭	쿮	쿯	쿰	쿱	쿲	쿳	쿴	쿵	쿶	쿷	쿸	쿹	쿺	쿻	쿼	쿽	쿾	쿿	퀀	퀁	퀂	퀃	퀄	퀅	퀆	퀇	퀈	퀉	퀊	퀋	퀌	퀍	퀎	퀏	퀐	퀑	퀒	퀓	퀔	퀕	퀖	퀗	퀘	퀙	퀚	퀛	퀜	퀝	퀞	퀟	퀠	퀡	퀢	퀣	퀤	퀥	퀦	퀧	퀨	퀩	퀪	퀫	퀬	퀭	퀮	퀯	퀰	퀱	퀲	퀳	퀴	퀵	퀶	퀷	퀸	퀹	퀺	퀻	퀼	퀽	퀾	퀿	큀	큁	큂	큃	큄	큅	큆	큇	큈	큉	큊	큋	큌	큍	큎	큏	큐	큑	큒	큓	큔	큕	큖	큗	큘	큙	큚	큛	큜	큝	큞	큟	큠	큡	큢	큣	큤	큥	큦	큧	큨	큩	큪	큫	크	큭	큮	큯	큰	큱	큲	큳	클	큵	큶	큷	큸	큹	큺	큻	큼	큽	큾	큿	킀	킁	킂	킃	킄	킅	킆	킇	킈	킉	킊	킋	킌	킍	킎	킏	킐	킑	킒	킓	킔	킕	킖	킗	킘	킙	킚	킛	킜	킝	킞	킟	킠	킡	킢	킣	키	킥	킦	킧	킨	킩	킪	킫	킬	킭	킮	킯	킰	킱	킲	킳	킴	킵	킶	킷	킸	킹	킺	킻	킼	킽	킾	킿	ﾻ
ᄐ	ㅌ	㈋	㈙	㉫	㉹	타	탁	탂	탃	탄	탅	탆	탇	탈	탉	탊	탋	탌	탍	탎	탏	탐	탑	탒	탓	탔	탕	탖	탗	탘	탙	탚	탛	태	택	탞	탟	탠	탡	탢	탣	탤	탥	탦	탧	탨	탩	탪	탫	탬	탭	탮	탯	탰	탱	탲	탳	탴	탵	탶	탷	탸	탹	탺	탻	탼	탽	탾	탿	턀	턁	턂	턃	턄	턅	턆	턇	턈	턉	턊	턋	턌	턍	턎	턏	턐	턑	턒	턓	턔	턕	턖	턗	턘	턙	턚	턛	턜	턝	턞	턟	턠	턡	턢	턣	턤	턥	턦	턧	턨	턩	턪	턫	턬	턭	턮	턯	터	턱	턲	턳	턴	턵	턶	턷	털	턹	턺	턻	턼	턽	턾	턿	텀	텁	텂	텃	텄	텅	텆	텇	텈	텉	텊	텋	테	텍	텎	텏	텐	텑	텒	텓	텔	텕	텖	텗	텘	텙	텚	텛	템	텝	텞	텟	텠	텡	텢	텣	텤	텥	텦	텧	텨	텩	텪	텫	텬	텭	텮	텯	텰	텱	텲	텳	텴	텵	텶	텷	텸	텹	텺	텻	텼	텽	텾	텿	톀	톁	톂	톃	톄	톅	톆	톇	톈	톉	톊	톋	톌	톍	톎	톏	톐	톑	톒	톓	톔	톕	톖	톗	톘	톙	톚	톛	톜	톝	톞	톟	토	톡	톢	톣	톤	톥	톦	톧	톨	톩	톪	톫	톬	톭	톮	톯	톰	톱	톲	톳	톴	통	톶	톷	톸	톹	톺	톻	톼	톽	톾	톿	퇀	퇁	퇂	퇃	퇄	퇅	퇆	퇇	퇈	퇉	퇊	퇋	퇌	퇍	퇎	퇏	퇐	퇑	퇒	퇓	퇔	퇕	퇖	퇗	퇘	퇙	퇚	퇛	퇜	퇝	퇞	퇟	퇠	퇡	퇢	퇣	퇤	퇥	퇦	퇧	퇨	퇩	퇪	퇫	퇬	퇭	퇮	퇯	퇰	퇱	퇲	퇳	퇴	퇵	퇶	퇷	퇸	퇹	퇺	퇻	퇼	퇽	퇾	퇿	툀	툁	툂	툃	툄	툅	툆	툇	툈	툉	툊	툋	툌	툍	툎	툏	툐	툑	툒	툓	툔	툕	툖	툗	툘	툙	툚	툛	툜	툝	툞	툟	툠	툡	툢	툣	툤	툥	툦	툧	툨	툩	툪	툫	투	툭	툮	툯	툰	툱	툲	툳	툴	툵	툶	툷	툸	툹	툺	툻	툼	툽	툾	툿	퉀	퉁	퉂	퉃	퉄	퉅	퉆	퉇	퉈	퉉	퉊	퉋	퉌	퉍	퉎	퉏	퉐	퉑	퉒	퉓	퉔	퉕	퉖	퉗	퉘	퉙	퉚	퉛	퉜	퉝	퉞	퉟	퉠	퉡	퉢	퉣	퉤	퉥	퉦	퉧	퉨	퉩	퉪	퉫	퉬	퉭	퉮	퉯	퉰	퉱	퉲	퉳	퉴	퉵	퉶	퉷	퉸	퉹	퉺	퉻	퉼	퉽	퉾	퉿	튀	튁	튂	튃	튄	튅	튆	튇	튈	튉	튊	튋	튌	튍	튎	튏	튐	튑	튒	튓	튔	튕	튖	튗	튘	튙	튚	튛	튜	튝	튞	튟	튠	튡	튢	튣	튤	튥	튦	튧	튨	튩	튪	튫	튬	튭	튮	튯	튰	튱	튲	튳	튴	튵	튶	튷	트	특	튺	튻	튼	튽	튾	튿	틀	틁	틂	틃	틄	틅	틆	틇	틈	틉	틊	틋	틌	틍	틎	틏	틐	틑	틒	틓	틔	틕	틖	틗	틘	틙	틚	틛	틜	틝	틞	틟	틠	틡	틢	틣	틤	틥	틦	틧	틨	틩	틪	틫	틬	틭	틮	틯	티	틱	틲	틳	틴	틵	틶	틷	틸	틹	틺	틻	틼	틽	틾	틿	팀	팁	팂	팃	팄	팅	팆	팇	팈	팉	팊	팋	ﾼ
ᄑ	ㅍ	㈌	㈚	㉬	㉺	파	팍	팎	팏	판	팑	팒	팓	팔	팕	팖	팗	팘	팙	팚	팛	팜	팝	팞	팟	팠	팡	팢	팣	팤	팥	팦	팧	패	팩	팪	팫	팬	팭	팮	팯	팰	팱	팲	팳	팴	팵	팶	팷	팸	팹	팺	팻	팼	팽	팾	팿	퍀	퍁	퍂	퍃	퍄	퍅	퍆	퍇	퍈	퍉	퍊	퍋	퍌	퍍	퍎	퍏	퍐	퍑	퍒	퍓	퍔	퍕	퍖	퍗	퍘	퍙	퍚	퍛	퍜	퍝	퍞	퍟	퍠	퍡	퍢	퍣	퍤	퍥	퍦	퍧	퍨	퍩	퍪	퍫	퍬	퍭	퍮	퍯	퍰	퍱	퍲	퍳	퍴	퍵	퍶	퍷	퍸	퍹	퍺	퍻	퍼	퍽	퍾	퍿	펀	펁	펂	펃	펄	펅	펆	펇	펈	펉	펊	펋	펌	펍	펎	펏	펐	펑	펒	펓	펔	펕	펖	펗	페	펙	펚	펛	펜	펝	펞	펟	펠	펡	펢	펣	펤	펥	펦	펧	펨	펩	펪	펫	펬	펭	펮	펯	펰	펱	펲	펳	펴	펵	펶	펷	편	펹	펺	펻	펼	펽	펾	펿	폀	폁	폂	폃	폄	폅	폆	폇	폈	평	폊	폋	폌	폍	폎	폏	폐	폑	폒	폓	폔	폕	폖	폗	폘	폙	폚	폛	폜	폝	폞	폟	폠	폡	폢	폣	폤	폥	폦	폧	폨	폩	폪	폫	포	폭	폮	폯	폰	폱	폲	폳	폴	폵	폶	폷	폸	폹	폺	폻	폼	폽	폾	폿	퐀	퐁	퐂	퐃	퐄	퐅	퐆	퐇	퐈	퐉	퐊	퐋	퐌	퐍	퐎	퐏	퐐	퐑	퐒	퐓	퐔	퐕	퐖	퐗	퐘	퐙	퐚	퐛	퐜	퐝	퐞	퐟	퐠	퐡	퐢	퐣	퐤	퐥	퐦	퐧	퐨	퐩	퐪	퐫	퐬	퐭	퐮	퐯	퐰	퐱	퐲	퐳	퐴	퐵	퐶	퐷	퐸	퐹	퐺	퐻	퐼	퐽	퐾	퐿	푀	푁	푂	푃	푄	푅	푆	푇	푈	푉	푊	푋	푌	푍	푎	푏	푐	푑	푒	푓	푔	푕	푖	푗	푘	푙	푚	푛	표	푝	푞	푟	푠	푡	푢	푣	푤	푥	푦	푧	푨	푩	푪	푫	푬	푭	푮	푯	푰	푱	푲	푳	푴	푵	푶	푷	푸	푹	푺	푻	푼	푽	푾	푿	풀	풁	풂	풃	풄	풅	풆	풇	품	풉	풊	풋	풌	풍	풎	풏	풐	풑	풒	풓	풔	풕	풖	풗	풘	풙	풚	풛	풜	풝	풞	풟	풠	풡	풢	풣	풤	풥	풦	풧	풨	풩	풪	풫	풬	풭	풮	풯	풰	풱	풲	풳	풴	풵	풶	풷	풸	풹	풺	풻	풼	풽	풾	풿	퓀	퓁	퓂	퓃	퓄	퓅	퓆	퓇	퓈	퓉	퓊	퓋	퓌	퓍	퓎	퓏	퓐	퓑	퓒	퓓	퓔	퓕	퓖	퓗	퓘	퓙	퓚	퓛	퓜	퓝	퓞	퓟	퓠	퓡	퓢	퓣	퓤	퓥	퓦	퓧	퓨	퓩	퓪	퓫	퓬	퓭	퓮	퓯	퓰	퓱	퓲	퓳	퓴	퓵	퓶	퓷	퓸	퓹	퓺	퓻	퓼	퓽	퓾	퓿	픀	픁	픂	픃	프	픅	픆	픇	픈	픉	픊	픋	플	픍	픎	픏	픐	픑	픒	픓	픔	픕	픖	픗	픘	픙	픚	픛	픜	픝	픞	픟	픠	픡	픢	픣	픤	픥	픦	픧	픨	픩	픪	픫	픬	픭	픮	픯	픰	픱	픲	픳	픴	픵	픶	픷	픸	픹	픺	픻	피	픽	픾	픿	핀	핁	핂	핃	필	핅	핆	핇	핈	핉	핊	핋	핌	핍	핎	핏	핐	핑	핒	핓	핔	핕	핖	핗	ﾽ
ᄒ	ㅎ	㈍	㈛	㈞	㉭	㉻	하	학	핚	핛	한	핝	핞	핟	할	핡	핢	핣	핤	핥	핦	핧	함	합	핪	핫	핬	항	핮	핯	핰	핱	핲	핳	해	핵	핶	핷	핸	핹	핺	핻	핼	핽	핾	핿	햀	햁	햂	햃	햄	햅	햆	햇	했	행	햊	햋	햌	햍	햎	햏	햐	햑	햒	햓	햔	햕	햖	햗	햘	햙	햚	햛	햜	햝	햞	햟	햠	햡	햢	햣	햤	향	햦	햧	햨	햩	햪	햫	햬	햭	햮	햯	햰	햱	햲	햳	햴	햵	햶	햷	햸	햹	햺	햻	햼	햽	햾	햿	헀	헁	헂	헃	헄	헅	헆	헇	허	헉	헊	헋	헌	헍	헎	헏	헐	헑	헒	헓	헔	헕	헖	헗	험	헙	헚	헛	헜	헝	헞	헟	헠	헡	헢	헣	헤	헥	헦	헧	헨	헩	헪	헫	헬	헭	헮	헯	헰	헱	헲	헳	헴	헵	헶	헷	헸	헹	헺	헻	헼	헽	헾	헿	혀	혁	혂	혃	현	혅	혆	혇	혈	혉	혊	혋	혌	혍	혎	혏	혐	협	혒	혓	혔	형	혖	혗	혘	혙	혚	혛	혜	혝	혞	혟	혠	혡	혢	혣	혤	혥	혦	혧	혨	혩	혪	혫	혬	혭	혮	혯	혰	혱	혲	혳	혴	혵	혶	혷	호	혹	혺	혻	혼	혽	혾	혿	홀	홁	홂	홃	홄	홅	홆	홇	홈	홉	홊	홋	홌	홍	홎	홏	홐	홑	홒	홓	화	확	홖	홗	환	홙	홚	홛	활	홝	홞	홟	홠	홡	홢	홣	홤	홥	홦	홧	홨	황	홪	홫	홬	홭	홮	홯	홰	홱	홲	홳	홴	홵	홶	홷	홸	홹	홺	홻	홼	홽	홾	홿	횀	횁	횂	횃	횄	횅	횆	횇	횈	횉	횊	횋	회	획	횎	횏	횐	횑	횒	횓	횔	횕	횖	횗	횘	횙	횚	횛	횜	횝	횞	횟	횠	횡	횢	횣	횤	횥	횦	횧	효	횩	횪	횫	횬	횭	횮	횯	횰	횱	횲	횳	횴	횵	횶	횷	횸	횹	횺	횻	횼	횽	횾	횿	훀	훁	훂	훃	후	훅	훆	훇	훈	훉	훊	훋	훌	훍	훎	훏	훐	훑	훒	훓	훔	훕	훖	훗	훘	훙	훚	훛	훜	훝	훞	훟	훠	훡	훢	훣	훤	훥	훦	훧	훨	훩	훪	훫	훬	훭	훮	훯	훰	훱	훲	훳	훴	훵	훶	훷	훸	훹	훺	훻	훼	훽	훾	훿	휀	휁	휂	휃	휄	휅	휆	휇	휈	휉	휊	휋	휌	휍	휎	휏	휐	휑	휒	휓	휔	휕	휖	휗	휘	휙	휚	휛	휜	휝	휞	휟	휠	휡	휢	휣	휤	휥	휦	휧	휨	휩	휪	휫	휬	휭	휮	휯	휰	휱	휲	휳	휴	휵	휶	휷	휸	휹	휺	휻	휼	휽	휾	휿	흀	흁	흂	흃	흄	흅	흆	흇	흈	흉	흊	흋	흌	흍	흎	흏	흐	흑	흒	흓	흔	흕	흖	흗	흘	흙	흚	흛	흜	흝	흞	흟	흠	흡	흢	흣	흤	흥	흦	흧	흨	흩	흪	흫	희	흭	흮	흯	흰	흱	흲	흳	흴	흵	흶	흷	흸	흹	흺	흻	흼	흽	흾	흿	힀	힁	힂	힃	힄	힅	힆	힇	히	힉	힊	힋	힌	힍	힎	힏	힐	힑	힒	힓	힔	힕	힖	힗	힘	힙	힚	힛	힜	힝	힞	힟	힠	힡	힢	힣	ﾾ
ᄔ	ㅥ
ᄕ	ㅦ
ᄚ	ㅀ	ﾰ
ᄜ	ㅮ
ᄝ	ㅱ
ᄞ	ㅲ
ᄠ	ㅳ
ᄡ	ㅄ	ﾴ
ᄢ	ㅴ
ᄣ	ㅵ
ᄧ	ㅶ
ᄩ	ㅷ
ᄫ	ㅸ
ᄬ	ㅹ
ᄭ	ㅺ
ᄮ	ㅻ
ᄯ	ㅼ
ᄲ	ㅽ
ᄶ	ㅾ
ᅀ	ㅿ
ᅇ	ㆀ
ᅌ	ㆁ
ᅗ	ㆄ
ᅘ	ㆅ
ᅙ	ㆆ
ᅠ	ㅤ	ﾠ
ᅡ	ㅏ	㈎	㈏	㈐	㈑	㈒	㈓	㈔	㈕	㈖	㈗	㈘	㈙	㈚	㈛	㉮	㉯	㉰	㉱	㉲	㉳	㉴	㉵	㉶	㉷	㉸	㉹	㉺	㉻	㉼	가	각	갂	갃	간	갅	갆	갇	갈	갉	갊	갋	갌	갍	갎	갏	감	갑	값	갓	갔	강	갖	갗	갘	같	갚	갛	까	깍	깎	깏	깐	깑	깒	깓	깔	깕	깖	깗	깘	깙	깚	깛	깜	깝	깞	깟	깠	깡	깢	깣	깤	깥	깦	깧	나	낙	낚	낛	난	낝	낞	낟	날	낡	낢	낣	낤	낥	낦	낧	남	납	낪	낫	났	낭	낮	낯	낰	낱	낲	낳	다	닥	닦	닧	단	닩	닪	닫	달	닭	닮	닯	닰	닱	닲	닳	담	답	닶	닷	닸	당	닺	닻	닼	닽	닾	닿	따	딱	딲	딳	딴	딵	딶	딷	딸	딹	딺	딻	딼	딽	딾	딿	땀	땁	땂	땃	땄	땅	땆	땇	땈	땉	땊	땋	라	락	띾	띿	란	랁	랂	랃	랄	랅	랆	랇	랈	랉	랊	랋	람	랍	랎	랏	랐	랑	랒	랓	랔	랕	랖	랗	마	막	맊	맋	만	맍	많	맏	말	맑	맒	맓	맔	맕	맖	맗	맘	맙	맚	맛	맜	망	맞	맟	맠	맡	맢	맣	바	박	밖	밗	반	밙	밚	받	발	밝	밞	밟	밠	밡	밢	밣	밤	밥	밦	밧	밨	방	밪	밫	밬	밭	밮	밯	빠	빡	빢	빣	빤	빥	빦	빧	빨	빩	빪	빫	빬	빭	빮	빯	빰	빱	빲	빳	빴	빵	빶	빷	빸	빹	빺	빻	사	삭	삮	삯	산	삱	삲	삳	살	삵	삶	삷	삸	삹	삺	삻	삼	삽	삾	삿	샀	상	샂	샃	샄	샅	샆	샇	싸	싹	싺	싻	싼	싽	싾	싿	쌀	쌁	쌂	쌃	쌄	쌅	쌆	쌇	쌈	쌉	쌊	쌋	쌌	쌍	쌎	쌏	쌐	쌑	쌒	쌓	아	악	앆	앇	안	앉	않	앋	알	앍	앎	앏	앐	앑	앒	앓	암	압	앖	앗	았	앙	앚	앛	앜	앝	앞	앟	자	작	잒	잓	잔	잕	잖	잗	잘	잙	잚	잛	잜	잝	잞	잟	잠	잡	잢	잣	잤	장	잦	잧	잨	잩	잪	잫	짜	짝	짞	짟	짠	짡	짢	짣	짤	짥	짦	짧	짨	짩	짪	짫	짬	짭	짮	짯	짰	짱	짲	짳	짴	짵	짶	짷	차	착	찪	찫	찬	찭	찮	찯	찰	찱	찲	찳	찴	찵	찶	찷	참	찹	찺	찻	찼	창	찾	찿	챀	챁	챂	챃	카	칵	칶	칷	칸	칹	칺	칻	칼	칽	칾	칿	캀	캁	캂	캃	캄	캅	캆	캇	캈	캉	캊	캋	캌	캍	캎	캏	타	탁	탂	탃	탄	탅	탆	탇	탈	탉	탊	탋	탌	탍	탎	탏	탐	탑	탒	탓	탔	탕	탖	탗	탘	탙	탚	탛	파	팍	팎	팏	판	팑	팒	팓	팔	팕	팖	팗	팘	팙	팚	팛	팜	팝	팞	팟	팠	팡	팢	팣	팤	팥	팦	팧	하	학	핚	핛	한	핝	핞	핟	할	핡	핢	핣	핤	핥	핦	핧	함	합	핪	핫	핬	항	핮	핯	핰	핱	핲	핳	ￂ
ᅢ	ㅐ	개	객	갞	갟	갠	갡	갢	갣	갤	갥	갦	갧	갨	갩	갪	갫	갬	갭	갮	갯	갰	갱	갲	갳	갴	갵	갶	갷	깨	깩	깪	깫	깬	깭	깮	깯	깰	깱	깲	깳	깴	깵	깶	깷	깸	깹	깺	깻	깼	깽	깾	깿	꺀	꺁	꺂	꺃	내	낵	낶	낷	낸	낹	낺	낻	낼	낽	낾	낿	냀	냁	냂	냃	냄	냅	냆	냇	냈	냉	냊	냋	냌	냍	냎	냏	대	댁	댂	댃	댄	댅	댆	댇	댈	댉	댊	댋	댌	댍	댎	댏	댐	댑	댒	댓	댔	댕	댖	댗	댘	댙	댚	댛	때	땍	땎	땏	땐	땑	땒	땓	땔	땕	땖	땗	땘	땙	땚	땛	땜	땝	땞	땟	땠	땡	땢	땣	땤	땥	땦	땧	래	랙	랚	랛	랜	랝	랞	랟	랠	랡	랢	랣	랤	랥	랦	랧	램	랩	랪	랫	랬	랭	랮	랯	랰	랱	랲	랳	매	맥	맦	맧	맨	맩	맪	맫	맬	맭	맮	맯	맰	맱	맲	맳	맴	맵	맶	맷	맸	맹	맺	맻	맼	맽	맾	맿	배	백	밲	밳	밴	밵	밶	밷	밸	밹	밺	밻	밼	밽	밾	밿	뱀	뱁	뱂	뱃	뱄	뱅	뱆	뱇	뱈	뱉	뱊	뱋	빼	빽	빾	빿	뺀	뺁	뺂	뺃	뺄	뺅	뺆	뺇	뺈	뺉	뺊	뺋	뺌	뺍	뺎	뺏	뺐	뺑	뺒	뺓	뺔	뺕	뺖	뺗	새	색	샊	샋	샌	샍	샎	샏	샐	샑	샒	샓	샔	샕	샖	샗	샘	샙	샚	샛	샜	생	샞	샟	샠	샡	샢	샣	쌔	쌕	쌖	쌗	쌘	쌙	쌚	쌛	쌜	쌝	쌞	쌟	쌠	쌡	쌢	쌣	쌤	쌥	쌦	쌧	쌨	쌩	쌪	쌫	쌬	쌭	쌮	쌯	애	액	앢	앣	앤	앥	앦	앧	앨	앩	앪	앫	앬	앭	앮	앯	앰	앱	앲	앳	앴	앵	앶	앷	앸	앹	앺	앻	재	잭	잮	잯	잰	잱	잲	잳	잴	잵	잶	잷	잸	잹	잺	잻	잼	잽	잾	잿	쟀	쟁	쟂	쟃	쟄	쟅	쟆	쟇	째	짹	짺	짻	짼	짽	짾	짿	쨀	쨁	쨂	쨃	쨄	쨅	쨆	쨇	쨈	쨉	쨊	쨋	쨌	쨍	쨎	쨏	쨐	쨑	쨒	쨓	채	책	챆	챇	챈	챉	챊	챋	챌	챍	챎	챏	챐	챑	챒	챓	챔	챕	챖	챗	챘	챙	챚	챛	챜	챝	챞	챟	캐	캑	캒	캓	캔	캕	캖	캗	캘	캙	캚	캛	캜	캝	캞	캟	캠	캡	캢	캣	캤	캥	캦	캧	캨	캩	캪	캫	태	택	탞	탟	탠	탡	탢	탣	탤	탥	탦	탧	탨	탩	탪	탫	탬	탭	탮	탯	탰	탱	탲	탳	탴	탵	탶	탷	패	팩	팪	팫	팬	팭	팮	팯	팰	팱	팲	팳	팴	팵	팶	팷	팸	팹	팺	팻	팼	팽	팾	팿	퍀	퍁	퍂	퍃	해	핵	핶	핷	핸	핹	핺	핻	핼	핽	핾	핿	햀	햁	햂	햃	햄	햅	햆	햇	했	행	햊	햋	햌	햍	햎	햏	ￃ
ᅣ	ㅑ	갸	갹	갺	갻	갼	갽	갾	갿	걀	걁	걂	걃	걄	걅	걆	걇	걈	걉	걊	걋	걌	걍	걎	걏	걐	걑	걒	걓	꺄	꺅	꺆	꺇	꺈	꺉	꺊	꺋	꺌	꺍	꺎	꺏	꺐	꺑	꺒	꺓	꺔	꺕	꺖	꺗	꺘	꺙	꺚	꺛	꺜	꺝	꺞	꺟	냐	냑	냒	냓	냔	냕	냖	냗	냘	냙	냚	냛	냜	냝	냞	냟	냠	냡	냢	냣	냤	냥	냦	냧	냨	냩	냪	냫	댜	댝	댞	댟	댠	댡	댢	댣	댤	댥	댦	댧	댨	댩	댪	댫	댬	댭	댮	댯	댰	댱	댲	댳	댴	댵	댶	댷	땨	땩	땪	땫	땬	땭	땮	땯	땰	땱	땲	땳	땴	땵	땶	땷	땸	땹	땺	땻	땼	땽	땾	땿	떀	떁	떂	떃	랴	략	랶	랷	랸	랹	랺	랻	랼	랽	랾	랿	럀	럁	럂	럃	럄	럅	럆	럇	럈	량	럊	럋	럌	럍	럎	럏	먀	먁	먂	먃	먄	먅	먆	먇	먈	먉	먊	먋	먌	먍	먎	먏	먐	먑	먒	먓	먔	먕	먖	먗	먘	먙	먚	먛	뱌	뱍	뱎	뱏	뱐	뱑	뱒	뱓	뱔	뱕	뱖	뱗	뱘	뱙	뱚	뱛	뱜	뱝	뱞	뱟	뱠	뱡	뱢	뱣	뱤	뱥	뱦	뱧	뺘	뺙	뺚	뺛	뺜	뺝	뺞	뺟	뺠	뺡	뺢	뺣	뺤	뺥	뺦	뺧	뺨	뺩	뺪	뺫	뺬	뺭	뺮	뺯	뺰	뺱	뺲	뺳	샤	샥	샦	샧	샨	샩	샪	샫	샬	샭	샮	샯	샰	샱	샲	샳	샴	샵	샶	샷	샸	샹	샺	샻	샼	샽	샾	샿	쌰	쌱	쌲	쌳	쌴	쌵	쌶	쌷	쌸	쌹	쌺	쌻	쌼	쌽	쌾	쌿	썀	썁	썂	썃	썄	썅	썆	썇	썈	썉	썊	썋	야	약	앾	앿	얀	얁	얂	얃	얄	얅	얆	얇	얈	얉	얊	얋	얌	얍	얎	얏	얐	양	얒	얓	얔	얕	얖	얗	쟈	쟉	쟊	쟋	쟌	쟍	쟎	쟏	쟐	쟑	쟒	쟓	쟔	쟕	쟖	쟗	쟘	쟙	쟚	쟛	쟜	쟝	쟞	쟟	쟠	쟡	쟢	쟣	쨔	쨕	쨖	쨗	쨘	쨙	쨚	쨛	쨜	쨝	쨞	쨟	쨠	쨡	쨢	쨣	쨤	쨥	쨦	쨧	쨨	쨩	쨪	쨫	쨬	쨭	쨮	쨯	챠	챡	챢	챣	챤	챥	챦	챧	챨	챩	챪	챫	챬	챭	챮	챯	챰	챱	챲	챳	챴	챵	챶	챷	챸	챹	챺	챻	캬	캭	캮	캯	캰	캱	캲	캳	캴	캵	캶	캷	캸	캹	캺	캻	캼	캽	캾	캿	컀	컁	컂	컃	컄	컅	컆	컇	탸	탹	탺	탻	탼	탽	탾	탿	턀	턁	턂	턃	턄	턅	턆	턇	턈	턉	턊	턋	턌	턍	턎	턏	턐	턑	턒	턓	퍄	퍅	퍆	퍇	퍈	퍉	퍊	퍋	퍌	퍍	퍎	퍏	퍐	퍑	퍒	퍓	퍔	퍕	퍖	퍗	퍘	퍙	퍚	퍛	퍜	퍝	퍞	퍟	햐	햑	햒	햓	햔	햕	햖	햗	햘	햙	햚	햛	햜	햝	햞	햟	햠	햡	햢	햣	햤	향	햦	햧	햨	햩	햪	햫	ￄ
ᅤ	ㅒ	걔	걕	걖	걗	걘	걙	걚	걛	걜	걝	걞	걟	걠	걡	걢	걣	걤	걥	걦	걧	걨	걩	걪	걫	걬	걭	걮	걯	꺠	꺡	꺢	꺣	꺤	꺥	꺦	꺧	꺨	꺩	꺪	꺫	꺬	꺭	꺮	꺯	꺰	꺱	꺲	꺳	꺴	꺵	꺶	꺷	꺸	꺹	꺺	꺻	냬	냭	냮	냯	냰	냱	냲	냳	냴	냵	냶	냷	냸	냹	냺	냻	냼	냽	냾	냿	넀	넁	넂	넃	넄	넅	넆	넇	댸	댹	댺	댻	댼	댽	댾	댿	덀	덁	덂	덃	덄	덅	덆	덇	덈	덉	덊	덋	덌	덍	덎	덏	덐	덑	덒	덓	떄	떅	떆	떇	떈	떉	떊	떋	떌	떍	떎	떏	떐	떑	떒	떓	떔	떕	떖	떗	떘	떙	떚	떛	떜	떝	떞	떟	럐	럑	럒	럓	럔	럕	럖	럗	럘	럙	럚	럛	럜	럝	럞	럟	럠	럡	럢	럣	럤	럥	럦	럧	럨	럩	럪	럫	먜	먝	먞	먟	먠	먡	먢	먣	먤	먥	먦	먧	먨	먩	먪	먫	먬	먭	먮	먯	먰	먱	먲	먳	먴	먵	먶	먷	뱨	뱩	뱪	뱫	뱬	뱭	뱮	뱯	뱰	뱱	뱲	뱳	뱴	뱵	뱶	뱷	뱸	뱹	뱺	뱻	뱼	뱽	뱾	뱿	벀	벁	벂	벃	뺴	뺵	뺶	뺷	뺸	뺹	뺺	뺻	뺼	뺽	뺾	뺿	뻀	뻁	뻂	뻃	뻄	뻅	뻆	뻇	뻈	뻉	뻊	뻋	뻌	뻍	뻎	뻏	섀	섁	섂	섃	섄	섅	섆	섇	섈	섉	섊	섋	섌	섍	섎	섏	섐	섑	섒	섓	섔	섕	섖	섗	섘	섙	섚	섛	썌	썍	썎	썏	썐	썑	썒	썓	썔	썕	썖	썗	썘	썙	썚	썛	썜	썝	썞	썟	썠	썡	썢	썣	썤	썥	썦	썧	얘	얙	얚	얛	얜	얝	얞	얟	얠	얡	얢	얣	얤	얥	얦	얧	얨	얩	얪	얫	얬	얭	얮	얯	얰	얱	얲	얳	쟤	쟥	쟦	쟧	쟨	쟩	쟪	쟫	쟬	쟭	쟮	쟯	쟰	쟱	쟲	쟳	쟴	쟵	쟶	쟷	쟸	쟹	쟺	쟻	쟼	쟽	쟾	쟿	쨰	쨱	쨲	쨳	쨴	쨵	쨶	쨷	쨸	쨹	쨺	쨻	쨼	쨽	쨾	쨿	쩀	쩁	쩂	쩃	쩄	쩅	쩆	쩇	쩈	쩉	쩊	쩋	챼	챽	챾	챿	첀	첁	첂	첃	첄	첅	첆	첇	첈	첉	첊	첋	첌	첍	첎	첏	첐	첑	첒	첓	첔	첕	첖	첗	컈	컉	컊	컋	컌	컍	컎	컏	컐	컑	컒	컓	컔	컕	컖	컗	컘	컙	컚	컛	컜	컝	컞	컟	컠	컡	컢	컣	턔	턕	턖	턗	턘	턙	턚	턛	턜	턝	턞	턟	턠	턡	턢	턣	턤	턥	턦	턧	턨	턩	턪	턫	턬	턭	턮	턯	퍠	퍡	퍢	퍣	퍤	퍥	퍦	퍧	퍨	퍩	퍪	퍫	퍬	퍭	퍮	퍯	퍰	퍱	퍲	퍳	퍴	퍵	퍶	퍷	퍸	퍹	퍺	퍻	햬	햭	햮	햯	햰	햱	햲	햳	햴	햵	햶	햷	햸	햹	햺	햻	햼	햽	햾	햿	헀	헁	헂	헃	헄	헅	헆	헇	ￅ
ᅥ	ㅓ	㈝	거	걱	걲	걳	건	걵	걶	걷	걸	걹	걺	걻	걼	걽	걾	걿	검	겁	겂	것	겄	겅	겆	겇	겈	겉	겊	겋	꺼	꺽	꺾	꺿	껀	껁	껂	껃	껄	껅	껆	껇	껈	껉	껊	껋	껌	껍	껎	껏	껐	껑	껒	껓	껔	껕	껖	껗	너	넉	넊	넋	넌	넍	넎	넏	널	넑	넒	넓	넔	넕	넖	넗	넘	넙	넚	넛	넜	넝	넞	넟	넠	넡	넢	넣	더	덕	덖	덗	던	덙	덚	덛	덜	덝	덞	덟	덠	덡	덢	덣	덤	덥	덦	덧	덨	덩	덪	덫	덬	덭	덮	덯	떠	떡	떢	떣	떤	떥	떦	떧	떨	떩	떪	떫	떬	떭	떮	떯	떰	떱	떲	떳	떴	떵	떶	떷	떸	떹	떺	떻	러	럭	럮	럯	런	럱	럲	럳	럴	럵	럶	럷	럸	럹	럺	럻	럼	럽	럾	럿	렀	렁	렂	렃	렄	렅	렆	렇	머	먹	먺	먻	먼	먽	먾	먿	멀	멁	멂	멃	멄	멅	멆	멇	멈	멉	멊	멋	멌	멍	멎	멏	멐	멑	멒	멓	버	벅	벆	벇	번	벉	벊	벋	벌	벍	벎	벏	벐	벑	벒	벓	범	법	벖	벗	벘	벙	벚	벛	벜	벝	벞	벟	뻐	뻑	뻒	뻓	뻔	뻕	뻖	뻗	뻘	뻙	뻚	뻛	뻜	뻝	뻞	뻟	뻠	뻡	뻢	뻣	뻤	뻥	뻦	뻧	뻨	뻩	뻪	뻫	서	석	섞	섟	선	섡	섢	섣	설	섥	섦	섧	섨	섩	섪	섫	섬	섭	섮	섯	섰	성	섲	섳	섴	섵	섶	섷	써	썩	썪	썫	썬	썭	썮	썯	썰	썱	썲	썳	썴	썵	썶	썷	썸	썹	썺	썻	썼	썽	썾	썿	쎀	쎁	쎂	쎃	어	억	얶	얷	언	얹	얺	얻	얼	얽	얾	얿	엀	엁	엂	엃	엄	업	없	엇	었	엉	엊	엋	엌	엍	엎	엏	저	적	젂	젃	전	젅	젆	젇	절	젉	젊	젋	젌	젍	젎	젏	점	접	젒	젓	젔	정	젖	젗	젘	젙	젚	젛	쩌	쩍	쩎	쩏	쩐	쩑	쩒	쩓	쩔	쩕	쩖	쩗	쩘	쩙	쩚	쩛	쩜	쩝	쩞	쩟	쩠	쩡	쩢	쩣	쩤	쩥	쩦	쩧	처	척	첚	첛	천	첝	첞	첟	철	첡	첢	첣	첤	첥	첦	첧	첨	첩	첪	첫	첬	청	첮	첯	첰	첱	첲	첳	커	컥	컦	컧	컨	컩	컪	컫	컬	컭	컮	컯	컰	컱	컲	컳	컴	컵	컶	컷	컸	컹	컺	컻	컼	컽	컾	컿	터	턱	턲	턳	턴	턵	턶	턷	털	턹	턺	턻	턼	턽	턾	턿	텀	텁	텂	텃	텄	텅	텆	텇	텈	텉	텊	텋	퍼	퍽	퍾	퍿	펀	펁	펂	펃	펄	펅	펆	펇	펈	펉	펊	펋	펌	펍	펎	펏	펐	펑	펒	펓	펔	펕	펖	펗	허	헉	헊	헋	헌	헍	헎	헏	헐	헑	헒	헓	헔	헕	헖	헗	험	헙	헚	헛	헜	헝	헞	헟	헠	헡	헢	헣	ￆ
ᅦ	ㅔ	게	겍	겎	겏	겐	겑	겒	겓	겔	겕	겖	겗	겘	겙	겚	겛	겜	겝	겞	겟	겠	겡	겢	겣	겤	겥	겦	겧	께	껙	껚	껛	껜	껝	껞	껟	껠	껡	껢	껣	껤	껥	껦	껧	껨	껩	껪	껫	껬	껭	껮	껯	껰	껱	껲	껳	네	넥	넦	넧	넨	넩	넪	넫	넬	넭	넮	넯	넰	넱	넲	넳	넴	넵	넶	넷	넸	넹	넺	넻	넼	넽	넾	넿	데	덱	덲	덳	덴	덵	덶	덷	델	덹	덺	덻	덼	덽	덾	덿	뎀	뎁	뎂	뎃	뎄	뎅	뎆	뎇	뎈	뎉	뎊	뎋	떼	떽	떾	떿	뗀	뗁	뗂	뗃	뗄	뗅	뗆	뗇	뗈	뗉	뗊	뗋	뗌	뗍	뗎	뗏	뗐	뗑	뗒	뗓	뗔	뗕	뗖	뗗	레	렉	렊	렋	렌	렍	렎	렏	렐	렑	렒	렓	렔	렕	렖	렗	렘	렙	렚	렛	렜	렝	렞	렟	렠	렡	렢	렣	메	멕	멖	멗	멘	멙	멚	멛	멜	멝	멞	멟	멠	멡	멢	멣	멤	멥	멦	멧	멨	멩	멪	멫	멬	멭	멮	멯	베	벡	벢	벣	벤	벥	벦	벧	벨	벩	벪	벫	벬	벭	벮	벯	벰	벱	벲	벳	벴	벵	벶	벷	벸	벹	벺	벻	뻬	뻭	뻮	뻯	뻰	뻱	뻲	뻳	뻴	뻵	뻶	뻷	뻸	뻹	뻺	뻻	뻼	뻽	뻾	뻿	뼀	뼁	뼂	뼃	뼄	뼅	뼆	뼇	세	섹	섺	섻	센	섽	섾	섿	셀	셁	셂	셃	셄	셅	셆	셇	셈	셉	셊	셋	셌	셍	셎	셏	셐	셑	셒	셓	쎄	쎅	쎆	쎇	쎈	쎉	쎊	쎋	쎌	쎍	쎎	쎏	쎐	쎑	쎒	쎓	쎔	쎕	쎖	쎗	쎘	쎙	쎚	쎛	쎜	쎝	쎞	쎟	에	엑	엒	엓	엔	엕	엖	엗	엘	엙	엚	엛	엜	엝	엞	엟	엠	엡	엢	엣	엤	엥	엦	엧	엨	엩	엪	엫	제	젝	젞	젟	젠	젡	젢	젣	젤	젥	젦	젧	젨	젩	젪	젫	젬	젭	젮	젯	젰	젱	젲	젳	젴	젵	젶	젷	쩨	쩩	쩪	쩫	쩬	쩭	쩮	쩯	쩰	쩱	쩲	쩳	쩴	쩵	쩶	쩷	쩸	쩹	쩺	쩻	쩼	쩽	쩾	쩿	쪀	쪁	쪂	쪃	체	첵	첶	첷	첸	첹	첺	첻	첼	첽	첾	첿	쳀	쳁	쳂	쳃	쳄	쳅	쳆	쳇	쳈	쳉	쳊	쳋	쳌	쳍	쳎	쳏	케	켁	켂	켃	켄	켅	켆	켇	켈	켉	켊	켋	켌	켍	켎	켏	켐	켑	켒	켓	켔	켕	켖	켗	켘	켙	켚	켛	테	텍	텎	텏	텐	텑	텒	텓	텔	텕	텖	텗	텘	텙	텚	텛	템	텝	텞	텟	텠	텡	텢	텣	텤	텥	텦	텧	페	펙	펚	펛	펜	펝	펞	펟	펠	펡	펢	펣	펤	펥	펦	펧	펨	펩	펪	펫	펬	펭	펮	펯	펰	펱	펲	펳	헤	헥	헦	헧	헨	헩	헪	헫	헬	헭	헮	헯	헰	헱	헲	헳	헴	헵	헶	헷	헸	헹	헺	헻	헼	헽	헾	헿	ￇ
ᅧ	ㅕ	겨	격	겪	겫	견	겭	겮	겯	결	겱	겲	겳	겴	겵	겶	겷	겸	겹	겺	겻	겼	경	겾	겿	곀	곁	곂	곃	껴	껵	껶	껷	껸	껹	껺	껻	껼	껽	껾	껿	꼀	꼁	꼂	꼃	꼄	꼅	꼆	꼇	꼈	꼉	꼊	꼋	꼌	꼍	꼎	꼏	녀	녁	녂	녃	년	녅	녆	녇	녈	녉	녊	녋	녌	녍	녎	녏	념	녑	녒	녓	녔	녕	녖	녗	녘	녙	녚	녛	뎌	뎍	뎎	뎏	뎐	뎑	뎒	뎓	뎔	뎕	뎖	뎗	뎘	뎙	뎚	뎛	뎜	뎝	뎞	뎟	뎠	뎡	뎢	뎣	뎤	뎥	뎦	뎧	뗘	뗙	뗚	뗛	뗜	뗝	뗞	뗟	뗠	뗡	뗢	뗣	뗤	뗥	뗦	뗧	뗨	뗩	뗪	뗫	뗬	뗭	뗮	뗯	뗰	뗱	뗲	뗳	려	력	렦	렧	련	렩	렪	렫	렬	렭	렮	렯	렰	렱	렲	렳	렴	렵	렶	렷	렸	령	렺	렻	렼	렽	렾	렿	며	멱	멲	멳	면	멵	멶	멷	멸	멹	멺	멻	멼	멽	멾	멿	몀	몁	몂	몃	몄	명	몆	몇	몈	몉	몊	몋	벼	벽	벾	벿	변	볁	볂	볃	별	볅	볆	볇	볈	볉	볊	볋	볌	볍	볎	볏	볐	병	볒	볓	볔	볕	볖	볗	뼈	뼉	뼊	뼋	뼌	뼍	뼎	뼏	뼐	뼑	뼒	뼓	뼔	뼕	뼖	뼗	뼘	뼙	뼚	뼛	뼜	뼝	뼞	뼟	뼠	뼡	뼢	뼣	셔	셕	셖	셗	션	셙	셚	셛	셜	셝	셞	셟	셠	셡	셢	셣	셤	셥	셦	셧	셨	셩	셪	셫	셬	셭	셮	셯	쎠	쎡	쎢	쎣	쎤	쎥	쎦	쎧	쎨	쎩	쎪	쎫	쎬	쎭	쎮	쎯	쎰	쎱	쎲	쎳	쎴	쎵	쎶	쎷	쎸	쎹	쎺	쎻	여	역	엮	엯	연	엱	엲	엳	열	엵	엶	엷	엸	엹	엺	엻	염	엽	엾	엿	였	영	옂	옃	옄	옅	옆	옇	져	젹	젺	젻	젼	젽	젾	젿	졀	졁	졂	졃	졄	졅	졆	졇	졈	졉	졊	졋	졌	졍	졎	졏	졐	졑	졒	졓	쪄	쪅	쪆	쪇	쪈	쪉	쪊	쪋	쪌	쪍	쪎	쪏	쪐	쪑	쪒	쪓	쪔	쪕	쪖	쪗	쪘	쪙	쪚	쪛	쪜	쪝	쪞	쪟	쳐	쳑	쳒	쳓	쳔	쳕	쳖	쳗	쳘	쳙	쳚	쳛	쳜	쳝	쳞	쳟	쳠	쳡	쳢	쳣	쳤	쳥	쳦	쳧	쳨	쳩	쳪	쳫	켜	켝	켞	켟	켠	켡	켢	켣	켤	켥	켦	켧	켨	켩	켪	켫	켬	켭	켮	켯	켰	켱	켲	켳	켴	켵	켶	켷	텨	텩	텪	텫	텬	텭	텮	텯	텰	텱	텲	텳	텴	텵	텶	텷	텸	텹	텺	텻	텼	텽	텾	텿	톀	톁	톂	톃	펴	펵	펶	펷	편	펹	펺	펻	펼	펽	펾	펿	폀	폁	폂	폃	폄	폅	폆	폇	폈	평	폊	폋	폌	폍	폎	폏	혀	혁	혂	혃	현	혅	혆	혇	혈	혉	혊	혋	혌	혍	혎	혏	혐	협	혒	혓	혔	형	혖	혗	혘	혙	혚	혛	ￊ
ᅨ	ㅖ	계	곅	곆	곇	곈	곉	곊	곋	곌	곍	곎	곏	곐	곑	곒	곓	곔	곕	곖	곗	곘	곙	곚	곛	곜	곝	곞	곟	꼐	꼑	꼒	꼓	꼔	꼕	꼖	꼗	꼘	꼙	꼚	꼛	꼜	꼝	꼞	꼟	꼠	꼡	꼢	꼣	꼤	꼥	꼦	꼧	꼨	꼩	꼪	꼫	녜	녝	녞	녟	녠	녡	녢	녣	녤	녥	녦	녧	녨	녩	녪	녫	녬	녭	녮	녯	녰	녱	녲	녳	녴	녵	녶	녷	뎨	뎩	뎪	뎫	뎬	뎭	뎮	뎯	뎰	뎱	뎲	뎳	뎴	뎵	뎶	뎷	뎸	뎹	뎺	뎻	뎼	뎽	뎾	뎿	돀	돁	돂	돃	뗴	뗵	뗶	뗷	뗸	뗹	뗺	뗻	뗼	뗽	뗾	뗿	똀	똁	똂	똃	똄	똅	똆	똇	똈	똉	똊	똋	똌	똍	똎	똏	례	롁	롂	롃	롄	롅	롆	롇	롈	롉	롊	롋	롌	롍	롎	롏	롐	롑	롒	롓	롔	롕	롖	롗	롘	롙	롚	롛	몌	몍	몎	몏	몐	몑	몒	몓	몔	몕	몖	몗	몘	몙	몚	몛	몜	몝	몞	몟	몠	몡	몢	몣	몤	몥	몦	몧	볘	볙	볚	볛	볜	볝	볞	볟	볠	볡	볢	볣	볤	볥	볦	볧	볨	볩	볪	볫	볬	볭	볮	볯	볰	볱	볲	볳	뼤	뼥	뼦	뼧	뼨	뼩	뼪	뼫	뼬	뼭	뼮	뼯	뼰	뼱	뼲	뼳	뼴	뼵	뼶	뼷	뼸	뼹	뼺	뼻	뼼	뼽	뼾	뼿	셰	셱	셲	셳	셴	셵	셶	셷	셸	셹	셺	셻	셼	셽	셾	셿	솀	솁	솂	솃	솄	솅	솆	솇	솈	솉	솊	솋	쎼	쎽	쎾	쎿	쏀	쏁	쏂	쏃	쏄	쏅	쏆	쏇	쏈	쏉	쏊	쏋	쏌	쏍	쏎	쏏	쏐	쏑	쏒	쏓	쏔	쏕	쏖	쏗	예	옉	옊	옋	옌	옍	옎	옏	옐	옑	옒	옓	옔	옕	옖	옗	옘	옙	옚	옛	옜	옝	옞	옟	옠	옡	옢	옣	졔	졕	졖	졗	졘	졙	졚	졛	졜	졝	졞	졟	졠	졡	졢	졣	졤	졥	졦	졧	졨	졩	졪	졫	졬	졭	졮	졯	쪠	쪡	쪢	쪣	쪤	쪥	쪦	쪧	쪨	쪩	쪪	쪫	쪬	쪭	쪮	쪯	쪰	쪱	쪲	쪳	쪴	쪵	쪶	쪷	쪸	쪹	쪺	쪻	쳬	쳭	쳮	쳯	쳰	쳱	쳲	쳳	쳴	쳵	쳶	쳷	쳸	쳹	쳺	쳻	쳼	쳽	쳾	쳿	촀	촁	촂	촃	촄	촅	촆	촇	켸	켹	켺	켻	켼	켽	켾	켿	콀	콁	콂	콃	콄	콅	콆	콇	콈	콉	콊	콋	콌	콍	콎	콏	콐	콑	콒	콓	톄	톅	톆	톇	톈	톉	톊	톋	톌	톍	톎	톏	톐	톑	톒	톓	톔	톕	톖	톗	톘	톙	톚	톛	톜	톝	톞	톟	폐	폑	폒	폓	폔	폕	폖	폗	폘	폙	폚	폛	폜	폝	폞	폟	폠	폡	폢	폣	폤	폥	폦	폧	폨	폩	폪	폫	혜	혝	혞	혟	혠	혡	혢	혣	혤	혥	혦	혧	혨	혩	혪	혫	혬	혭	혮	혯	혰	혱	혲	혳	혴	혵	혶	혷	ￋ
ᅩ	ㅗ	㈝	㈞	㉼	고	곡	곢	곣	곤	곥	곦	곧	골	곩	곪	곫	곬	곭	곮	곯	곰	곱	곲	곳	곴	공	곶	곷	곸	곹	곺	곻	꼬	꼭	꼮	꼯	꼰	꼱	꼲	꼳	꼴	꼵	꼶	꼷	꼸	꼹	꼺	꼻	꼼	꼽	꼾	꼿	꽀	꽁	꽂	꽃	꽄	꽅	꽆	꽇	노	녹	녺	녻	논	녽	녾	녿	놀	놁	놂	놃	놄	놅	놆	놇	놈	놉	놊	놋	놌	농	놎	놏	놐	놑	높	놓	도	독	돆	돇	돈	돉	돊	돋	돌	돍	돎	돏	돐	돑	돒	돓	돔	돕	돖	돗	돘	동	돚	돛	돜	돝	돞	돟	또	똑	똒	똓	똔	똕	똖	똗	똘	똙	똚	똛	똜	똝	똞	똟	똠	똡	똢	똣	똤	똥	똦	똧	똨	똩	똪	똫	로	록	롞	롟	론	롡	롢	롣	롤	롥	롦	롧	롨	롩	롪	롫	롬	롭	롮	롯	롰	롱	롲	롳	롴	롵	롶	롷	모	목	몪	몫	몬	몭	몮	몯	몰	몱	몲	몳	몴	몵	몶	몷	몸	몹	몺	못	몼	몽	몾	몿	뫀	뫁	뫂	뫃	보	복	볶	볷	본	볹	볺	볻	볼	볽	볾	볿	봀	봁	봂	봃	봄	봅	봆	봇	봈	봉	봊	봋	봌	봍	봎	봏	뽀	뽁	뽂	뽃	뽄	뽅	뽆	뽇	뽈	뽉	뽊	뽋	뽌	뽍	뽎	뽏	뽐	뽑	뽒	뽓	뽔	뽕	뽖	뽗	뽘	뽙	뽚	뽛	소	속	솎	솏	손	솑	솒	솓	솔	솕	솖	솗	솘	솙	솚	솛	솜	솝	솞	솟	솠	송	솢	솣	솤	솥	솦	솧	쏘	쏙	쏚	쏛	쏜	쏝	쏞	쏟	쏠	쏡	쏢	쏣	쏤	쏥	쏦	쏧	쏨	쏩	쏪	쏫	쏬	쏭	쏮	쏯	쏰	쏱	쏲	쏳	오	옥	옦	옧	온	옩	옪	옫	올	옭	옮	옯	옰	옱	옲	옳	옴	옵	옶	옷	옸	옹	옺	옻	옼	옽	옾	옿	조	족	졲	졳	존	졵	졶	졷	졸	졹	졺	졻	졼	졽	졾	졿	좀	좁	좂	좃	좄	종	좆	좇	좈	좉	좊	좋	쪼	쪽	쪾	쪿	쫀	쫁	쫂	쫃	쫄	쫅	쫆	쫇	쫈	쫉	쫊	쫋	쫌	쫍	쫎	쫏	쫐	쫑	쫒	쫓	쫔	쫕	쫖	쫗	초	촉	촊	촋	촌	촍	촎	촏	촐	촑	촒	촓	촔	촕	촖	촗	촘	촙	촚	촛	촜	총	촞	촟	촠	촡	촢	촣	코	콕	콖	콗	콘	콙	콚	콛	콜	콝	콞	콟	콠	콡	콢	콣	콤	콥	콦	콧	콨	콩	콪	콫	콬	콭	콮	콯	토	톡	톢	톣	톤	톥	톦	톧	톨	톩	톪	톫	톬	톭	톮	톯	톰	톱	톲	톳	톴	통	톶	톷	톸	톹	톺	톻	포	폭	폮	폯	폰	폱	폲	폳	폴	폵	폶	폷	폸	폹	폺	폻	폼	폽	폾	폿	퐀	퐁	퐂	퐃	퐄	퐅	퐆	퐇	호	혹	혺	혻	혼	혽	혾	혿	홀	홁	홂	홃	홄	홅	홆	홇	홈	홉	홊	홋	홌	홍	홎	홏	홐	홑	홒	홓	ￌ
ᅪ	ㅘ	과	곽	곾	곿	관	괁	괂	괃	괄	괅	괆	괇	괈	괉	괊	괋	괌	괍	괎	괏	괐	광	괒	괓	괔	괕	괖	괗	꽈	꽉	꽊	꽋	꽌	꽍	꽎	꽏	꽐	꽑	꽒	꽓	꽔	꽕	꽖	꽗	꽘	꽙	꽚	꽛	꽜	꽝	꽞	꽟	꽠	꽡	꽢	꽣	놔	놕	놖	놗	놘	놙	놚	놛	놜	놝	놞	놟	놠	놡	놢	놣	놤	놥	놦	놧	놨	놩	놪	놫	놬	놭	놮	놯	돠	돡	돢	돣	돤	돥	돦	돧	돨	돩	돪	돫	돬	돭	돮	돯	돰	돱	돲	돳	돴	돵	돶	돷	돸	돹	돺	돻	똬	똭	똮	똯	똰	똱	똲	똳	똴	똵	똶	똷	똸	똹	똺	똻	똼	똽	똾	똿	뙀	뙁	뙂	뙃	뙄	뙅	뙆	뙇	롸	롹	롺	롻	롼	롽	롾	롿	뢀	뢁	뢂	뢃	뢄	뢅	뢆	뢇	뢈	뢉	뢊	뢋	뢌	뢍	뢎	뢏	뢐	뢑	뢒	뢓	뫄	뫅	뫆	뫇	뫈	뫉	뫊	뫋	뫌	뫍	뫎	뫏	뫐	뫑	뫒	뫓	뫔	뫕	뫖	뫗	뫘	뫙	뫚	뫛	뫜	뫝	뫞	뫟	봐	봑	봒	봓	봔	봕	봖	봗	봘	봙	봚	봛	봜	봝	봞	봟	봠	봡	봢	봣	봤	봥	봦	봧	봨	봩	봪	봫	뽜	뽝	뽞	뽟	뽠	뽡	뽢	뽣	뽤	뽥	뽦	뽧	뽨	뽩	뽪	뽫	뽬	뽭	뽮	뽯	뽰	뽱	뽲	뽳	뽴	뽵	뽶	뽷	솨	솩	솪	솫	솬	솭	솮	솯	솰	솱	솲	솳	솴	솵	솶	솷	솸	솹	솺	솻	솼	솽	솾	솿	쇀	쇁	쇂	쇃	쏴	쏵	쏶	쏷	쏸	쏹	쏺	쏻	쏼	쏽	쏾	쏿	쐀	쐁	쐂	쐃	쐄	쐅	쐆	쐇	쐈	쐉	쐊	쐋	쐌	쐍	쐎	쐏	와	왁	왂	왃	완	왅	왆	왇	왈	왉	왊	왋	왌	왍	왎	왏	왐	왑	왒	왓	왔	왕	왖	왗	왘	왙	왚	왛	좌	좍	좎	좏	좐	좑	좒	좓	좔	좕	좖	좗	좘	좙	좚	좛	좜	좝	좞	좟	좠	좡	좢	좣	좤	좥	좦	좧	쫘	쫙	쫚	쫛	쫜	쫝	쫞	쫟	쫠	쫡	쫢	쫣	쫤	쫥	쫦	쫧	쫨	쫩	쫪	쫫	쫬	쫭	쫮	쫯	쫰	쫱	쫲	쫳	촤	촥	촦	촧	촨	촩	촪	촫	촬	촭	촮	촯	촰	촱	촲	촳	촴	촵	촶	촷	촸	촹	촺	촻	촼	촽	촾	촿	콰	콱	콲	콳	콴	콵	콶	콷	콸	콹	콺	콻	콼	콽	콾	콿	쾀	쾁	쾂	쾃	쾄	쾅	쾆	쾇	쾈	쾉	쾊	쾋	톼	톽	톾	톿	퇀	퇁	퇂	퇃	퇄	퇅	퇆	퇇	퇈	퇉	퇊	퇋	퇌	퇍	퇎	퇏	퇐	퇑	퇒	퇓	퇔	퇕	퇖	퇗	퐈	퐉	퐊	퐋	퐌	퐍	퐎	퐏	퐐	퐑	퐒	퐓	퐔	퐕	퐖	퐗	퐘	퐙	퐚	퐛	퐜	퐝	퐞	퐟	퐠	퐡	퐢	퐣	화	확	홖	홗	환	홙	홚	홛	활	홝	홞	홟	홠	홡	홢	홣	홤	홥	홦	홧	홨	황	홪	홫	홬	홭	홮	홯	ￍ
ᅫ	ㅙ	괘	괙	괚	괛	괜	괝	괞	괟	괠	괡	괢	괣	괤	괥	괦	괧	괨	괩	괪	괫	괬	괭	괮	괯	괰	괱	괲	괳	꽤	꽥	꽦	꽧	꽨	꽩	꽪	꽫	꽬	꽭	꽮	꽯	꽰	꽱	꽲	꽳	꽴	꽵	꽶	꽷	꽸	꽹	꽺	꽻	꽼	꽽	꽾	꽿	놰	놱	놲	놳	놴	놵	놶	놷	놸	놹	놺	놻	놼	놽	놾	놿	뇀	뇁	뇂	뇃	뇄	뇅	뇆	뇇	뇈	뇉	뇊	뇋	돼	돽	돾	돿	됀	됁	됂	됃	됄	됅	됆	됇	됈	됉	됊	됋	됌	됍	됎	됏	됐	됑	됒	됓	됔	됕	됖	됗	뙈	뙉	뙊	뙋	뙌	뙍	뙎	뙏	뙐	뙑	뙒	뙓	뙔	뙕	뙖	뙗	뙘	뙙	뙚	뙛	뙜	뙝	뙞	뙟	뙠	뙡	뙢	뙣	뢔	뢕	뢖	뢗	뢘	뢙	뢚	뢛	뢜	뢝	뢞	뢟	뢠	뢡	뢢	뢣	뢤	뢥	뢦	뢧	뢨	뢩	뢪	뢫	뢬	뢭	뢮	뢯	뫠	뫡	뫢	뫣	뫤	뫥	뫦	뫧	뫨	뫩	뫪	뫫	뫬	뫭	뫮	뫯	뫰	뫱	뫲	뫳	뫴	뫵	뫶	뫷	뫸	뫹	뫺	뫻	봬	봭	봮	봯	봰	봱	봲	봳	봴	봵	봶	봷	봸	봹	봺	봻	봼	봽	봾	봿	뵀	뵁	뵂	뵃	뵄	뵅	뵆	뵇	뽸	뽹	뽺	뽻	뽼	뽽	뽾	뽿	뾀	뾁	뾂	뾃	뾄	뾅	뾆	뾇	뾈	뾉	뾊	뾋	뾌	뾍	뾎	뾏	뾐	뾑	뾒	뾓	쇄	쇅	쇆	쇇	쇈	쇉	쇊	쇋	쇌	쇍	쇎	쇏	쇐	쇑	쇒	쇓	쇔	쇕	쇖	쇗	쇘	쇙	쇚	쇛	쇜	쇝	쇞	쇟	쐐	쐑	쐒	쐓	쐔	쐕	쐖	쐗	쐘	쐙	쐚	쐛	쐜	쐝	쐞	쐟	쐠	쐡	쐢	쐣	쐤	쐥	쐦	쐧	쐨	쐩	쐪	쐫	왜	왝	왞	왟	왠	왡	왢	왣	왤	왥	왦	왧	왨	왩	왪	왫	왬	왭	왮	왯	왰	왱	왲	왳	왴	왵	왶	왷	좨	좩	좪	좫	좬	좭	좮	좯	좰	좱	좲	좳	좴	좵	좶	좷	좸	좹	좺	좻	좼	좽	좾	좿	죀	죁	죂	죃	쫴	쫵	쫶	쫷	쫸	쫹	쫺	쫻	쫼	쫽	쫾	쫿	쬀	쬁	쬂	쬃	쬄	쬅	쬆	쬇	쬈	쬉	쬊	쬋	쬌	쬍	쬎	쬏	쵀	쵁	쵂	쵃	쵄	쵅	쵆	쵇	쵈	쵉	쵊	쵋	쵌	쵍	쵎	쵏	쵐	쵑	쵒	쵓	쵔	쵕	쵖	쵗	쵘	쵙	쵚	쵛	쾌	쾍	쾎	쾏	쾐	쾑	쾒	쾓	쾔	쾕	쾖	쾗	쾘	쾙	쾚	쾛	쾜	쾝	쾞	쾟	쾠	쾡	쾢	쾣	쾤	쾥	쾦	쾧	퇘	퇙	퇚	퇛	퇜	퇝	퇞	퇟	퇠	퇡	퇢	퇣	퇤	퇥	퇦	퇧	퇨	퇩	퇪	퇫	퇬	퇭	퇮	퇯	퇰	퇱	퇲	퇳	퐤	퐥	퐦	퐧	퐨	퐩	퐪	퐫	퐬	퐭	퐮	퐯	퐰	퐱	퐲	퐳	퐴	퐵	퐶	퐷	퐸	퐹	퐺	퐻	퐼	퐽	퐾	퐿	홰	홱	홲	홳	홴	홵	홶	홷	홸	홹	홺	홻	홼	홽	홾	홿	횀	횁	횂	횃	횄	횅	횆	횇	횈	횉	횊	횋	ￎ
ᅬ	ㅚ	괴	괵	괶	괷	괸	괹	괺	괻	괼	괽	괾	괿	굀	굁	굂	굃	굄	굅	굆	굇	굈	굉	굊	굋	굌	굍	굎	굏	꾀	꾁	꾂	꾃	꾄	꾅	꾆	꾇	꾈	꾉	꾊	꾋	꾌	꾍	꾎	꾏	꾐	꾑	꾒	꾓	꾔	꾕	꾖	꾗	꾘	꾙	꾚	꾛	뇌	뇍	뇎	뇏	뇐	뇑	뇒	뇓	뇔	뇕	뇖	뇗	뇘	뇙	뇚	뇛	뇜	뇝	뇞	뇟	뇠	뇡	뇢	뇣	뇤	뇥	뇦	뇧	되	됙	됚	됛	된	됝	됞	됟	될	됡	됢	됣	됤	됥	됦	됧	됨	됩	됪	됫	됬	됭	됮	됯	됰	됱	됲	됳	뙤	뙥	뙦	뙧	뙨	뙩	뙪	뙫	뙬	뙭	뙮	뙯	뙰	뙱	뙲	뙳	뙴	뙵	뙶	뙷	뙸	뙹	뙺	뙻	뙼	뙽	뙾	뙿	뢰	뢱	뢲	뢳	뢴	뢵	뢶	뢷	뢸	뢹	뢺	뢻	뢼	뢽	뢾	뢿	룀	룁	룂	룃	룄	룅	룆	룇	룈	룉	룊	룋	뫼	뫽	뫾	뫿	묀	묁	묂	묃	묄	묅	묆	묇	묈	묉	묊	묋	묌	묍	묎	묏	묐	묑	묒	묓	묔	묕	묖	묗	뵈	뵉	뵊	뵋	뵌	뵍	뵎	뵏	뵐	뵑	뵒	뵓	뵔	뵕	뵖	뵗	뵘	뵙	뵚	뵛	뵜	뵝	뵞	뵟	뵠	뵡	뵢	뵣	뾔	뾕	뾖	뾗	뾘	뾙	뾚	뾛	뾜	뾝	뾞	뾟	뾠	뾡	뾢	뾣	뾤	뾥	뾦	뾧	뾨	뾩	뾪	뾫	뾬	뾭	뾮	뾯	쇠	쇡	쇢	쇣	쇤	쇥	쇦	쇧	쇨	쇩	쇪	쇫	쇬	쇭	쇮	쇯	쇰	쇱	쇲	쇳	쇴	쇵	쇶	쇷	쇸	쇹	쇺	쇻	쐬	쐭	쐮	쐯	쐰	쐱	쐲	쐳	쐴	쐵	쐶	쐷	쐸	쐹	쐺	쐻	쐼	쐽	쐾	쐿	쑀	쑁	쑂	쑃	쑄	쑅	쑆	쑇	외	왹	왺	왻	왼	왽	왾	왿	욀	욁	욂	욃	욄	욅	욆	욇	욈	욉	욊	욋	욌	욍	욎	욏	욐	욑	욒	욓	죄	죅	죆	죇	죈	죉	죊	죋	죌	죍	죎	죏	죐	죑	죒	죓	죔	죕	죖	죗	죘	죙	죚	죛	죜	죝	죞	죟	쬐	쬑	쬒	쬓	쬔	쬕	쬖	쬗	쬘	쬙	쬚	쬛	쬜	쬝	쬞	쬟	쬠	쬡	쬢	쬣	쬤	쬥	쬦	쬧	쬨	쬩	쬪	쬫	최	쵝	쵞	쵟	쵠	쵡	쵢	쵣	쵤	쵥	쵦	쵧	쵨	쵩	쵪	쵫	쵬	쵭	쵮	쵯	쵰	쵱	쵲	쵳	쵴	쵵	쵶	쵷	쾨	쾩	쾪	쾫	쾬	쾭	쾮	쾯	쾰	쾱	쾲	쾳	쾴	쾵	쾶	쾷	쾸	쾹	쾺	쾻	쾼	쾽	쾾	쾿	쿀	쿁	쿂	쿃	퇴	퇵	퇶	퇷	퇸	퇹	퇺	퇻	퇼	퇽	퇾	퇿	툀	툁	툂	툃	툄	툅	툆	툇	툈	툉	툊	툋	툌	툍	툎	툏	푀	푁	푂	푃	푄	푅	푆	푇	푈	푉	푊	푋	푌	푍	푎	푏	푐	푑	푒	푓	푔	푕	푖	푗	푘	푙	푚	푛	회	획	횎	횏	횐	횑	횒	횓	횔	횕	횖	횗	횘	횙	횚	횛	횜	횝	횞	횟	횠	횡	횢	횣	횤	횥	횦	횧	ￏ
ᅭ	ㅛ	교	굑	굒	굓	굔	굕	굖	굗	굘	굙	굚	굛	굜	굝	굞	굟	굠	굡	굢	굣	굤	굥	굦	굧	굨	굩	굪	굫	꾜	꾝	꾞	꾟	꾠	꾡	꾢	꾣	꾤	꾥	꾦	꾧	꾨	꾩	꾪	꾫	꾬	꾭	꾮	꾯	꾰	꾱	꾲	꾳	꾴	꾵	꾶	꾷	뇨	뇩	뇪	뇫	뇬	뇭	뇮	뇯	뇰	뇱	뇲	뇳	뇴	뇵	뇶	뇷	뇸	뇹	뇺	뇻	뇼	뇽	뇾	뇿	눀	눁	눂	눃	됴	됵	됶	됷	됸	됹	됺	됻	됼	됽	됾	됿	둀	둁	둂	둃	둄	둅	둆	둇	둈	둉	둊	둋	둌	둍	둎	둏	뚀	뚁	뚂	뚃	뚄	뚅	뚆	뚇	뚈	뚉	뚊	뚋	뚌	뚍	뚎	뚏	뚐	뚑	뚒	뚓	뚔	뚕	뚖	뚗	뚘	뚙	뚚	뚛	료	룍	룎	룏	룐	룑	룒	룓	룔	룕	룖	룗	룘	룙	룚	룛	룜	룝	룞	룟	룠	룡	룢	룣	룤	룥	룦	룧	묘	묙	묚	묛	묜	묝	묞	묟	묠	묡	묢	묣	묤	묥	묦	묧	묨	묩	묪	묫	묬	묭	묮	묯	묰	묱	묲	묳	뵤	뵥	뵦	뵧	뵨	뵩	뵪	뵫	뵬	뵭	뵮	뵯	뵰	뵱	뵲	뵳	뵴	뵵	뵶	뵷	뵸	뵹	뵺	뵻	뵼	뵽	뵾	뵿	뾰	뾱	뾲	뾳	뾴	뾵	뾶	뾷	뾸	뾹	뾺	뾻	뾼	뾽	뾾	뾿	뿀	뿁	뿂	뿃	뿄	뿅	뿆	뿇	뿈	뿉	뿊	뿋	쇼	쇽	쇾	쇿	숀	숁	숂	숃	숄	숅	숆	숇	숈	숉	숊	숋	숌	숍	숎	숏	숐	숑	숒	숓	숔	숕	숖	숗	쑈	쑉	쑊	쑋	쑌	쑍	쑎	쑏	쑐	쑑	쑒	쑓	쑔	쑕	쑖	쑗	쑘	쑙	쑚	쑛	쑜	쑝	쑞	쑟	쑠	쑡	쑢	쑣	요	욕	욖	욗	욘	욙	욚	욛	욜	욝	욞	욟	욠	욡	욢	욣	욤	욥	욦	욧	욨	용	욪	욫	욬	욭	욮	욯	죠	죡	죢	죣	죤	죥	죦	죧	죨	죩	죪	죫	죬	죭	죮	죯	죰	죱	죲	죳	죴	죵	죶	죷	죸	죹	죺	죻	쬬	쬭	쬮	쬯	쬰	쬱	쬲	쬳	쬴	쬵	쬶	쬷	쬸	쬹	쬺	쬻	쬼	쬽	쬾	쬿	쭀	쭁	쭂	쭃	쭄	쭅	쭆	쭇	쵸	쵹	쵺	쵻	쵼	쵽	쵾	쵿	춀	춁	춂	춃	춄	춅	춆	춇	춈	춉	춊	춋	춌	춍	춎	춏	춐	춑	춒	춓	쿄	쿅	쿆	쿇	쿈	쿉	쿊	쿋	쿌	쿍	쿎	쿏	쿐	쿑	쿒	쿓	쿔	쿕	쿖	쿗	쿘	쿙	쿚	쿛	쿜	쿝	쿞	쿟	툐	툑	툒	툓	툔	툕	툖	툗	툘	툙	툚	툛	툜	툝	툞	툟	툠	툡	툢	툣	툤	툥	툦	툧	툨	툩	툪	툫	표	푝	푞	푟	푠	푡	푢	푣	푤	푥	푦	푧	푨	푩	푪	푫	푬	푭	푮	푯	푰	푱	푲	푳	푴	푵	푶	푷	효	횩	횪	횫	횬	횭	횮	횯	횰	횱	횲	횳	횴	횵	횶	횷	횸	횹	횺	횻	횼	횽	횾	횿	훀	훁	훂	훃	ￒ
ᅮ	ㅜ	㈜	㈞	㉽	㉾	구	국	굮	굯	군	굱	굲	굳	굴	굵	굶	굷	굸	굹	굺	굻	굼	굽	굾	굿	궀	궁	궂	궃	궄	궅	궆	궇	꾸	꾹	꾺	꾻	꾼	꾽	꾾	꾿	꿀	꿁	꿂	꿃	꿄	꿅	꿆	꿇	꿈	꿉	꿊	꿋	꿌	꿍	꿎	꿏	꿐	꿑	꿒	꿓	누	눅	눆	눇	눈	눉	눊	눋	눌	눍	눎	눏	눐	눑	눒	눓	눔	눕	눖	눗	눘	눙	눚	눛	눜	눝	눞	눟	두	둑	둒	둓	둔	둕	둖	둗	둘	둙	둚	둛	둜	둝	둞	둟	둠	둡	둢	둣	둤	둥	둦	둧	둨	둩	둪	둫	뚜	뚝	뚞	뚟	뚠	뚡	뚢	뚣	뚤	뚥	뚦	뚧	뚨	뚩	뚪	뚫	뚬	뚭	뚮	뚯	뚰	뚱	뚲	뚳	뚴	뚵	뚶	뚷	루	룩	룪	룫	룬	룭	룮	룯	룰	룱	룲	룳	룴	룵	룶	룷	룸	룹	룺	룻	룼	룽	룾	룿	뤀	뤁	뤂	뤃	무	묵	묶	묷	문	묹	묺	묻	물	묽	묾	묿	뭀	뭁	뭂	뭃	뭄	뭅	뭆	뭇	뭈	뭉	뭊	뭋	뭌	뭍	뭎	뭏	부	북	붂	붃	분	붅	붆	붇	불	붉	붊	붋	붌	붍	붎	붏	붐	붑	붒	붓	붔	붕	붖	붗	붘	붙	붚	붛	뿌	뿍	뿎	뿏	뿐	뿑	뿒	뿓	뿔	뿕	뿖	뿗	뿘	뿙	뿚	뿛	뿜	뿝	뿞	뿟	뿠	뿡	뿢	뿣	뿤	뿥	뿦	뿧	수	숙	숚	숛	순	숝	숞	숟	술	숡	숢	숣	숤	숥	숦	숧	숨	숩	숪	숫	숬	숭	숮	숯	숰	숱	숲	숳	쑤	쑥	쑦	쑧	쑨	쑩	쑪	쑫	쑬	쑭	쑮	쑯	쑰	쑱	쑲	쑳	쑴	쑵	쑶	쑷	쑸	쑹	쑺	쑻	쑼	쑽	쑾	쑿	우	욱	욲	욳	운	욵	욶	욷	울	욹	욺	욻	욼	욽	욾	욿	움	웁	웂	웃	웄	웅	웆	웇	웈	웉	웊	웋	주	죽	죾	죿	준	줁	줂	줃	줄	줅	줆	줇	줈	줉	줊	줋	줌	줍	줎	줏	줐	중	줒	줓	줔	줕	줖	줗	쭈	쭉	쭊	쭋	쭌	쭍	쭎	쭏	쭐	쭑	쭒	쭓	쭔	쭕	쭖	쭗	쭘	쭙	쭚	쭛	쭜	쭝	쭞	쭟	쭠	쭡	쭢	쭣	추	축	춖	춗	춘	춙	춚	춛	출	춝	춞	춟	춠	춡	춢	춣	춤	춥	춦	춧	춨	충	춪	춫	춬	춭	춮	춯	쿠	쿡	쿢	쿣	쿤	쿥	쿦	쿧	쿨	쿩	쿪	쿫	쿬	쿭	쿮	쿯	쿰	쿱	쿲	쿳	쿴	쿵	쿶	쿷	쿸	쿹	쿺	쿻	투	툭	툮	툯	툰	툱	툲	툳	툴	툵	툶	툷	툸	툹	툺	툻	툼	툽	툾	툿	퉀	퉁	퉂	퉃	퉄	퉅	퉆	퉇	푸	푹	푺	푻	푼	푽	푾	푿	풀	풁	풂	풃	풄	풅	풆	풇	품	풉	풊	풋	풌	풍	풎	풏	풐	풑	풒	풓	후	훅	훆	훇	훈	훉	훊	훋	훌	훍	훎	훏	훐	훑	훒	훓	훔	훕	훖	훗	훘	훙	훚	훛	훜	훝	훞	훟	ￓ
ᅯ	ㅝ	궈	궉	궊	궋	권	궍	궎	궏	궐	궑	궒	궓	궔	궕	궖	궗	궘	궙	궚	궛	궜	궝	궞	궟	궠	궡	궢	궣	꿔	꿕	꿖	꿗	꿘	꿙	꿚	꿛	꿜	꿝	꿞	꿟	꿠	꿡	꿢	꿣	꿤	꿥	꿦	꿧	꿨	꿩	꿪	꿫	꿬	꿭	꿮	꿯	눠	눡	눢	눣	눤	눥	눦	눧	눨	눩	눪	눫	눬	눭	눮	눯	눰	눱	눲	눳	눴	눵	눶	눷	눸	눹	눺	눻	둬	둭	둮	둯	둰	둱	둲	둳	둴	둵	둶	둷	둸	둹	둺	둻	둼	둽	둾	둿	뒀	뒁	뒂	뒃	뒄	뒅	뒆	뒇	뚸	뚹	뚺	뚻	뚼	뚽	뚾	뚿	뛀	뛁	뛂	뛃	뛄	뛅	뛆	뛇	뛈	뛉	뛊	뛋	뛌	뛍	뛎	뛏	뛐	뛑	뛒	뛓	뤄	뤅	뤆	뤇	뤈	뤉	뤊	뤋	뤌	뤍	뤎	뤏	뤐	뤑	뤒	뤓	뤔	뤕	뤖	뤗	뤘	뤙	뤚	뤛	뤜	뤝	뤞	뤟	뭐	뭑	뭒	뭓	뭔	뭕	뭖	뭗	뭘	뭙	뭚	뭛	뭜	뭝	뭞	뭟	뭠	뭡	뭢	뭣	뭤	뭥	뭦	뭧	뭨	뭩	뭪	뭫	붜	붝	붞	붟	붠	붡	붢	붣	붤	붥	붦	붧	붨	붩	붪	붫	붬	붭	붮	붯	붰	붱	붲	붳	붴	붵	붶	붷	뿨	뿩	뿪	뿫	뿬	뿭	뿮	뿯	뿰	뿱	뿲	뿳	뿴	뿵	뿶	뿷	뿸	뿹	뿺	뿻	뿼	뿽	뿾	뿿	쀀	쀁	쀂	쀃	숴	숵	숶	숷	숸	숹	숺	숻	숼	숽	숾	숿	쉀	쉁	쉂	쉃	쉄	쉅	쉆	쉇	쉈	쉉	쉊	쉋	쉌	쉍	쉎	쉏	쒀	쒁	쒂	쒃	쒄	쒅	쒆	쒇	쒈	쒉	쒊	쒋	쒌	쒍	쒎	쒏	쒐	쒑	쒒	쒓	쒔	쒕	쒖	쒗	쒘	쒙	쒚	쒛	워	웍	웎	웏	원	웑	웒	웓	월	웕	웖	웗	웘	웙	웚	웛	웜	웝	웞	웟	웠	웡	웢	웣	웤	웥	웦	웧	줘	줙	줚	줛	줜	줝	줞	줟	줠	줡	줢	줣	줤	줥	줦	줧	줨	줩	줪	줫	줬	줭	줮	줯	줰	줱	줲	줳	쭤	쭥	쭦	쭧	쭨	쭩	쭪	쭫	쭬	쭭	쭮	쭯	쭰	쭱	쭲	쭳	쭴	쭵	쭶	쭷	쭸	쭹	쭺	쭻	쭼	쭽	쭾	쭿	춰	춱	춲	춳	춴	춵	춶	춷	춸	춹	춺	춻	춼	춽	춾	춿	췀	췁	췂	췃	췄	췅	췆	췇	췈	췉	췊	췋	쿼	쿽	쿾	쿿	퀀	퀁	퀂	퀃	퀄	퀅	퀆	퀇	퀈	퀉	퀊	퀋	퀌	퀍	퀎	퀏	퀐	퀑	퀒	퀓	퀔	퀕	퀖	퀗	퉈	퉉	퉊	퉋	퉌	퉍	퉎	퉏	퉐	퉑	퉒	퉓	퉔	퉕	퉖	퉗	퉘	퉙	퉚	퉛	퉜	퉝	퉞	퉟	퉠	퉡	퉢	퉣	풔	풕	풖	풗	풘	풙	풚	풛	풜	풝	풞	풟	풠	풡	풢	풣	풤	풥	풦	풧	풨	풩	풪	풫	풬	풭	풮	풯	훠	훡	훢	훣	훤	훥	훦	훧	훨	훩	훪	훫	훬	훭	훮	훯	훰	훱	훲	훳	훴	훵	훶	훷	훸	훹	훺	훻	ￔ
ᅰ	ㅞ	궤	궥	궦	궧	궨	궩	궪	궫	궬	궭	궮	궯	궰	궱	궲	궳	궴	궵	궶	궷	궸	궹	궺	궻	궼	궽	궾	궿	꿰	꿱	꿲	꿳	꿴	꿵	꿶	꿷	꿸	꿹	꿺	꿻	꿼	꿽	꿾	꿿	뀀	뀁	뀂	뀃	뀄	뀅	뀆	뀇	뀈	뀉	뀊	뀋	눼	눽	눾	눿	뉀	뉁	뉂	뉃	뉄	뉅	뉆	뉇	뉈	뉉	뉊	뉋	뉌	뉍	뉎	뉏	뉐	뉑	뉒	뉓	뉔	뉕	뉖	뉗	뒈	뒉	뒊	뒋	뒌	뒍	뒎	뒏	뒐	뒑	뒒	뒓	뒔	뒕	뒖	뒗	뒘	뒙	뒚	뒛	뒜	뒝	뒞	뒟	뒠	뒡	뒢	뒣	뛔	뛕	뛖	뛗	뛘	뛙	뛚	뛛	뛜	뛝	뛞	뛟	뛠	뛡	뛢	뛣	뛤	뛥	뛦	뛧	뛨	뛩	뛪	뛫	뛬	뛭	뛮	뛯	뤠	뤡	뤢	뤣	뤤	뤥	뤦	뤧	뤨	뤩	뤪	뤫	뤬	뤭	뤮	뤯	뤰	뤱	뤲	뤳	뤴	뤵	뤶	뤷	뤸	뤹	뤺	뤻	뭬	뭭	뭮	뭯	뭰	뭱	뭲	뭳	뭴	뭵	뭶	뭷	뭸	뭹	뭺	뭻	뭼	뭽	뭾	뭿	뮀	뮁	뮂	뮃	뮄	뮅	뮆	뮇	붸	붹	붺	붻	붼	붽	붾	붿	뷀	뷁	뷂	뷃	뷄	뷅	뷆	뷇	뷈	뷉	뷊	뷋	뷌	뷍	뷎	뷏	뷐	뷑	뷒	뷓	쀄	쀅	쀆	쀇	쀈	쀉	쀊	쀋	쀌	쀍	쀎	쀏	쀐	쀑	쀒	쀓	쀔	쀕	쀖	쀗	쀘	쀙	쀚	쀛	쀜	쀝	쀞	쀟	쉐	쉑	쉒	쉓	쉔	쉕	쉖	쉗	쉘	쉙	쉚	쉛	쉜	쉝	쉞	쉟	쉠	쉡	쉢	쉣	쉤	쉥	쉦	쉧	쉨	쉩	쉪	쉫	쒜	쒝	쒞	쒟	쒠	쒡	쒢	쒣	쒤	쒥	쒦	쒧	쒨	쒩	쒪	쒫	쒬	쒭	쒮	쒯	쒰	쒱	쒲	쒳	쒴	쒵	쒶	쒷	웨	웩	웪	웫	웬	웭	웮	웯	웰	웱	웲	웳	웴	웵	웶	웷	웸	웹	웺	웻	웼	웽	웾	웿	윀	윁	윂	윃	줴	줵	줶	줷	줸	줹	줺	줻	줼	줽	줾	줿	쥀	쥁	쥂	쥃	쥄	쥅	쥆	쥇	쥈	쥉	쥊	쥋	쥌	쥍	쥎	쥏	쮀	쮁	쮂	쮃	쮄	쮅	쮆	쮇	쮈	쮉	쮊	쮋	쮌	쮍	쮎	쮏	쮐	쮑	쮒	쮓	쮔	쮕	쮖	쮗	쮘	쮙	쮚	쮛	췌	췍	췎	췏	췐	췑	췒	췓	췔	췕	췖	췗	췘	췙	췚	췛	췜	췝	췞	췟	췠	췡	췢	췣	췤	췥	췦	췧	퀘	퀙	퀚	퀛	퀜	퀝	퀞	퀟	퀠	퀡	퀢	퀣	퀤	퀥	퀦	퀧	퀨	퀩	퀪	퀫	퀬	퀭	퀮	퀯	퀰	퀱	퀲	퀳	퉤	퉥	퉦	퉧	퉨	퉩	퉪	퉫	퉬	퉭	퉮	퉯	퉰	퉱	퉲	퉳	퉴	퉵	퉶	퉷	퉸	퉹	퉺	퉻	퉼	퉽	퉾	퉿	풰	풱	풲	풳	풴	풵	풶	풷	풸	풹	풺	풻	풼	풽	풾	풿	퓀	퓁	퓂	퓃	퓄	퓅	퓆	퓇	퓈	퓉	퓊	퓋	훼	훽	훾	훿	휀	휁	휂	휃	휄	휅	휆	휇	휈	휉	휊	휋	휌	휍	휎	휏	휐	휑	휒	휓	휔	휕	휖	휗	ￕ
ᅱ	ㅟ	귀	귁	귂	귃	귄	귅	귆	귇	귈	귉	귊	귋	귌	귍	귎	귏	귐	귑	귒	귓	귔	귕	귖	귗	귘	귙	귚	귛	뀌	뀍	뀎	뀏	뀐	뀑	뀒	뀓	뀔	뀕	뀖	뀗	뀘	뀙	뀚	뀛	뀜	뀝	뀞	뀟	뀠	뀡	뀢	뀣	뀤	뀥	뀦	뀧	뉘	뉙	뉚	뉛	뉜	뉝	뉞	뉟	뉠	뉡	뉢	뉣	뉤	뉥	뉦	뉧	뉨	뉩	뉪	뉫	뉬	뉭	뉮	뉯	뉰	뉱	뉲	뉳	뒤	뒥	뒦	뒧	뒨	뒩	뒪	뒫	뒬	뒭	뒮	뒯	뒰	뒱	뒲	뒳	뒴	뒵	뒶	뒷	뒸	뒹	뒺	뒻	뒼	뒽	뒾	뒿	뛰	뛱	뛲	뛳	뛴	뛵	뛶	뛷	뛸	뛹	뛺	뛻	뛼	뛽	뛾	뛿	뜀	뜁	뜂	뜃	뜄	뜅	뜆	뜇	뜈	뜉	뜊	뜋	뤼	뤽	뤾	뤿	륀	륁	륂	륃	륄	륅	륆	륇	륈	륉	륊	륋	륌	륍	륎	륏	륐	륑	륒	륓	륔	륕	륖	륗	뮈	뮉	뮊	뮋	뮌	뮍	뮎	뮏	뮐	뮑	뮒	뮓	뮔	뮕	뮖	뮗	뮘	뮙	뮚	뮛	뮜	뮝	뮞	뮟	뮠	뮡	뮢	뮣	뷔	뷕	뷖	뷗	뷘	뷙	뷚	뷛	뷜	뷝	뷞	뷟	뷠	뷡	뷢	뷣	뷤	뷥	뷦	뷧	뷨	뷩	뷪	뷫	뷬	뷭	뷮	뷯	쀠	쀡	쀢	쀣	쀤	쀥	쀦	쀧	쀨	쀩	쀪	쀫	쀬	쀭	쀮	쀯	쀰	쀱	쀲	쀳	쀴	쀵	쀶	쀷	쀸	쀹	쀺	쀻	쉬	쉭	쉮	쉯	쉰	쉱	쉲	쉳	쉴	쉵	쉶	쉷	쉸	쉹	쉺	쉻	쉼	쉽	쉾	쉿	슀	슁	슂	슃	슄	슅	슆	슇	쒸	쒹	쒺	쒻	쒼	쒽	쒾	쒿	쓀	쓁	쓂	쓃	쓄	쓅	쓆	쓇	쓈	쓉	쓊	쓋	쓌	쓍	쓎	쓏	쓐	쓑	쓒	쓓	위	윅	윆	윇	윈	윉	윊	윋	윌	윍	윎	윏	윐	윑	윒	윓	윔	윕	윖	윗	윘	윙	윚	윛	윜	윝	윞	윟	쥐	쥑	쥒	쥓	쥔	쥕	쥖	쥗	쥘	쥙	쥚	쥛	쥜	쥝	쥞	쥟	쥠	쥡	쥢	쥣	쥤	쥥	쥦	쥧	쥨	쥩	쥪	쥫	쮜	쮝	쮞	쮟	쮠	쮡	쮢	쮣	쮤	쮥	쮦	쮧	쮨	쮩	쮪	쮫	쮬	쮭	쮮	쮯	쮰	쮱	쮲	쮳	쮴	쮵	쮶	쮷	취	췩	췪	췫	췬	췭	췮	췯	췰	췱	췲	췳	췴	췵	췶	췷	췸	췹	췺	췻	췼	췽	췾	췿	츀	츁	츂	츃	퀴	퀵	퀶	퀷	퀸	퀹	퀺	퀻	퀼	퀽	퀾	퀿	큀	큁	큂	큃	큄	큅	큆	큇	큈	큉	큊	큋	큌	큍	큎	큏	튀	튁	튂	튃	튄	튅	튆	튇	튈	튉	튊	튋	튌	튍	튎	튏	튐	튑	튒	튓	튔	튕	튖	튗	튘	튙	튚	튛	퓌	퓍	퓎	퓏	퓐	퓑	퓒	퓓	퓔	퓕	퓖	퓗	퓘	퓙	퓚	퓛	퓜	퓝	퓞	퓟	퓠	퓡	퓢	퓣	퓤	퓥	퓦	퓧	휘	휙	휚	휛	휜	휝	휞	휟	휠	휡	휢	휣	휤	휥	휦	휧	휨	휩	휪	휫	휬	휭	휮	휯	휰	휱	휲	휳	ￖ
ᅲ	ㅠ	규	귝	귞	귟	균	귡	귢	귣	귤	귥	귦	귧	귨	귩	귪	귫	귬	귭	귮	귯	귰	귱	귲	귳	귴	귵	귶	귷	뀨	뀩	뀪	뀫	뀬	뀭	뀮	뀯	뀰	뀱	뀲	뀳	뀴	뀵	뀶	뀷	뀸	뀹	뀺	뀻	뀼	뀽	뀾	뀿	끀	끁	끂	끃	뉴	뉵	뉶	뉷	뉸	뉹	뉺	뉻	뉼	뉽	뉾	뉿	늀	늁	늂	늃	늄	늅	늆	늇	늈	늉	늊	늋	늌	늍	늎	늏	듀	듁	듂	듃	듄	듅	듆	듇	듈	듉	듊	듋	듌	듍	듎	듏	듐	듑	듒	듓	듔	듕	듖	듗	듘	듙	듚	듛	뜌	뜍	뜎	뜏	뜐	뜑	뜒	뜓	뜔	뜕	뜖	뜗	뜘	뜙	뜚	뜛	뜜	뜝	뜞	뜟	뜠	뜡	뜢	뜣	뜤	뜥	뜦	뜧	류	륙	륚	륛	륜	륝	륞	륟	률	륡	륢	륣	륤	륥	륦	륧	륨	륩	륪	륫	륬	륭	륮	륯	륰	륱	륲	륳	뮤	뮥	뮦	뮧	뮨	뮩	뮪	뮫	뮬	뮭	뮮	뮯	뮰	뮱	뮲	뮳	뮴	뮵	뮶	뮷	뮸	뮹	뮺	뮻	뮼	뮽	뮾	뮿	뷰	뷱	뷲	뷳	뷴	뷵	뷶	뷷	뷸	뷹	뷺	뷻	뷼	뷽	뷾	뷿	븀	븁	븂	븃	븄	븅	븆	븇	븈	븉	븊	븋	쀼	쀽	쀾	쀿	쁀	쁁	쁂	쁃	쁄	쁅	쁆	쁇	쁈	쁉	쁊	쁋	쁌	쁍	쁎	쁏	쁐	쁑	쁒	쁓	쁔	쁕	쁖	쁗	슈	슉	슊	슋	슌	슍	슎	슏	슐	슑	슒	슓	슔	슕	슖	슗	슘	슙	슚	슛	슜	슝	슞	슟	슠	슡	슢	슣	쓔	쓕	쓖	쓗	쓘	쓙	쓚	쓛	쓜	쓝	쓞	쓟	쓠	쓡	쓢	쓣	쓤	쓥	쓦	쓧	쓨	쓩	쓪	쓫	쓬	쓭	쓮	쓯	유	육	윢	윣	윤	윥	윦	윧	율	윩	윪	윫	윬	윭	윮	윯	윰	윱	윲	윳	윴	융	윶	윷	윸	윹	윺	윻	쥬	쥭	쥮	쥯	쥰	쥱	쥲	쥳	쥴	쥵	쥶	쥷	쥸	쥹	쥺	쥻	쥼	쥽	쥾	쥿	즀	즁	즂	즃	즄	즅	즆	즇	쮸	쮹	쮺	쮻	쮼	쮽	쮾	쮿	쯀	쯁	쯂	쯃	쯄	쯅	쯆	쯇	쯈	쯉	쯊	쯋	쯌	쯍	쯎	쯏	쯐	쯑	쯒	쯓	츄	츅	츆	츇	츈	츉	츊	츋	츌	츍	츎	츏	츐	츑	츒	츓	츔	츕	츖	츗	츘	츙	츚	츛	츜	츝	츞	츟	큐	큑	큒	큓	큔	큕	큖	큗	큘	큙	큚	큛	큜	큝	큞	큟	큠	큡	큢	큣	큤	큥	큦	큧	큨	큩	큪	큫	튜	튝	튞	튟	튠	튡	튢	튣	튤	튥	튦	튧	튨	튩	튪	튫	튬	튭	튮	튯	튰	튱	튲	튳	튴	튵	튶	튷	퓨	퓩	퓪	퓫	퓬	퓭	퓮	퓯	퓰	퓱	퓲	퓳	퓴	퓵	퓶	퓷	퓸	퓹	퓺	퓻	퓼	퓽	퓾	퓿	픀	픁	픂	픃	휴	휵	휶	휷	휸	휹	휺	휻	휼	휽	휾	휿	흀	흁	흂	흃	흄	흅	흆	흇	흈	흉	흊	흋	흌	흍	흎	흏	ￗ
ᅳ	ㅡ	그	극	귺	귻	근	귽	귾	귿	글	긁	긂	긃	긄	긅	긆	긇	금	급	긊	긋	긌	긍	긎	긏	긐	긑	긒	긓	끄	끅	끆	끇	끈	끉	끊	끋	끌	끍	끎	끏	끐	끑	끒	끓	끔	끕	끖	끗	끘	끙	끚	끛	끜	끝	끞	끟	느	늑	늒	늓	는	늕	늖	늗	늘	늙	늚	늛	늜	늝	늞	늟	늠	늡	늢	늣	늤	능	늦	늧	늨	늩	늪	늫	드	득	듞	듟	든	듡	듢	듣	들	듥	듦	듧	듨	듩	듪	듫	듬	듭	듮	듯	듰	등	듲	듳	듴	듵	듶	듷	뜨	뜩	뜪	뜫	뜬	뜭	뜮	뜯	뜰	뜱	뜲	뜳	뜴	뜵	뜶	뜷	뜸	뜹	뜺	뜻	뜼	뜽	뜾	뜿	띀	띁	띂	띃	르	륵	륶	륷	른	륹	륺	륻	를	륽	륾	륿	릀	릁	릂	릃	름	릅	릆	릇	릈	릉	릊	릋	릌	릍	릎	릏	므	믁	믂	믃	믄	믅	믆	믇	믈	믉	믊	믋	믌	믍	믎	믏	믐	믑	믒	믓	믔	믕	믖	믗	믘	믙	믚	믛	브	븍	븎	븏	븐	븑	븒	븓	블	븕	븖	븗	븘	븙	븚	븛	븜	븝	븞	븟	븠	븡	븢	븣	븤	븥	븦	븧	쁘	쁙	쁚	쁛	쁜	쁝	쁞	쁟	쁠	쁡	쁢	쁣	쁤	쁥	쁦	쁧	쁨	쁩	쁪	쁫	쁬	쁭	쁮	쁯	쁰	쁱	쁲	쁳	스	슥	슦	슧	슨	슩	슪	슫	슬	슭	슮	슯	슰	슱	슲	슳	슴	습	슶	슷	슸	승	슺	슻	슼	슽	슾	슿	쓰	쓱	쓲	쓳	쓴	쓵	쓶	쓷	쓸	쓹	쓺	쓻	쓼	쓽	쓾	쓿	씀	씁	씂	씃	씄	씅	씆	씇	씈	씉	씊	씋	으	윽	윾	윿	은	읁	읂	읃	을	읅	읆	읇	읈	읉	읊	읋	음	읍	읎	읏	읐	응	읒	읓	읔	읕	읖	읗	즈	즉	즊	즋	즌	즍	즎	즏	즐	즑	즒	즓	즔	즕	즖	즗	즘	즙	즚	즛	즜	증	즞	즟	즠	즡	즢	즣	쯔	쯕	쯖	쯗	쯘	쯙	쯚	쯛	쯜	쯝	쯞	쯟	쯠	쯡	쯢	쯣	쯤	쯥	쯦	쯧	쯨	쯩	쯪	쯫	쯬	쯭	쯮	쯯	츠	측	츢	츣	츤	츥	츦	츧	츨	츩	츪	츫	츬	츭	츮	츯	츰	츱	츲	츳	츴	층	츶	츷	츸	츹	츺	츻	크	큭	큮	큯	큰	큱	큲	큳	클	큵	큶	큷	큸	큹	큺	큻	큼	큽	큾	큿	킀	킁	킂	킃	킄	킅	킆	킇	트	특	튺	튻	튼	튽	튾	튿	틀	틁	틂	틃	틄	틅	틆	틇	틈	틉	틊	틋	틌	틍	틎	틏	틐	틑	틒	틓	프	픅	픆	픇	픈	픉	픊	픋	플	픍	픎	픏	픐	픑	픒	픓	픔	픕	픖	픗	픘	픙	픚	픛	픜	픝	픞	픟	흐	흑	흒	흓	흔	흕	흖	흗	흘	흙	흚	흛	흜	흝	흞	흟	흠	흡	흢	흣	흤	흥	흦	흧	흨	흩	흪	흫	ￚ
ᅴ	ㅢ	㉽	긔	긕	긖	긗	긘	긙	긚	긛	긜	긝	긞	긟	긠	긡	긢	긣	긤	긥	긦	긧	긨	긩	긪	긫	긬	긭	긮	긯	끠	끡	끢	끣	끤	끥	끦	끧	끨	끩	끪	끫	끬	끭	끮	끯	끰	끱	끲	끳	끴	끵	끶	끷	끸	끹	끺	끻	늬	늭	늮	늯	늰	늱	늲	늳	늴	늵	늶	늷	늸	늹	늺	늻	늼	늽	늾	늿	닀	닁	닂	닃	닄	닅	닆	닇	듸	듹	듺	듻	듼	듽	듾	듿	딀	딁	딂	딃	딄	딅	딆	딇	딈	딉	딊	딋	딌	딍	딎	딏	딐	딑	딒	딓	띄	띅	띆	띇	띈	띉	띊	띋	띌	띍	띎	띏	띐	띑	띒	띓	띔	띕	띖	띗	띘	띙	띚	띛	띜	띝	띞	띟	릐	릑	릒	릓	릔	릕	릖	릗	릘	릙	릚	릛	릜	릝	릞	릟	릠	릡	릢	릣	릤	릥	릦	릧	릨	릩	릪	릫	믜	믝	믞	믟	믠	믡	믢	믣	믤	믥	믦	믧	믨	믩	믪	믫	믬	믭	믮	믯	믰	믱	믲	믳	믴	믵	믶	믷	븨	븩	븪	븫	븬	븭	븮	븯	븰	븱	븲	븳	븴	븵	븶	븷	븸	븹	븺	븻	븼	븽	븾	븿	빀	빁	빂	빃	쁴	쁵	쁶	쁷	쁸	쁹	쁺	쁻	쁼	쁽	쁾	쁿	삀	삁	삂	삃	삄	삅	삆	삇	삈	삉	삊	삋	삌	삍	삎	삏	싀	싁	싂	싃	싄	싅	싆	싇	싈	싉	싊	싋	싌	싍	싎	싏	싐	싑	싒	싓	싔	싕	싖	싗	싘	싙	싚	싛	씌	씍	씎	씏	씐	씑	씒	씓	씔	씕	씖	씗	씘	씙	씚	씛	씜	씝	씞	씟	씠	씡	씢	씣	씤	씥	씦	씧	의	읙	읚	읛	읜	읝	읞	읟	읠	읡	읢	읣	읤	읥	읦	읧	읨	읩	읪	읫	읬	읭	읮	읯	읰	읱	읲	읳	즤	즥	즦	즧	즨	즩	즪	즫	즬	즭	즮	즯	즰	즱	즲	즳	즴	즵	즶	즷	즸	즹	즺	즻	즼	즽	즾	즿	쯰	쯱	쯲	쯳	쯴	쯵	쯶	쯷	쯸	쯹	쯺	쯻	쯼	쯽	쯾	쯿	찀	찁	찂	찃	찄	찅	찆	찇	찈	찉	찊	찋	츼	츽	츾	츿	칀	칁	칂	칃	칄	칅	칆	칇	칈	칉	칊	칋	칌	칍	칎	칏	칐	칑	칒	칓	칔	칕	칖	칗	킈	킉	킊	킋	킌	킍	킎	킏	킐	킑	킒	킓	킔	킕	킖	킗	킘	킙	킚	킛	킜	킝	킞	킟	킠	킡	킢	킣	틔	틕	틖	틗	틘	틙	틚	틛	틜	틝	틞	틟	틠	틡	틢	틣	틤	틥	틦	틧	틨	틩	틪	틫	틬	틭	틮	틯	픠	픡	픢	픣	픤	픥	픦	픧	픨	픩	픪	픫	픬	픭	픮	픯	픰	픱	픲	픳	픴	픵	픶	픷	픸	픹	픺	픻	희	흭	흮	흯	흰	흱	흲	흳	흴	흵	흶	흷	흸	흹	흺	흻	흼	흽	흾	흿	힀	힁	힂	힃	힄	힅	힆	힇	ￛ
ᅵ	ㅣ	기	긱	긲	긳	긴	긵	긶	긷	길	긹	긺	긻	긼	긽	긾	긿	김	깁	깂	깃	깄	깅	깆	깇	깈	깉	깊	깋	끼	끽	끾	끿	낀	낁	낂	낃	낄	낅	낆	낇	낈	낉	낊	낋	낌	낍	낎	낏	낐	낑	낒	낓	낔	낕	낖	낗	니	닉	닊	닋	닌	닍	닎	닏	닐	닑	닒	닓	닔	닕	닖	닗	님	닙	닚	닛	닜	닝	닞	닟	닠	닡	닢	닣	디	딕	딖	딗	딘	딙	딚	딛	딜	딝	딞	딟	딠	딡	딢	딣	딤	딥	딦	딧	딨	딩	딪	딫	딬	딭	딮	딯	띠	띡	띢	띣	띤	띥	띦	띧	띨	띩	띪	띫	띬	띭	띮	띯	띰	띱	띲	띳	띴	띵	띶	띷	띸	띹	띺	띻	리	릭	릮	릯	린	릱	릲	릳	릴	릵	릶	릷	릸	릹	릺	릻	림	립	릾	릿	맀	링	맂	맃	맄	맅	맆	맇	미	믹	믺	믻	민	믽	믾	믿	밀	밁	밂	밃	밄	밅	밆	밇	밈	밉	밊	밋	밌	밍	밎	및	밐	밑	밒	밓	비	빅	빆	빇	빈	빉	빊	빋	빌	빍	빎	빏	빐	빑	빒	빓	빔	빕	빖	빗	빘	빙	빚	빛	빜	빝	빞	빟	삐	삑	삒	삓	삔	삕	삖	삗	삘	삙	삚	삛	삜	삝	삞	삟	삠	삡	삢	삣	삤	삥	삦	삧	삨	삩	삪	삫	시	식	싞	싟	신	싡	싢	싣	실	싥	싦	싧	싨	싩	싪	싫	심	십	싮	싯	싰	싱	싲	싳	싴	싵	싶	싷	씨	씩	씪	씫	씬	씭	씮	씯	씰	씱	씲	씳	씴	씵	씶	씷	씸	씹	씺	씻	씼	씽	씾	씿	앀	앁	앂	앃	이	익	읶	읷	인	읹	읺	읻	일	읽	읾	읿	잀	잁	잂	잃	임	입	잆	잇	있	잉	잊	잋	잌	잍	잎	잏	지	직	짂	짃	진	짅	짆	짇	질	짉	짊	짋	짌	짍	짎	짏	짐	집	짒	짓	짔	징	짖	짗	짘	짙	짚	짛	찌	찍	찎	찏	찐	찑	찒	찓	찔	찕	찖	찗	찘	찙	찚	찛	찜	찝	찞	찟	찠	찡	찢	찣	찤	찥	찦	찧	치	칙	칚	칛	친	칝	칞	칟	칠	칡	칢	칣	칤	칥	칦	칧	침	칩	칪	칫	칬	칭	칮	칯	칰	칱	칲	칳	키	킥	킦	킧	킨	킩	킪	킫	킬	킭	킮	킯	킰	킱	킲	킳	킴	킵	킶	킷	킸	킹	킺	킻	킼	킽	킾	킿	티	틱	틲	틳	틴	틵	틶	틷	틸	틹	틺	틻	틼	틽	틾	틿	팀	팁	팂	팃	팄	팅	팆	팇	팈	팉	팊	팋	피	픽	픾	픿	핀	핁	핂	핃	필	핅	핆	핇	핈	핉	핊	핋	핌	핍	핎	핏	핐	핑	핒	핓	핔	핕	핖	핗	히	힉	힊	힋	힌	힍	힎	힏	힐	힑	힒	힓	힔	힕	힖	힗	힘	힙	힚	힛	힜	힝	힞	힟	힠	힡	힢	힣	ￜ
ᆄ	ㆇ
ᆅ	ㆈ
ᆈ	ㆉ
ᆑ	ㆊ
ᆒ	ㆋ
ᆔ	ㆌ
ᆞ	ㆍ
ᆡ	ㆎ
ᆨ	각	객	갹	걕	걱	겍	격	곅	곡	곽	괙	괵	굑	국	궉	궥	귁	귝	극	긕	긱	깍	깩	꺅	꺡	꺽	껙	껵	꼑	꼭	꽉	꽥	꾁	꾝	꾹	꿕	꿱	뀍	뀩	끅	끡	끽	낙	낵	냑	냭	넉	넥	녁	녝	녹	놕	놱	뇍	뇩	눅	눡	눽	뉙	뉵	늑	늭	닉	닥	댁	댝	댹	덕	덱	뎍	뎩	독	돡	돽	됙	됵	둑	둭	뒉	뒥	듁	득	듹	딕	딱	땍	땩	떅	떡	떽	뗙	뗵	똑	똭	뙉	뙥	뚁	뚝	뚹	뛕	뛱	뜍	뜩	띅	띡	락	랙	략	럑	럭	렉	력	롁	록	롹	뢕	뢱	룍	룩	뤅	뤡	뤽	륙	륵	릑	릭	막	맥	먁	먝	먹	멕	멱	몍	목	뫅	뫡	뫽	묙	묵	뭑	뭭	뮉	뮥	믁	믝	믹	박	백	뱍	뱩	벅	벡	벽	볙	복	봑	봭	뵉	뵥	북	붝	붹	뷕	뷱	븍	븩	빅	빡	빽	뺙	뺵	뻑	뻭	뼉	뼥	뽁	뽝	뽹	뾕	뾱	뿍	뿩	쀅	쀡	쀽	쁙	쁵	삑	삭	색	샥	섁	석	섹	셕	셱	속	솩	쇅	쇡	쇽	숙	숵	쉑	쉭	슉	슥	싁	식	싹	쌕	쌱	썍	썩	쎅	쎡	쎽	쏙	쏵	쐑	쐭	쑉	쑥	쒁	쒝	쒹	쓕	쓱	씍	씩	악	액	약	얙	억	엑	역	옉	옥	왁	왝	왹	욕	욱	웍	웩	윅	육	윽	읙	익	작	잭	쟉	쟥	적	젝	젹	졕	족	좍	좩	죅	죡	죽	줙	줵	쥑	쥭	즉	즥	직	짝	짹	쨕	쨱	쩍	쩩	쪅	쪡	쪽	쫙	쫵	쬑	쬭	쭉	쭥	쮁	쮝	쮹	쯕	쯱	찍	착	책	챡	챽	척	첵	쳑	쳭	촉	촥	쵁	쵝	쵹	축	춱	췍	췩	츅	측	츽	칙	칵	캑	캭	컉	컥	켁	켝	켹	콕	콱	쾍	쾩	쿅	쿡	쿽	퀙	퀵	큑	큭	킉	킥	탁	택	탹	턕	턱	텍	텩	톅	톡	톽	퇙	퇵	툑	툭	퉉	퉥	튁	튝	특	틕	틱	팍	팩	퍅	퍡	퍽	펙	펵	폑	폭	퐉	퐥	푁	푝	푹	풕	풱	퓍	퓩	픅	픡	픽	학	핵	햑	햭	헉	헥	혁	혝	혹	확	홱	획	횩	훅	훡	훽	휙	휵	흑	흭	힉
ᆩ	갂	갞	갺	걖	걲	겎	겪	곆	곢	곾	괚	괶	굒	굮	궊	궦	귂	귞	귺	긖	긲	깎	깪	꺆	꺢	꺾	껚	껶	꼒	꼮	꽊	꽦	꾂	꾞	꾺	꿖	꿲	뀎	뀪	끆	끢	끾	낚	낶	냒	냮	넊	넦	녂	녞	녺	놖	놲	뇎	뇪	눆	눢	눾	뉚	뉶	늒	늮	닊	닦	댂	댞	댺	덖	덲	뎎	뎪	돆	돢	돾	됚	됶	둒	둮	뒊	뒦	듂	듞	듺	딖	딲	땎	땪	떆	떢	떾	뗚	뗶	똒	똮	뙊	뙦	뚂	뚞	뚺	뛖	뛲	뜎	뜪	띆	띢	띾	랚	랶	럒	럮	렊	렦	롂	롞	롺	뢖	뢲	룎	룪	뤆	뤢	뤾	륚	륶	릒	릮	맊	맦	먂	먞	먺	멖	멲	몎	몪	뫆	뫢	뫾	묚	묶	뭒	뭮	뮊	뮦	믂	믞	믺	밖	밲	뱎	뱪	벆	벢	벾	볚	볶	봒	봮	뵊	뵦	붂	붞	붺	뷖	뷲	븎	븪	빆	빢	빾	뺚	뺶	뻒	뻮	뼊	뼦	뽂	뽞	뽺	뾖	뾲	뿎	뿪	쀆	쀢	쀾	쁚	쁶	삒	삮	샊	샦	섂	섞	섺	셖	셲	솎	솪	쇆	쇢	쇾	숚	숶	쉒	쉮	슊	슦	싂	싞	싺	쌖	쌲	썎	썪	쎆	쎢	쎾	쏚	쏶	쐒	쐮	쑊	쑦	쒂	쒞	쒺	쓖	쓲	씎	씪	앆	앢	앾	얚	얶	엒	엮	옊	옦	왂	왞	왺	욖	욲	웎	웪	윆	윢	윾	읚	읶	잒	잮	쟊	쟦	젂	젞	젺	졖	졲	좎	좪	죆	죢	죾	줚	줶	쥒	쥮	즊	즦	짂	짞	짺	쨖	쨲	쩎	쩪	쪆	쪢	쪾	쫚	쫶	쬒	쬮	쭊	쭦	쮂	쮞	쮺	쯖	쯲	찎	찪	챆	챢	챾	첚	첶	쳒	쳮	촊	촦	쵂	쵞	쵺	춖	춲	췎	췪	츆	츢	츾	칚	칶	캒	캮	컊	컦	켂	켞	켺	콖	콲	쾎	쾪	쿆	쿢	쿾	퀚	퀶	큒	큮	킊	킦	탂	탞	탺	턖	턲	텎	텪	톆	톢	톾	퇚	퇶	툒	툮	퉊	퉦	튂	튞	튺	틖	틲	팎	팪	퍆	퍢	퍾	펚	펶	폒	폮	퐊	퐦	푂	푞	푺	풖	풲	퓎	퓪	픆	픢	픾	핚	핶	햒	햮	헊	헦	혂	혞	혺	홖	홲	횎	횪	훆	훢	훾	휚	휶	흒	흮	힊
ᆪ	ㄳ	갃	갟	갻	걗	걳	겏	겫	곇	곣	곿	괛	괷	굓	굯	궋	궧	귃	귟	귻	긗	긳	깏	깫	꺇	꺣	꺿	껛	껷	꼓	꼯	꽋	꽧	꾃	꾟	꾻	꿗	꿳	뀏	뀫	끇	끣	끿	낛	낷	냓	냯	넋	넧	녃	녟	녻	놗	놳	뇏	뇫	눇	눣	눿	뉛	뉷	늓	늯	닋	닧	댃	댟	댻	덗	덳	뎏	뎫	돇	돣	돿	됛	됷	둓	둯	뒋	뒧	듃	듟	듻	딗	딳	땏	땫	떇	떣	떿	뗛	뗷	똓	똯	뙋	뙧	뚃	뚟	뚻	뛗	뛳	뜏	뜫	띇	띣	띿	랛	랷	럓	럯	렋	렧	롃	롟	롻	뢗	뢳	룏	룫	뤇	뤣	뤿	륛	륷	릓	릯	맋	맧	먃	먟	먻	멗	멳	몏	몫	뫇	뫣	뫿	묛	묷	뭓	뭯	뮋	뮧	믃	믟	믻	밗	밳	뱏	뱫	벇	벣	벿	볛	볷	봓	봯	뵋	뵧	붃	붟	붻	뷗	뷳	븏	븫	빇	빣	빿	뺛	뺷	뻓	뻯	뼋	뼧	뽃	뽟	뽻	뾗	뾳	뿏	뿫	쀇	쀣	쀿	쁛	쁷	삓	삯	샋	샧	섃	섟	섻	셗	셳	솏	솫	쇇	쇣	쇿	숛	숷	쉓	쉯	슋	슧	싃	싟	싻	쌗	쌳	썏	썫	쎇	쎣	쎿	쏛	쏷	쐓	쐯	쑋	쑧	쒃	쒟	쒻	쓗	쓳	씏	씫	앇	앣	앿	얛	얷	엓	엯	옋	옧	왃	왟	왻	욗	욳	웏	웫	윇	윣	윿	읛	읷	잓	잯	쟋	쟧	젃	젟	젻	졗	졳	좏	좫	죇	죣	죿	줛	줷	쥓	쥯	즋	즧	짃	짟	짻	쨗	쨳	쩏	쩫	쪇	쪣	쪿	쫛	쫷	쬓	쬯	쭋	쭧	쮃	쮟	쮻	쯗	쯳	찏	찫	챇	챣	챿	첛	첷	쳓	쳯	촋	촧	쵃	쵟	쵻	춗	춳	췏	췫	츇	츣	츿	칛	칷	캓	캯	컋	컧	켃	켟	켻	콗	콳	쾏	쾫	쿇	쿣	쿿	퀛	퀷	큓	큯	킋	킧	탃	탟	탻	턗	턳	텏	텫	톇	톣	톿	퇛	퇷	툓	툯	퉋	퉧	튃	튟	튻	틗	틳	팏	팫	퍇	퍣	퍿	펛	펷	폓	폯	퐋	퐧	푃	푟	푻	풗	풳	퓏	퓫	픇	픣	픿	핛	핷	햓	햯	헋	헧	혃	혟	혻	홗	홳	횏	횫	훇	훣	훿	휛	휷	흓	흯	힋	ﾣ
ᆫ	㈝	간	갠	갼	걘	건	겐	견	곈	곤	관	괜	괸	굔	군	권	궨	귄	균	근	긘	긴	깐	깬	꺈	꺤	껀	껜	껸	꼔	꼰	꽌	꽨	꾄	꾠	꾼	꿘	꿴	뀐	뀬	끈	끤	낀	난	낸	냔	냰	넌	넨	년	녠	논	놘	놴	뇐	뇬	눈	눤	뉀	뉜	뉸	는	늰	닌	단	댄	댠	댼	던	덴	뎐	뎬	돈	돤	됀	된	됸	둔	둰	뒌	뒨	듄	든	듼	딘	딴	땐	땬	떈	떤	뗀	뗜	뗸	똔	똰	뙌	뙨	뚄	뚠	뚼	뛘	뛴	뜐	뜬	띈	띤	란	랜	랸	럔	런	렌	련	롄	론	롼	뢘	뢴	룐	룬	뤈	뤤	륀	륜	른	릔	린	만	맨	먄	먠	먼	멘	면	몐	몬	뫈	뫤	묀	묜	문	뭔	뭰	뮌	뮨	믄	믠	민	반	밴	뱐	뱬	번	벤	변	볜	본	봔	봰	뵌	뵨	분	붠	붼	뷘	뷴	븐	븬	빈	빤	뺀	뺜	뺸	뻔	뻰	뼌	뼨	뽄	뽠	뽼	뾘	뾴	뿐	뿬	쀈	쀤	쁀	쁜	쁸	삔	산	샌	샨	섄	선	센	션	셴	손	솬	쇈	쇤	숀	순	숸	쉔	쉰	슌	슨	싄	신	싼	쌘	쌴	썐	썬	쎈	쎤	쏀	쏜	쏸	쐔	쐰	쑌	쑨	쒄	쒠	쒼	쓘	쓴	씐	씬	안	앤	얀	얜	언	엔	연	옌	온	완	왠	왼	욘	운	원	웬	윈	윤	은	읜	인	잔	잰	쟌	쟨	전	젠	젼	졘	존	좐	좬	죈	죤	준	줜	줸	쥔	쥰	즌	즨	진	짠	짼	쨘	쨴	쩐	쩬	쪈	쪤	쫀	쫜	쫸	쬔	쬰	쭌	쭨	쮄	쮠	쮼	쯘	쯴	찐	찬	챈	챤	첀	천	첸	쳔	쳰	촌	촨	쵄	쵠	쵼	춘	춴	췐	췬	츈	츤	칀	친	칸	캔	캰	컌	컨	켄	켠	켼	콘	콴	쾐	쾬	쿈	쿤	퀀	퀜	퀸	큔	큰	킌	킨	탄	탠	탼	턘	턴	텐	텬	톈	톤	퇀	퇜	퇸	툔	툰	퉌	퉨	튄	튠	튼	틘	틴	판	팬	퍈	퍤	펀	펜	편	폔	폰	퐌	퐨	푄	푠	푼	풘	풴	퓐	퓬	픈	픤	핀	한	핸	햔	햰	헌	헨	현	혠	혼	환	홴	횐	횬	훈	훤	휀	휜	휸	흔	흰	힌
ᆬ	ㄵ	갅	갡	갽	걙	걵	겑	겭	곉	곥	괁	괝	괹	굕	굱	궍	궩	귅	귡	귽	긙	긵	깑	깭	꺉	꺥	껁	껝	껹	꼕	꼱	꽍	꽩	꾅	꾡	꾽	꿙	꿵	뀑	뀭	끉	끥	낁	낝	낹	냕	냱	넍	넩	녅	녡	녽	놙	놵	뇑	뇭	눉	눥	뉁	뉝	뉹	늕	늱	닍	닩	댅	댡	댽	덙	덵	뎑	뎭	돉	돥	됁	됝	됹	둕	둱	뒍	뒩	듅	듡	듽	딙	딵	땑	땭	떉	떥	뗁	뗝	뗹	똕	똱	뙍	뙩	뚅	뚡	뚽	뛙	뛵	뜑	뜭	띉	띥	랁	랝	랹	럕	럱	렍	렩	롅	롡	롽	뢙	뢵	룑	룭	뤉	뤥	륁	륝	륹	릕	릱	맍	맩	먅	먡	먽	멙	멵	몑	몭	뫉	뫥	묁	묝	묹	뭕	뭱	뮍	뮩	믅	믡	믽	밙	밵	뱑	뱭	벉	벥	볁	볝	볹	봕	봱	뵍	뵩	붅	붡	붽	뷙	뷵	븑	븭	빉	빥	뺁	뺝	뺹	뻕	뻱	뼍	뼩	뽅	뽡	뽽	뾙	뾵	뿑	뿭	쀉	쀥	쁁	쁝	쁹	삕	삱	샍	샩	섅	섡	섽	셙	셵	솑	솭	쇉	쇥	숁	숝	숹	쉕	쉱	슍	슩	싅	싡	싽	쌙	쌵	썑	썭	쎉	쎥	쏁	쏝	쏹	쐕	쐱	쑍	쑩	쒅	쒡	쒽	쓙	쓵	씑	씭	앉	앥	얁	얝	얹	엕	엱	옍	옩	왅	왡	왽	욙	욵	웑	웭	윉	윥	읁	읝	읹	잕	잱	쟍	쟩	젅	젡	젽	졙	졵	좑	좭	죉	죥	줁	줝	줹	쥕	쥱	즍	즩	짅	짡	짽	쨙	쨵	쩑	쩭	쪉	쪥	쫁	쫝	쫹	쬕	쬱	쭍	쭩	쮅	쮡	쮽	쯙	쯵	찑	찭	챉	챥	첁	첝	첹	쳕	쳱	촍	촩	쵅	쵡	쵽	춙	춵	췑	췭	츉	츥	칁	칝	칹	캕	캱	컍	컩	켅	켡	켽	콙	콵	쾑	쾭	쿉	쿥	퀁	퀝	퀹	큕	큱	킍	킩	탅	탡	탽	턙	턵	텑	텭	톉	톥	퇁	퇝	퇹	툕	툱	퉍	퉩	튅	튡	튽	틙	틵	팑	팭	퍉	퍥	펁	펝	펹	폕	폱	퐍	퐩	푅	푡	푽	풙	풵	퓑	퓭	픉	픥	핁	핝	핹	햕	햱	헍	헩	혅	혡	혽	홙	홵	횑	횭	훉	훥	휁	휝	휹	흕	흱	힍	ﾥ
ᆭ	ㄶ	갆	갢	갾	걚	걶	겒	겮	곊	곦	괂	괞	괺	굖	굲	궎	궪	귆	귢	귾	긚	긶	깒	깮	꺊	꺦	껂	껞	껺	꼖	꼲	꽎	꽪	꾆	꾢	꾾	꿚	꿶	뀒	뀮	끊	끦	낂	낞	낺	냖	냲	넎	넪	녆	녢	녾	놚	놶	뇒	뇮	눊	눦	뉂	뉞	뉺	늖	늲	닎	닪	댆	댢	댾	덚	덶	뎒	뎮	돊	돦	됂	됞	됺	둖	둲	뒎	뒪	듆	듢	듾	딚	딶	땒	땮	떊	떦	뗂	뗞	뗺	똖	똲	뙎	뙪	뚆	뚢	뚾	뛚	뛶	뜒	뜮	띊	띦	랂	랞	랺	럖	럲	렎	렪	롆	롢	롾	뢚	뢶	룒	룮	뤊	뤦	륂	륞	륺	릖	릲	많	맪	먆	먢	먾	멚	멶	몒	몮	뫊	뫦	묂	묞	묺	뭖	뭲	뮎	뮪	믆	믢	믾	밚	밶	뱒	뱮	벊	벦	볂	볞	볺	봖	봲	뵎	뵪	붆	붢	붾	뷚	뷶	븒	븮	빊	빦	뺂	뺞	뺺	뻖	뻲	뼎	뼪	뽆	뽢	뽾	뾚	뾶	뿒	뿮	쀊	쀦	쁂	쁞	쁺	삖	삲	샎	샪	섆	섢	섾	셚	셶	솒	솮	쇊	쇦	숂	숞	숺	쉖	쉲	슎	슪	싆	싢	싾	쌚	쌶	썒	썮	쎊	쎦	쏂	쏞	쏺	쐖	쐲	쑎	쑪	쒆	쒢	쒾	쓚	쓶	씒	씮	않	앦	얂	얞	얺	엖	엲	옎	옪	왆	왢	왾	욚	욶	웒	웮	윊	윦	읂	읞	읺	잖	잲	쟎	쟪	젆	젢	젾	졚	졶	좒	좮	죊	죦	줂	줞	줺	쥖	쥲	즎	즪	짆	짢	짾	쨚	쨶	쩒	쩮	쪊	쪦	쫂	쫞	쫺	쬖	쬲	쭎	쭪	쮆	쮢	쮾	쯚	쯶	찒	찮	챊	챦	첂	첞	첺	쳖	쳲	촎	촪	쵆	쵢	쵾	춚	춶	췒	췮	츊	츦	칂	칞	칺	캖	캲	컎	컪	켆	켢	켾	콚	콶	쾒	쾮	쿊	쿦	퀂	퀞	퀺	큖	큲	킎	킪	탆	탢	탾	턚	턶	텒	텮	톊	톦	퇂	퇞	퇺	툖	툲	퉎	퉪	튆	튢	튾	틚	틶	팒	팮	퍊	퍦	펂	펞	펺	폖	폲	퐎	퐪	푆	푢	푾	풚	풶	퓒	퓮	픊	픦	핂	핞	핺	햖	햲	헎	헪	혆	혢	혾	홚	홶	횒	횮	훊	훦	휂	휞	휺	흖	흲	힎	ﾦ
ᆮ	갇	갣	갿	걛	걷	겓	겯	곋	곧	괃	괟	괻	굗	굳	궏	궫	귇	귣	귿	긛	긷	깓	깯	꺋	꺧	껃	껟	껻	꼗	꼳	꽏	꽫	꾇	꾣	꾿	꿛	꿷	뀓	뀯	끋	끧	낃	낟	낻	냗	냳	넏	넫	녇	녣	녿	놛	놷	뇓	뇯	눋	눧	뉃	뉟	뉻	늗	늳	닏	닫	댇	댣	댿	덛	덷	뎓	뎯	돋	돧	됃	됟	됻	둗	둳	뒏	뒫	듇	듣	듿	딛	딷	땓	땯	떋	떧	뗃	뗟	뗻	똗	똳	뙏	뙫	뚇	뚣	뚿	뛛	뛷	뜓	뜯	띋	띧	랃	랟	랻	럗	럳	렏	렫	롇	롣	롿	뢛	뢷	룓	룯	뤋	뤧	륃	륟	륻	릗	릳	맏	맫	먇	먣	먿	멛	멷	몓	몯	뫋	뫧	묃	묟	묻	뭗	뭳	뮏	뮫	믇	믣	믿	받	밷	뱓	뱯	벋	벧	볃	볟	볻	봗	봳	뵏	뵫	붇	붣	붿	뷛	뷷	븓	븯	빋	빧	뺃	뺟	뺻	뻗	뻳	뼏	뼫	뽇	뽣	뽿	뾛	뾷	뿓	뿯	쀋	쀧	쁃	쁟	쁻	삗	삳	샏	샫	섇	섣	섿	셛	셷	솓	솯	쇋	쇧	숃	숟	숻	쉗	쉳	슏	슫	싇	싣	싿	쌛	쌷	썓	썯	쎋	쎧	쏃	쏟	쏻	쐗	쐳	쑏	쑫	쒇	쒣	쒿	쓛	쓷	씓	씯	앋	앧	얃	얟	얻	엗	엳	옏	옫	왇	왣	왿	욛	욷	웓	웯	윋	윧	읃	읟	읻	잗	잳	쟏	쟫	젇	젣	젿	졛	졷	좓	좯	죋	죧	줃	줟	줻	쥗	쥳	즏	즫	짇	짣	짿	쨛	쨷	쩓	쩯	쪋	쪧	쫃	쫟	쫻	쬗	쬳	쭏	쭫	쮇	쮣	쮿	쯛	쯷	찓	찯	챋	챧	첃	첟	첻	쳗	쳳	촏	촫	쵇	쵣	쵿	춛	춷	췓	췯	츋	츧	칃	칟	칻	캗	캳	컏	컫	켇	켣	켿	콛	콷	쾓	쾯	쿋	쿧	퀃	퀟	퀻	큗	큳	킏	킫	탇	탣	탿	턛	턷	텓	텯	톋	톧	퇃	퇟	퇻	툗	툳	퉏	퉫	튇	튣	튿	틛	틷	팓	팯	퍋	퍧	펃	펟	펻	폗	폳	퐏	퐫	푇	푣	푿	풛	풷	퓓	퓯	픋	픧	핃	핟	핻	햗	햳	헏	헫	혇	혣	혿	홛	홷	횓	횯	훋	훧	휃	휟	휻	흗	흳	힏
ᆯ	갈	갤	걀	걜	걸	겔	결	곌	골	괄	괠	괼	굘	굴	궐	궬	귈	귤	글	긜	길	깔	깰	꺌	꺨	껄	껠	껼	꼘	꼴	꽐	꽬	꾈	꾤	꿀	꿜	꿸	뀔	뀰	끌	끨	낄	날	낼	냘	냴	널	넬	녈	녤	놀	놜	놸	뇔	뇰	눌	눨	뉄	뉠	뉼	늘	늴	닐	달	댈	댤	덀	덜	델	뎔	뎰	돌	돨	됄	될	됼	둘	둴	뒐	뒬	듈	들	딀	딜	딸	땔	땰	떌	떨	뗄	뗠	뗼	똘	똴	뙐	뙬	뚈	뚤	뛀	뛜	뛸	뜔	뜰	띌	띨	랄	랠	랼	럘	럴	렐	렬	롈	롤	뢀	뢜	뢸	룔	룰	뤌	뤨	륄	률	를	릘	릴	말	맬	먈	먤	멀	멜	멸	몔	몰	뫌	뫨	묄	묠	물	뭘	뭴	뮐	뮬	믈	믤	밀	발	밸	뱔	뱰	벌	벨	별	볠	볼	봘	봴	뵐	뵬	불	붤	뷀	뷜	뷸	블	븰	빌	빨	뺄	뺠	뺼	뻘	뻴	뼐	뼬	뽈	뽤	뾀	뾜	뾸	뿔	뿰	쀌	쀨	쁄	쁠	쁼	삘	살	샐	샬	섈	설	셀	셜	셸	솔	솰	쇌	쇨	숄	술	숼	쉘	쉴	슐	슬	싈	실	쌀	쌜	쌸	썔	썰	쎌	쎨	쏄	쏠	쏼	쐘	쐴	쑐	쑬	쒈	쒤	쓀	쓜	쓸	씔	씰	알	앨	얄	얠	얼	엘	열	옐	올	왈	왤	욀	욜	울	월	웰	윌	율	을	읠	일	잘	잴	쟐	쟬	절	젤	졀	졜	졸	좔	좰	죌	죨	줄	줠	줼	쥘	쥴	즐	즬	질	짤	쨀	쨜	쨸	쩔	쩰	쪌	쪨	쫄	쫠	쫼	쬘	쬴	쭐	쭬	쮈	쮤	쯀	쯜	쯸	찔	찰	챌	챨	첄	철	첼	쳘	쳴	촐	촬	쵈	쵤	춀	출	춸	췔	췰	츌	츨	칄	칠	칼	캘	캴	컐	컬	켈	켤	콀	콜	콸	쾔	쾰	쿌	쿨	퀄	퀠	퀼	큘	클	킐	킬	탈	탤	턀	턜	털	텔	텰	톌	톨	퇄	퇠	퇼	툘	툴	퉐	퉬	튈	튤	틀	틜	틸	팔	팰	퍌	퍨	펄	펠	펼	폘	폴	퐐	퐬	푈	푤	풀	풜	풸	퓔	퓰	플	픨	필	할	핼	햘	햴	헐	헬	혈	혤	홀	활	홸	횔	횰	훌	훨	휄	휠	휼	흘	흴	힐
ᆰ	ㄺ	갉	갥	걁	걝	걹	겕	겱	곍	곩	괅	괡	괽	굙	굵	궑	궭	귉	귥	긁	긝	긹	깕	깱	꺍	꺩	껅	껡	껽	꼙	꼵	꽑	꽭	꾉	꾥	꿁	꿝	꿹	뀕	뀱	끍	끩	낅	낡	낽	냙	냵	넑	넭	녉	녥	놁	놝	놹	뇕	뇱	눍	눩	뉅	뉡	뉽	늙	늵	닑	닭	댉	댥	덁	덝	덹	뎕	뎱	돍	돩	됅	됡	됽	둙	둵	뒑	뒭	듉	듥	딁	딝	딹	땕	땱	떍	떩	뗅	뗡	뗽	똙	똵	뙑	뙭	뚉	뚥	뛁	뛝	뛹	뜕	뜱	띍	띩	랅	랡	랽	럙	럵	렑	렭	롉	롥	뢁	뢝	뢹	룕	룱	뤍	뤩	륅	륡	륽	릙	릵	맑	맭	먉	먥	멁	멝	멹	몕	몱	뫍	뫩	묅	묡	묽	뭙	뭵	뮑	뮭	믉	믥	밁	밝	밹	뱕	뱱	벍	벩	볅	볡	볽	봙	봵	뵑	뵭	붉	붥	뷁	뷝	뷹	븕	븱	빍	빩	뺅	뺡	뺽	뻙	뻵	뼑	뼭	뽉	뽥	뾁	뾝	뾹	뿕	뿱	쀍	쀩	쁅	쁡	쁽	삙	삵	샑	샭	섉	섥	셁	셝	셹	솕	솱	쇍	쇩	숅	숡	숽	쉙	쉵	슑	슭	싉	싥	쌁	쌝	쌹	썕	썱	쎍	쎩	쏅	쏡	쏽	쐙	쐵	쑑	쑭	쒉	쒥	쓁	쓝	쓹	씕	씱	앍	앩	얅	얡	얽	엙	엵	옑	옭	왉	왥	욁	욝	욹	웕	웱	윍	윩	읅	읡	읽	잙	잵	쟑	쟭	젉	젥	졁	졝	졹	좕	좱	죍	죩	줅	줡	줽	쥙	쥵	즑	즭	짉	짥	쨁	쨝	쨹	쩕	쩱	쪍	쪩	쫅	쫡	쫽	쬙	쬵	쭑	쭭	쮉	쮥	쯁	쯝	쯹	찕	찱	챍	챩	첅	첡	첽	쳙	쳵	촑	촭	쵉	쵥	춁	춝	춹	췕	췱	츍	츩	칅	칡	칽	캙	캵	컑	컭	켉	켥	콁	콝	콹	쾕	쾱	쿍	쿩	퀅	퀡	퀽	큙	큵	킑	킭	탉	탥	턁	턝	턹	텕	텱	톍	톩	퇅	퇡	퇽	툙	툵	퉑	퉭	튉	튥	틁	틝	틹	팕	팱	퍍	퍩	펅	펡	펽	폙	폵	퐑	퐭	푉	푥	풁	풝	풹	퓕	퓱	픍	픩	핅	핡	핽	햙	햵	헑	헭	혉	혥	홁	홝	홹	횕	횱	훍	훩	휅	휡	휽	흙	흵	힑	ﾪ
ᆱ	ㄻ	갊	갦	걂	걞	걺	겖	겲	곎	곪	괆	괢	괾	굚	굶	궒	궮	귊	귦	긂	긞	긺	깖	깲	꺎	꺪	껆	껢	껾	꼚	꼶	꽒	꽮	꾊	꾦	꿂	꿞	꿺	뀖	뀲	끎	끪	낆	낢	낾	냚	냶	넒	넮	녊	녦	놂	놞	놺	뇖	뇲	눎	눪	뉆	뉢	뉾	늚	늶	닒	닮	댊	댦	덂	덞	덺	뎖	뎲	돎	돪	됆	됢	됾	둚	둶	뒒	뒮	듊	듦	딂	딞	딺	땖	땲	떎	떪	뗆	뗢	뗾	똚	똶	뙒	뙮	뚊	뚦	뛂	뛞	뛺	뜖	뜲	띎	띪	랆	랢	랾	럚	럶	렒	렮	롊	롦	뢂	뢞	뢺	룖	룲	뤎	뤪	륆	륢	륾	릚	릶	맒	맮	먊	먦	멂	멞	멺	몖	몲	뫎	뫪	묆	묢	묾	뭚	뭶	뮒	뮮	믊	믦	밂	밞	밺	뱖	뱲	벎	벪	볆	볢	볾	봚	봶	뵒	뵮	붊	붦	뷂	뷞	뷺	븖	븲	빎	빪	뺆	뺢	뺾	뻚	뻶	뼒	뼮	뽊	뽦	뾂	뾞	뾺	뿖	뿲	쀎	쀪	쁆	쁢	쁾	삚	삶	샒	샮	섊	섦	셂	셞	셺	솖	솲	쇎	쇪	숆	숢	숾	쉚	쉶	슒	슮	싊	싦	쌂	쌞	쌺	썖	썲	쎎	쎪	쏆	쏢	쏾	쐚	쐶	쑒	쑮	쒊	쒦	쓂	쓞	쓺	씖	씲	앎	앪	얆	얢	얾	엚	엶	옒	옮	왊	왦	욂	욞	욺	웖	웲	윎	윪	읆	읢	읾	잚	잶	쟒	쟮	젊	젦	졂	졞	졺	좖	좲	죎	죪	줆	줢	줾	쥚	쥶	즒	즮	짊	짦	쨂	쨞	쨺	쩖	쩲	쪎	쪪	쫆	쫢	쫾	쬚	쬶	쭒	쭮	쮊	쮦	쯂	쯞	쯺	찖	찲	챎	챪	첆	첢	첾	쳚	쳶	촒	촮	쵊	쵦	춂	춞	춺	췖	췲	츎	츪	칆	칢	칾	캚	캶	컒	컮	켊	켦	콂	콞	콺	쾖	쾲	쿎	쿪	퀆	퀢	퀾	큚	큶	킒	킮	탊	탦	턂	턞	턺	텖	텲	톎	톪	퇆	퇢	퇾	툚	툶	퉒	퉮	튊	튦	틂	틞	틺	팖	팲	퍎	퍪	펆	펢	펾	폚	폶	퐒	퐮	푊	푦	풂	풞	풺	퓖	퓲	픎	픪	핆	핢	핾	햚	햶	헒	헮	혊	혦	홂	홞	홺	횖	횲	훎	훪	휆	휢	휾	흚	흶	힒	ﾫ
ᆲ	ㄼ	갋	갧	걃	걟	걻	겗	겳	곏	곫	괇	괣	괿	굛	굷	궓	궯	귋	귧	긃	긟	긻	깗	깳	꺏	꺫	껇	껣	껿	꼛	꼷	꽓	꽯	꾋	꾧	꿃	꿟	꿻	뀗	뀳	끏	끫	낇	낣	낿	냛	냷	넓	넯	녋	녧	놃	놟	놻	뇗	뇳	눏	눫	뉇	뉣	뉿	늛	늷	닓	닯	댋	댧	덃	덟	덻	뎗	뎳	돏	돫	됇	됣	됿	둛	둷	뒓	뒯	듋	듧	딃	딟	딻	땗	땳	떏	떫	뗇	뗣	뗿	똛	똷	뙓	뙯	뚋	뚧	뛃	뛟	뛻	뜗	뜳	띏	띫	랇	랣	랿	럛	럷	렓	렯	롋	롧	뢃	뢟	뢻	룗	룳	뤏	뤫	륇	륣	륿	릛	릷	맓	맯	먋	먧	멃	멟	멻	몗	몳	뫏	뫫	묇	묣	묿	뭛	뭷	뮓	뮯	믋	믧	밃	밟	밻	뱗	뱳	벏	벫	볇	볣	볿	봛	봷	뵓	뵯	붋	붧	뷃	뷟	뷻	븗	븳	빏	빫	뺇	뺣	뺿	뻛	뻷	뼓	뼯	뽋	뽧	뾃	뾟	뾻	뿗	뿳	쀏	쀫	쁇	쁣	쁿	삛	삷	샓	샯	섋	섧	셃	셟	셻	솗	솳	쇏	쇫	숇	숣	숿	쉛	쉷	슓	슯	싋	싧	쌃	쌟	쌻	썗	썳	쎏	쎫	쏇	쏣	쏿	쐛	쐷	쑓	쑯	쒋	쒧	쓃	쓟	쓻	씗	씳	앏	앫	얇	얣	얿	엛	엷	옓	옯	왋	왧	욃	욟	욻	웗	웳	윏	윫	읇	읣	읿	잛	잷	쟓	쟯	젋	젧	졃	졟	졻	좗	좳	죏	죫	줇	줣	줿	쥛	쥷	즓	즯	짋	짧	쨃	쨟	쨻	쩗	쩳	쪏	쪫	쫇	쫣	쫿	쬛	쬷	쭓	쭯	쮋	쮧	쯃	쯟	쯻	찗	찳	챏	챫	첇	첣	첿	쳛	쳷	촓	촯	쵋	쵧	춃	춟	춻	췗	췳	츏	츫	칇	칣	칿	캛	캷	컓	컯	켋	켧	콃	콟	콻	쾗	쾳	쿏	쿫	퀇	퀣	퀿	큛	큷	킓	킯	탋	탧	턃	턟	턻	텗	텳	톏	톫	퇇	퇣	퇿	툛	툷	퉓	퉯	튋	튧	틃	틟	틻	팗	팳	퍏	퍫	펇	펣	펿	폛	폷	퐓	퐯	푋	푧	풃	풟	풻	퓗	퓳	픏	픫	핇	핣	핿	햛	햷	헓	헯	혋	혧	홃	홟	홻	횗	횳	훏	훫	휇	휣	휿	흛	흷	힓	ﾬ
ᆳ	ㄽ	갌	갨	걄	걠	걼	겘	겴	곐	곬	괈	괤	굀	굜	굸	궔	궰	귌	귨	긄	긠	긼	깘	깴	꺐	꺬	껈	껤	꼀	꼜	꼸	꽔	꽰	꾌	꾨	꿄	꿠	꿼	뀘	뀴	끐	끬	낈	낤	냀	냜	냸	넔	넰	녌	녨	놄	놠	놼	뇘	뇴	눐	눬	뉈	뉤	늀	늜	늸	닔	닰	댌	댨	덄	덠	덼	뎘	뎴	돐	돬	됈	됤	둀	둜	둸	뒔	뒰	듌	듨	딄	딠	딼	땘	땴	떐	떬	뗈	뗤	똀	똜	똸	뙔	뙰	뚌	뚨	뛄	뛠	뛼	뜘	뜴	띐	띬	랈	랤	럀	럜	럸	렔	렰	롌	롨	뢄	뢠	뢼	룘	룴	뤐	뤬	륈	륤	릀	릜	릸	맔	맰	먌	먨	멄	멠	멼	몘	몴	뫐	뫬	묈	묤	뭀	뭜	뭸	뮔	뮰	믌	믨	밄	밠	밼	뱘	뱴	벐	벬	볈	볤	봀	봜	봸	뵔	뵰	붌	붨	뷄	뷠	뷼	븘	븴	빐	빬	뺈	뺤	뻀	뻜	뻸	뼔	뼰	뽌	뽨	뾄	뾠	뾼	뿘	뿴	쀐	쀬	쁈	쁤	삀	삜	삸	샔	샰	섌	섨	셄	셠	셼	솘	솴	쇐	쇬	숈	숤	쉀	쉜	쉸	슔	슰	싌	싨	쌄	쌠	쌼	썘	썴	쎐	쎬	쏈	쏤	쐀	쐜	쐸	쑔	쑰	쒌	쒨	쓄	쓠	쓼	씘	씴	앐	앬	얈	얤	엀	엜	엸	옔	옰	왌	왨	욄	욠	욼	웘	웴	윐	윬	읈	읤	잀	잜	잸	쟔	쟰	젌	젨	졄	졠	졼	좘	좴	죐	죬	줈	줤	쥀	쥜	쥸	즔	즰	짌	짨	쨄	쨠	쨼	쩘	쩴	쪐	쪬	쫈	쫤	쬀	쬜	쬸	쭔	쭰	쮌	쮨	쯄	쯠	쯼	찘	찴	챐	챬	첈	첤	쳀	쳜	쳸	촔	촰	쵌	쵨	춄	춠	춼	췘	췴	츐	츬	칈	칤	캀	캜	캸	컔	컰	켌	켨	콄	콠	콼	쾘	쾴	쿐	쿬	퀈	퀤	큀	큜	큸	킔	킰	탌	탨	턄	턠	턼	텘	텴	톐	톬	퇈	퇤	툀	툜	툸	퉔	퉰	튌	튨	틄	틠	틼	팘	팴	퍐	퍬	펈	펤	폀	폜	폸	퐔	퐰	푌	푨	풄	풠	풼	퓘	퓴	픐	픬	핈	핤	햀	햜	햸	헔	헰	혌	혨	홄	홠	홼	횘	횴	훐	훬	휈	휤	흀	흜	흸	힔	ﾭ
ᆴ	ㄾ	갍	갩	걅	걡	걽	겙	겵	곑	곭	괉	괥	굁	굝	굹	궕	궱	귍	귩	긅	긡	긽	깙	깵	꺑	꺭	껉	껥	꼁	꼝	꼹	꽕	꽱	꾍	꾩	꿅	꿡	꿽	뀙	뀵	끑	끭	낉	낥	냁	냝	냹	넕	넱	녍	녩	놅	놡	놽	뇙	뇵	눑	눭	뉉	뉥	늁	늝	늹	닕	닱	댍	댩	덅	덡	덽	뎙	뎵	돑	돭	됉	됥	둁	둝	둹	뒕	뒱	듍	듩	딅	딡	딽	땙	땵	떑	떭	뗉	뗥	똁	똝	똹	뙕	뙱	뚍	뚩	뛅	뛡	뛽	뜙	뜵	띑	띭	랉	랥	럁	럝	럹	렕	렱	롍	롩	뢅	뢡	뢽	룙	룵	뤑	뤭	륉	륥	릁	릝	릹	맕	맱	먍	먩	멅	멡	멽	몙	몵	뫑	뫭	묉	묥	뭁	뭝	뭹	뮕	뮱	믍	믩	밅	밡	밽	뱙	뱵	벑	벭	볉	볥	봁	봝	봹	뵕	뵱	붍	붩	뷅	뷡	뷽	븙	븵	빑	빭	뺉	뺥	뻁	뻝	뻹	뼕	뼱	뽍	뽩	뾅	뾡	뾽	뿙	뿵	쀑	쀭	쁉	쁥	삁	삝	삹	샕	샱	섍	섩	셅	셡	셽	솙	솵	쇑	쇭	숉	숥	쉁	쉝	쉹	슕	슱	싍	싩	쌅	쌡	쌽	썙	썵	쎑	쎭	쏉	쏥	쐁	쐝	쐹	쑕	쑱	쒍	쒩	쓅	쓡	쓽	씙	씵	앑	앭	얉	얥	엁	엝	엹	옕	옱	왍	왩	욅	욡	욽	웙	웵	윑	윭	읉	읥	잁	잝	잹	쟕	쟱	젍	젩	졅	졡	졽	좙	좵	죑	죭	줉	줥	쥁	쥝	쥹	즕	즱	짍	짩	쨅	쨡	쨽	쩙	쩵	쪑	쪭	쫉	쫥	쬁	쬝	쬹	쭕	쭱	쮍	쮩	쯅	쯡	쯽	찙	찵	챑	챭	첉	첥	쳁	쳝	쳹	촕	촱	쵍	쵩	춅	춡	춽	췙	췵	츑	츭	칉	칥	캁	캝	캹	컕	컱	켍	켩	콅	콡	콽	쾙	쾵	쿑	쿭	퀉	퀥	큁	큝	큹	킕	킱	탍	탩	턅	턡	턽	텙	텵	톑	톭	퇉	퇥	툁	툝	툹	퉕	퉱	튍	튩	틅	틡	틽	팙	팵	퍑	퍭	펉	펥	폁	폝	폹	퐕	퐱	푍	푩	풅	풡	풽	퓙	퓵	픑	픭	핉	핥	햁	햝	햹	헕	헱	혍	혩	홅	홡	홽	횙	횵	훑	훭	휉	휥	흁	흝	흹	힕	ﾮ
ᆵ	ㄿ	갎	갪	걆	걢	걾	겚	겶	곒	곮	괊	괦	굂	굞	굺	궖	궲	귎	귪	긆	긢	긾	깚	깶	꺒	꺮	껊	껦	꼂	꼞	꼺	꽖	꽲	꾎	꾪	꿆	꿢	꿾	뀚	뀶	끒	끮	낊	낦	냂	냞	냺	넖	넲	녎	녪	놆	놢	놾	뇚	뇶	눒	눮	뉊	뉦	늂	늞	늺	닖	닲	댎	댪	덆	덢	덾	뎚	뎶	돒	돮	됊	됦	둂	둞	둺	뒖	뒲	듎	듪	딆	딢	딾	땚	땶	떒	떮	뗊	뗦	똂	똞	똺	뙖	뙲	뚎	뚪	뛆	뛢	뛾	뜚	뜶	띒	띮	랊	랦	럂	럞	럺	렖	렲	롎	롪	뢆	뢢	뢾	룚	룶	뤒	뤮	륊	륦	릂	릞	릺	맖	맲	먎	먪	멆	멢	멾	몚	몶	뫒	뫮	묊	묦	뭂	뭞	뭺	뮖	뮲	믎	믪	밆	밢	밾	뱚	뱶	벒	벮	볊	볦	봂	봞	봺	뵖	뵲	붎	붪	뷆	뷢	뷾	븚	븶	빒	빮	뺊	뺦	뻂	뻞	뻺	뼖	뼲	뽎	뽪	뾆	뾢	뾾	뿚	뿶	쀒	쀮	쁊	쁦	삂	삞	삺	샖	샲	섎	섪	셆	셢	셾	솚	솶	쇒	쇮	숊	숦	쉂	쉞	쉺	슖	슲	싎	싪	쌆	쌢	쌾	썚	썶	쎒	쎮	쏊	쏦	쐂	쐞	쐺	쑖	쑲	쒎	쒪	쓆	쓢	쓾	씚	씶	앒	앮	얊	얦	엂	엞	엺	옖	옲	왎	왪	욆	욢	욾	웚	웶	윒	윮	읊	읦	잂	잞	잺	쟖	쟲	젎	젪	졆	졢	졾	좚	좶	죒	죮	줊	줦	쥂	쥞	쥺	즖	즲	짎	짪	쨆	쨢	쨾	쩚	쩶	쪒	쪮	쫊	쫦	쬂	쬞	쬺	쭖	쭲	쮎	쮪	쯆	쯢	쯾	찚	찶	챒	챮	첊	첦	쳂	쳞	쳺	촖	촲	쵎	쵪	춆	춢	춾	췚	췶	츒	츮	칊	칦	캂	캞	캺	컖	컲	켎	켪	콆	콢	콾	쾚	쾶	쿒	쿮	퀊	퀦	큂	큞	큺	킖	킲	탎	탪	턆	턢	턾	텚	텶	톒	톮	퇊	퇦	툂	툞	툺	퉖	퉲	튎	튪	틆	틢	틾	팚	팶	퍒	퍮	펊	펦	폂	폞	폺	퐖	퐲	푎	푪	풆	풢	풾	퓚	퓶	픒	픮	핊	핦	햂	햞	햺	헖	헲	혎	혪	홆	홢	홾	횚	횶	훒	훮	휊	휦	흂	흞	흺	힖	ﾯ
ᆶ	갏	갫	걇	걣	걿	겛	겷	곓	곯	괋	괧	굃	굟	굻	궗	궳	귏	귫	긇	긣	긿	깛	깷	꺓	꺯	껋	껧	꼃	꼟	꼻	꽗	꽳	꾏	꾫	꿇	꿣	꿿	뀛	뀷	끓	끯	낋	낧	냃	냟	냻	넗	넳	녏	녫	놇	놣	놿	뇛	뇷	눓	눯	뉋	뉧	늃	늟	늻	닗	닳	댏	댫	덇	덣	덿	뎛	뎷	돓	돯	됋	됧	둃	둟	둻	뒗	뒳	듏	듫	딇	딣	딿	땛	땷	떓	떯	뗋	뗧	똃	똟	똻	뙗	뙳	뚏	뚫	뛇	뛣	뛿	뜛	뜷	띓	띯	랋	랧	럃	럟	럻	렗	렳	롏	롫	뢇	뢣	뢿	룛	룷	뤓	뤯	륋	륧	릃	릟	릻	맗	맳	먏	먫	멇	멣	멿	몛	몷	뫓	뫯	묋	묧	뭃	뭟	뭻	뮗	뮳	믏	믫	밇	밣	밿	뱛	뱷	벓	벯	볋	볧	봃	봟	봻	뵗	뵳	붏	붫	뷇	뷣	뷿	븛	븷	빓	빯	뺋	뺧	뻃	뻟	뻻	뼗	뼳	뽏	뽫	뾇	뾣	뾿	뿛	뿷	쀓	쀯	쁋	쁧	삃	삟	삻	샗	샳	섏	섫	셇	셣	셿	솛	솷	쇓	쇯	숋	숧	쉃	쉟	쉻	슗	슳	싏	싫	쌇	쌣	쌿	썛	썷	쎓	쎯	쏋	쏧	쐃	쐟	쐻	쑗	쑳	쒏	쒫	쓇	쓣	쓿	씛	씷	앓	앯	얋	얧	엃	엟	엻	옗	옳	왏	왫	욇	욣	욿	웛	웷	윓	윯	읋	읧	잃	잟	잻	쟗	쟳	젏	젫	졇	졣	졿	좛	좷	죓	죯	줋	줧	쥃	쥟	쥻	즗	즳	짏	짫	쨇	쨣	쨿	쩛	쩷	쪓	쪯	쫋	쫧	쬃	쬟	쬻	쭗	쭳	쮏	쮫	쯇	쯣	쯿	찛	찷	챓	챯	첋	첧	쳃	쳟	쳻	촗	촳	쵏	쵫	춇	춣	춿	췛	췷	츓	츯	칋	칧	캃	캟	캻	컗	컳	켏	켫	콇	콣	콿	쾛	쾷	쿓	쿯	퀋	퀧	큃	큟	큻	킗	킳	탏	탫	턇	턣	턿	텛	텷	톓	톯	퇋	퇧	툃	툟	툻	퉗	퉳	튏	튫	틇	틣	틿	팛	팷	퍓	퍯	펋	펧	폃	폟	폻	퐗	퐳	푏	푫	풇	풣	풿	퓛	퓷	픓	픯	핋	핧	햃	햟	햻	헗	헳	혏	혫	홇	홣	홿	횛	횷	훓	훯	휋	휧	흃	흟	흻	힗
ᆷ	㉼	감	갬	걈	걤	검	겜	겸	곔	곰	괌	괨	굄	굠	굼	궘	궴	귐	귬	금	긤	김	깜	깸	꺔	꺰	껌	껨	꼄	꼠	꼼	꽘	꽴	꾐	꾬	꿈	꿤	뀀	뀜	뀸	끔	끰	낌	남	냄	냠	냼	넘	넴	념	녬	놈	놤	뇀	뇜	뇸	눔	눰	뉌	뉨	늄	늠	늼	님	담	댐	댬	덈	덤	뎀	뎜	뎸	돔	돰	됌	됨	둄	둠	둼	뒘	뒴	듐	듬	딈	딤	땀	땜	땸	떔	떰	뗌	뗨	똄	똠	똼	뙘	뙴	뚐	뚬	뛈	뛤	뜀	뜜	뜸	띔	띰	람	램	럄	럠	럼	렘	렴	롐	롬	뢈	뢤	룀	룜	룸	뤔	뤰	륌	륨	름	릠	림	맘	맴	먐	먬	멈	멤	몀	몜	몸	뫔	뫰	묌	묨	뭄	뭠	뭼	뮘	뮴	믐	믬	밈	밤	뱀	뱜	뱸	범	벰	볌	볨	봄	봠	봼	뵘	뵴	붐	붬	뷈	뷤	븀	븜	븸	빔	빰	뺌	뺨	뻄	뻠	뻼	뼘	뼴	뽐	뽬	뾈	뾤	뿀	뿜	뿸	쀔	쀰	쁌	쁨	삄	삠	삼	샘	샴	섐	섬	셈	셤	솀	솜	솸	쇔	쇰	숌	숨	쉄	쉠	쉼	슘	슴	싐	심	쌈	쌤	썀	썜	썸	쎔	쎰	쏌	쏨	쐄	쐠	쐼	쑘	쑴	쒐	쒬	쓈	쓤	씀	씜	씸	암	앰	얌	얨	엄	엠	염	옘	옴	왐	왬	욈	욤	움	웜	웸	윔	윰	음	읨	임	잠	잼	쟘	쟴	점	젬	졈	졤	좀	좜	좸	죔	죰	줌	줨	쥄	쥠	쥼	즘	즴	짐	짬	쨈	쨤	쩀	쩜	쩸	쪔	쪰	쫌	쫨	쬄	쬠	쬼	쭘	쭴	쮐	쮬	쯈	쯤	찀	찜	참	챔	챰	첌	첨	쳄	쳠	쳼	촘	촴	쵐	쵬	춈	춤	췀	췜	췸	츔	츰	칌	침	캄	캠	캼	컘	컴	켐	켬	콈	콤	쾀	쾜	쾸	쿔	쿰	퀌	퀨	큄	큠	큼	킘	킴	탐	탬	턈	턤	텀	템	텸	톔	톰	퇌	퇨	툄	툠	툼	퉘	퉴	튐	튬	틈	틤	팀	팜	팸	퍔	퍰	펌	펨	폄	폠	폼	퐘	퐴	푐	푬	품	풤	퓀	퓜	퓸	픔	픰	핌	함	햄	햠	햼	험	헴	혐	혬	홈	홤	횀	횜	횸	훔	훰	휌	휨	흄	흠	흼	힘
ᆸ	갑	갭	걉	걥	겁	겝	겹	곕	곱	괍	괩	굅	굡	굽	궙	궵	귑	귭	급	긥	깁	깝	깹	꺕	꺱	껍	껩	꼅	꼡	꼽	꽙	꽵	꾑	꾭	꿉	꿥	뀁	뀝	뀹	끕	끱	낍	납	냅	냡	냽	넙	넵	녑	녭	놉	놥	뇁	뇝	뇹	눕	눱	뉍	뉩	늅	늡	늽	닙	답	댑	댭	덉	덥	뎁	뎝	뎹	돕	돱	됍	됩	둅	둡	둽	뒙	뒵	듑	듭	딉	딥	땁	땝	땹	떕	떱	뗍	뗩	똅	똡	똽	뙙	뙵	뚑	뚭	뛉	뛥	뜁	뜝	뜹	띕	띱	랍	랩	럅	럡	럽	렙	렵	롑	롭	뢉	뢥	룁	룝	룹	뤕	뤱	륍	륩	릅	릡	립	맙	맵	먑	먭	멉	멥	몁	몝	몹	뫕	뫱	묍	묩	뭅	뭡	뭽	뮙	뮵	믑	믭	밉	밥	뱁	뱝	뱹	법	벱	볍	볩	봅	봡	봽	뵙	뵵	붑	붭	뷉	뷥	븁	븝	븹	빕	빱	뺍	뺩	뻅	뻡	뻽	뼙	뼵	뽑	뽭	뾉	뾥	뿁	뿝	뿹	쀕	쀱	쁍	쁩	삅	삡	삽	샙	샵	섑	섭	셉	셥	솁	솝	솹	쇕	쇱	숍	숩	쉅	쉡	쉽	슙	습	싑	십	쌉	쌥	썁	썝	썹	쎕	쎱	쏍	쏩	쐅	쐡	쐽	쑙	쑵	쒑	쒭	쓉	쓥	씁	씝	씹	압	앱	얍	얩	업	엡	엽	옙	옵	왑	왭	욉	욥	웁	웝	웹	윕	윱	읍	읩	입	잡	잽	쟙	쟵	접	젭	졉	졥	좁	좝	좹	죕	죱	줍	줩	쥅	쥡	쥽	즙	즵	집	짭	쨉	쨥	쩁	쩝	쩹	쪕	쪱	쫍	쫩	쬅	쬡	쬽	쭙	쭵	쮑	쮭	쯉	쯥	찁	찝	찹	챕	챱	첍	첩	쳅	쳡	쳽	촙	촵	쵑	쵭	춉	춥	췁	췝	췹	츕	츱	칍	칩	캅	캡	캽	컙	컵	켑	켭	콉	콥	쾁	쾝	쾹	쿕	쿱	퀍	퀩	큅	큡	큽	킙	킵	탑	탭	턉	턥	텁	텝	텹	톕	톱	퇍	퇩	툅	툡	툽	퉙	퉵	튑	튭	틉	틥	팁	팝	팹	퍕	퍱	펍	펩	폅	폡	폽	퐙	퐵	푑	푭	풉	풥	퓁	퓝	퓹	픕	픱	핍	합	햅	햡	햽	헙	헵	협	혭	홉	홥	횁	횝	횹	훕	훱	휍	휩	흅	흡	흽	힙
ᆹ	값	갮	걊	걦	겂	겞	겺	곖	곲	괎	괪	굆	굢	굾	궚	궶	귒	귮	긊	긦	깂	깞	깺	꺖	꺲	껎	껪	꼆	꼢	꼾	꽚	꽶	꾒	꾮	꿊	꿦	뀂	뀞	뀺	끖	끲	낎	낪	냆	냢	냾	넚	넶	녒	녮	놊	놦	뇂	뇞	뇺	눖	눲	뉎	뉪	늆	늢	늾	닚	닶	댒	댮	덊	덦	뎂	뎞	뎺	돖	돲	됎	됪	둆	둢	둾	뒚	뒶	듒	듮	딊	딦	땂	땞	땺	떖	떲	뗎	뗪	똆	똢	똾	뙚	뙶	뚒	뚮	뛊	뛦	뜂	뜞	뜺	띖	띲	랎	랪	럆	럢	럾	렚	렶	롒	롮	뢊	뢦	룂	룞	룺	뤖	뤲	륎	륪	릆	릢	릾	맚	맶	먒	먮	멊	멦	몂	몞	몺	뫖	뫲	묎	묪	뭆	뭢	뭾	뮚	뮶	믒	믮	밊	밦	뱂	뱞	뱺	벖	벲	볎	볪	봆	봢	봾	뵚	뵶	붒	붮	뷊	뷦	븂	븞	븺	빖	빲	뺎	뺪	뻆	뻢	뻾	뼚	뼶	뽒	뽮	뾊	뾦	뿂	뿞	뿺	쀖	쀲	쁎	쁪	삆	삢	삾	샚	샶	섒	섮	셊	셦	솂	솞	솺	쇖	쇲	숎	숪	쉆	쉢	쉾	슚	슶	싒	싮	쌊	쌦	썂	썞	썺	쎖	쎲	쏎	쏪	쐆	쐢	쐾	쑚	쑶	쒒	쒮	쓊	쓦	씂	씞	씺	앖	앲	얎	얪	없	엢	엾	옚	옶	왒	왮	욊	욦	웂	웞	웺	윖	윲	읎	읪	잆	잢	잾	쟚	쟶	젒	젮	졊	졦	좂	좞	좺	죖	죲	줎	줪	쥆	쥢	쥾	즚	즶	짒	짮	쨊	쨦	쩂	쩞	쩺	쪖	쪲	쫎	쫪	쬆	쬢	쬾	쭚	쭶	쮒	쮮	쯊	쯦	찂	찞	찺	챖	챲	첎	첪	쳆	쳢	쳾	촚	촶	쵒	쵮	춊	춦	췂	췞	췺	츖	츲	칎	칪	캆	캢	캾	컚	컶	켒	켮	콊	콦	쾂	쾞	쾺	쿖	쿲	퀎	퀪	큆	큢	큾	킚	킶	탒	탮	턊	턦	텂	텞	텺	톖	톲	퇎	퇪	툆	툢	툾	퉚	퉶	튒	튮	틊	틦	팂	팞	팺	퍖	퍲	펎	펪	폆	폢	폾	퐚	퐶	푒	푮	풊	풦	퓂	퓞	퓺	픖	픲	핎	핪	햆	햢	햾	헚	헶	혒	혮	홊	홦	횂	횞	횺	훖	훲	휎	휪	흆	흢	흾	힚
ᆺ	갓	갯	걋	걧	것	겟	겻	곗	곳	괏	괫	굇	굣	굿	궛	궷	귓	귯	긋	긧	깃	깟	깻	꺗	꺳	껏	껫	꼇	꼣	꼿	꽛	꽷	꾓	꾯	꿋	꿧	뀃	뀟	뀻	끗	끳	낏	낫	냇	냣	냿	넛	넷	녓	녯	놋	놧	뇃	뇟	뇻	눗	눳	뉏	뉫	늇	늣	늿	닛	닷	댓	댯	덋	덧	뎃	뎟	뎻	돗	돳	됏	됫	둇	둣	둿	뒛	뒷	듓	듯	딋	딧	땃	땟	땻	떗	떳	뗏	뗫	똇	똣	똿	뙛	뙷	뚓	뚯	뛋	뛧	뜃	뜟	뜻	띗	띳	랏	랫	럇	럣	럿	렛	렷	롓	롯	뢋	뢧	룃	룟	룻	뤗	뤳	륏	륫	릇	릣	릿	맛	맷	먓	먯	멋	멧	몃	몟	못	뫗	뫳	묏	묫	뭇	뭣	뭿	뮛	뮷	믓	믯	밋	밧	뱃	뱟	뱻	벗	벳	볏	볫	봇	봣	봿	뵛	뵷	붓	붯	뷋	뷧	븃	븟	븻	빗	빳	뺏	뺫	뻇	뻣	뻿	뼛	뼷	뽓	뽯	뾋	뾧	뿃	뿟	뿻	쀗	쀳	쁏	쁫	삇	삣	삿	샛	샷	섓	섯	셋	셧	솃	솟	솻	쇗	쇳	숏	숫	쉇	쉣	쉿	슛	슷	싓	싯	쌋	쌧	썃	썟	썻	쎗	쎳	쏏	쏫	쐇	쐣	쐿	쑛	쑷	쒓	쒯	쓋	쓧	씃	씟	씻	앗	앳	얏	얫	엇	엣	엿	옛	옷	왓	왯	욋	욧	웃	웟	웻	윗	윳	읏	읫	잇	잣	잿	쟛	쟷	젓	젯	졋	졧	좃	좟	좻	죗	죳	줏	줫	쥇	쥣	쥿	즛	즷	짓	짯	쨋	쨧	쩃	쩟	쩻	쪗	쪳	쫏	쫫	쬇	쬣	쬿	쭛	쭷	쮓	쮯	쯋	쯧	찃	찟	찻	챗	챳	첏	첫	쳇	쳣	쳿	촛	촷	쵓	쵯	춋	춧	췃	췟	췻	츗	츳	칏	칫	캇	캣	캿	컛	컷	켓	켯	콋	콧	쾃	쾟	쾻	쿗	쿳	퀏	퀫	큇	큣	큿	킛	킷	탓	탯	턋	턧	텃	텟	텻	톗	톳	퇏	퇫	툇	툣	툿	퉛	퉷	튓	튯	틋	틧	팃	팟	팻	퍗	퍳	펏	펫	폇	폣	폿	퐛	퐷	푓	푯	풋	풧	퓃	퓟	퓻	픗	픳	핏	핫	햇	햣	햿	헛	헷	혓	혯	홋	홧	횃	횟	횻	훗	훳	휏	휫	흇	흣	흿	힛
ᆻ	갔	갰	걌	걨	겄	겠	겼	곘	곴	괐	괬	굈	굤	궀	궜	궸	귔	귰	긌	긨	깄	깠	깼	꺘	꺴	껐	껬	꼈	꼤	꽀	꽜	꽸	꾔	꾰	꿌	꿨	뀄	뀠	뀼	끘	끴	낐	났	냈	냤	넀	넜	넸	녔	녰	놌	놨	뇄	뇠	뇼	눘	눴	뉐	뉬	늈	늤	닀	닜	닸	댔	댰	덌	덨	뎄	뎠	뎼	돘	돴	됐	됬	둈	둤	뒀	뒜	뒸	듔	듰	딌	딨	땄	땠	땼	떘	떴	뗐	뗬	똈	똤	뙀	뙜	뙸	뚔	뚰	뛌	뛨	뜄	뜠	뜼	띘	띴	랐	랬	럈	럤	렀	렜	렸	롔	롰	뢌	뢨	룄	룠	룼	뤘	뤴	륐	륬	릈	릤	맀	맜	맸	먔	먰	멌	멨	몄	몠	몼	뫘	뫴	묐	묬	뭈	뭤	뮀	뮜	뮸	믔	믰	밌	밨	뱄	뱠	뱼	벘	벴	볐	볬	봈	봤	뵀	뵜	뵸	붔	붰	뷌	뷨	븄	븠	븼	빘	빴	뺐	뺬	뻈	뻤	뼀	뼜	뼸	뽔	뽰	뾌	뾨	뿄	뿠	뿼	쀘	쀴	쁐	쁬	삈	삤	샀	샜	샸	섔	섰	셌	셨	솄	솠	솼	쇘	쇴	숐	숬	쉈	쉤	슀	슜	슸	싔	싰	쌌	쌨	썄	썠	썼	쎘	쎴	쏐	쏬	쐈	쐤	쑀	쑜	쑸	쒔	쒰	쓌	쓨	씄	씠	씼	았	앴	얐	얬	었	엤	였	옜	옸	왔	왰	욌	욨	웄	웠	웼	윘	윴	읐	읬	있	잤	쟀	쟜	쟸	젔	젰	졌	졨	좄	좠	좼	죘	죴	줐	줬	쥈	쥤	즀	즜	즸	짔	짰	쨌	쨨	쩄	쩠	쩼	쪘	쪴	쫐	쫬	쬈	쬤	쭀	쭜	쭸	쮔	쮰	쯌	쯨	찄	찠	찼	챘	챴	첐	첬	쳈	쳤	촀	촜	촸	쵔	쵰	춌	춨	췄	췠	췼	츘	츴	칐	칬	캈	캤	컀	컜	컸	켔	켰	콌	콨	쾄	쾠	쾼	쿘	쿴	퀐	퀬	큈	큤	킀	킜	킸	탔	탰	턌	턨	텄	텠	텼	톘	톴	퇐	퇬	툈	툤	퉀	퉜	퉸	튔	튰	틌	틨	팄	팠	팼	퍘	퍴	펐	펬	폈	폤	퐀	퐜	퐸	푔	푰	풌	풨	퓄	퓠	퓼	픘	픴	핐	핬	했	햤	헀	헜	헸	혔	혰	홌	홨	횄	횠	횼	훘	훴	휐	휬	흈	흤	힀	힜
ᆼ	강	갱	걍	걩	겅	겡	경	곙	공	광	괭	굉	굥	궁	궝	궹	귕	귱	긍	긩	깅	깡	깽	꺙	꺵	껑	껭	꼉	꼥	꽁	꽝	꽹	꾕	꾱	꿍	꿩	뀅	뀡	뀽	끙	끵	낑	낭	냉	냥	넁	넝	넹	녕	녱	농	놩	뇅	뇡	뇽	눙	눵	뉑	뉭	늉	능	닁	닝	당	댕	댱	덍	덩	뎅	뎡	뎽	동	돵	됑	됭	둉	둥	뒁	뒝	뒹	듕	등	딍	딩	땅	땡	땽	떙	떵	뗑	뗭	똉	똥	뙁	뙝	뙹	뚕	뚱	뛍	뛩	뜅	뜡	뜽	띙	띵	랑	랭	량	럥	렁	렝	령	롕	롱	뢍	뢩	룅	룡	룽	뤙	뤵	륑	륭	릉	릥	링	망	맹	먕	먱	멍	멩	명	몡	몽	뫙	뫵	묑	묭	뭉	뭥	뮁	뮝	뮹	믕	믱	밍	방	뱅	뱡	뱽	벙	벵	병	볭	봉	봥	뵁	뵝	뵹	붕	붱	뷍	뷩	븅	븡	븽	빙	빵	뺑	뺭	뻉	뻥	뼁	뼝	뼹	뽕	뽱	뾍	뾩	뿅	뿡	뿽	쀙	쀵	쁑	쁭	삉	삥	상	생	샹	섕	성	셍	셩	솅	송	솽	쇙	쇵	숑	숭	쉉	쉥	슁	슝	승	싕	싱	쌍	쌩	썅	썡	썽	쎙	쎵	쏑	쏭	쐉	쐥	쑁	쑝	쑹	쒕	쒱	쓍	쓩	씅	씡	씽	앙	앵	양	얭	엉	엥	영	옝	옹	왕	왱	욍	용	웅	웡	웽	윙	융	응	읭	잉	장	쟁	쟝	쟹	정	젱	졍	졩	종	좡	좽	죙	죵	중	줭	쥉	쥥	즁	증	즹	징	짱	쨍	쨩	쩅	쩡	쩽	쪙	쪵	쫑	쫭	쬉	쬥	쭁	쭝	쭹	쮕	쮱	쯍	쯩	찅	찡	창	챙	챵	첑	청	쳉	쳥	촁	총	촹	쵕	쵱	춍	충	췅	췡	췽	츙	층	칑	칭	캉	캥	컁	컝	컹	켕	켱	콍	콩	쾅	쾡	쾽	쿙	쿵	퀑	퀭	큉	큥	킁	킝	킹	탕	탱	턍	턩	텅	텡	텽	톙	통	퇑	퇭	툉	툥	퉁	퉝	퉹	튕	튱	틍	틩	팅	팡	팽	퍙	퍵	펑	펭	평	폥	퐁	퐝	퐹	푕	푱	풍	풩	퓅	퓡	퓽	픙	픵	핑	항	행	향	헁	헝	헹	형	혱	홍	황	횅	횡	횽	훙	훵	휑	휭	흉	흥	힁	힝
ᆽ	갖	갲	걎	걪	겆	겢	겾	곚	곶	괒	괮	굊	굦	궂	궞	궺	귖	귲	긎	긪	깆	깢	깾	꺚	꺶	껒	껮	꼊	꼦	꽂	꽞	꽺	꾖	꾲	꿎	꿪	뀆	뀢	뀾	끚	끶	낒	낮	냊	냦	넂	넞	넺	녖	녲	놎	놪	뇆	뇢	뇾	눚	눶	뉒	뉮	늊	늦	닂	닞	닺	댖	댲	덎	덪	뎆	뎢	뎾	돚	돶	됒	됮	둊	둦	뒂	뒞	뒺	듖	듲	딎	딪	땆	땢	땾	떚	떶	뗒	뗮	똊	똦	뙂	뙞	뙺	뚖	뚲	뛎	뛪	뜆	뜢	뜾	띚	띶	랒	랮	럊	럦	렂	렞	렺	롖	롲	뢎	뢪	룆	룢	룾	뤚	뤶	륒	륮	릊	릦	맂	맞	맺	먖	먲	멎	멪	몆	몢	몾	뫚	뫶	묒	묮	뭊	뭦	뮂	뮞	뮺	믖	믲	밎	밪	뱆	뱢	뱾	벚	벶	볒	볮	봊	봦	뵂	뵞	뵺	붖	붲	뷎	뷪	븆	븢	븾	빚	빶	뺒	뺮	뻊	뻦	뼂	뼞	뼺	뽖	뽲	뾎	뾪	뿆	뿢	뿾	쀚	쀶	쁒	쁮	삊	삦	샂	샞	샺	섖	섲	셎	셪	솆	솢	솾	쇚	쇶	숒	숮	쉊	쉦	슂	슞	슺	싖	싲	쌎	쌪	썆	썢	썾	쎚	쎶	쏒	쏮	쐊	쐦	쑂	쑞	쑺	쒖	쒲	쓎	쓪	씆	씢	씾	앚	앶	얒	얮	엊	엦	옂	옞	옺	왖	왲	욎	욪	웆	웢	웾	윚	윶	읒	읮	잊	잦	쟂	쟞	쟺	젖	젲	졎	졪	좆	좢	좾	죚	죶	줒	줮	쥊	쥦	즂	즞	즺	짖	짲	쨎	쨪	쩆	쩢	쩾	쪚	쪶	쫒	쫮	쬊	쬦	쭂	쭞	쭺	쮖	쮲	쯎	쯪	찆	찢	찾	챚	챶	첒	첮	쳊	쳦	촂	촞	촺	쵖	쵲	춎	춪	췆	췢	췾	츚	츶	칒	칮	캊	캦	컂	컞	컺	켖	켲	콎	콪	쾆	쾢	쾾	쿚	쿶	퀒	퀮	큊	큦	킂	킞	킺	탖	탲	턎	턪	텆	텢	텾	톚	톶	퇒	퇮	툊	툦	퉂	퉞	퉺	튖	튲	틎	틪	팆	팢	팾	퍚	퍶	펒	펮	폊	폦	퐂	퐞	퐺	푖	푲	풎	풪	퓆	퓢	퓾	픚	픶	핒	핮	햊	햦	헂	헞	헺	혖	혲	홎	홪	횆	횢	횾	훚	훶	휒	휮	흊	흦	힂	힞
ᆾ	갗	갳	걏	걫	겇	겣	겿	곛	곷	괓	괯	굋	굧	궃	궟	궻	귗	귳	긏	긫	깇	깣	깿	꺛	꺷	껓	껯	꼋	꼧	꽃	꽟	꽻	꾗	꾳	꿏	꿫	뀇	뀣	뀿	끛	끷	낓	낯	냋	냧	넃	넟	넻	녗	녳	놏	놫	뇇	뇣	뇿	눛	눷	뉓	뉯	늋	늧	닃	닟	닻	댗	댳	덏	덫	뎇	뎣	뎿	돛	돷	됓	됯	둋	둧	뒃	뒟	뒻	듗	듳	딏	딫	땇	땣	땿	떛	떷	뗓	뗯	똋	똧	뙃	뙟	뙻	뚗	뚳	뛏	뛫	뜇	뜣	뜿	띛	띷	랓	랯	럋	럧	렃	렟	렻	롗	롳	뢏	뢫	룇	룣	룿	뤛	뤷	륓	륯	릋	릧	맃	맟	맻	먗	먳	멏	멫	몇	몣	몿	뫛	뫷	묓	묯	뭋	뭧	뮃	뮟	뮻	믗	믳	및	밫	뱇	뱣	뱿	벛	벷	볓	볯	봋	봧	뵃	뵟	뵻	붗	붳	뷏	뷫	븇	븣	븿	빛	빷	뺓	뺯	뻋	뻧	뼃	뼟	뼻	뽗	뽳	뾏	뾫	뿇	뿣	뿿	쀛	쀷	쁓	쁯	삋	삧	샃	샟	샻	섗	섳	셏	셫	솇	솣	솿	쇛	쇷	숓	숯	쉋	쉧	슃	슟	슻	싗	싳	쌏	쌫	썇	썣	썿	쎛	쎷	쏓	쏯	쐋	쐧	쑃	쑟	쑻	쒗	쒳	쓏	쓫	씇	씣	씿	앛	앷	얓	얯	엋	엧	옃	옟	옻	왗	왳	욏	욫	웇	웣	웿	윛	윷	읓	읯	잋	잧	쟃	쟟	쟻	젗	젳	졏	졫	좇	좣	좿	죛	죷	줓	줯	쥋	쥧	즃	즟	즻	짗	짳	쨏	쨫	쩇	쩣	쩿	쪛	쪷	쫓	쫯	쬋	쬧	쭃	쭟	쭻	쮗	쮳	쯏	쯫	찇	찣	찿	챛	챷	첓	첯	쳋	쳧	촃	촟	촻	쵗	쵳	춏	춫	췇	췣	췿	츛	츷	칓	칯	캋	캧	컃	컟	컻	켗	켳	콏	콫	쾇	쾣	쾿	쿛	쿷	퀓	퀯	큋	큧	킃	킟	킻	탗	탳	턏	턫	텇	텣	텿	톛	톷	퇓	퇯	툋	툧	퉃	퉟	퉻	튗	튳	틏	틫	팇	팣	팿	퍛	퍷	펓	펯	폋	폧	퐃	퐟	퐻	푗	푳	풏	풫	퓇	퓣	퓿	픛	픷	핓	핯	햋	햧	헃	헟	헻	혗	혳	홏	홫	횇	횣	횿	훛	훷	휓	휯	흋	흧	힃	힟
ᆿ	갘	갴	걐	걬	겈	겤	곀	곜	곸	괔	괰	굌	굨	궄	궠	궼	귘	귴	긐	긬	깈	깤	꺀	꺜	꺸	껔	껰	꼌	꼨	꽄	꽠	꽼	꾘	꾴	꿐	꿬	뀈	뀤	끀	끜	끸	낔	낰	냌	냨	넄	넠	넼	녘	녴	놐	놬	뇈	뇤	눀	눜	눸	뉔	뉰	늌	늨	닄	닠	닼	댘	댴	덐	덬	뎈	뎤	돀	돜	돸	됔	됰	둌	둨	뒄	뒠	뒼	듘	듴	딐	딬	땈	땤	떀	떜	떸	뗔	뗰	똌	똨	뙄	뙠	뙼	뚘	뚴	뛐	뛬	뜈	뜤	띀	띜	띸	랔	랰	럌	럨	렄	렠	렼	롘	롴	뢐	뢬	룈	룤	뤀	뤜	뤸	륔	륰	릌	릨	맄	맠	맼	먘	먴	멐	멬	몈	몤	뫀	뫜	뫸	묔	묰	뭌	뭨	뮄	뮠	뮼	믘	믴	밐	밬	뱈	뱤	벀	벜	벸	볔	볰	봌	봨	뵄	뵠	뵼	붘	붴	뷐	뷬	븈	븤	빀	빜	빸	뺔	뺰	뻌	뻨	뼄	뼠	뼼	뽘	뽴	뾐	뾬	뿈	뿤	쀀	쀜	쀸	쁔	쁰	삌	삨	샄	샠	샼	섘	섴	셐	셬	솈	솤	쇀	쇜	쇸	숔	숰	쉌	쉨	슄	슠	슼	싘	싴	쌐	쌬	썈	썤	쎀	쎜	쎸	쏔	쏰	쐌	쐨	쑄	쑠	쑼	쒘	쒴	쓐	쓬	씈	씤	앀	앜	앸	얔	얰	엌	엨	옄	옠	옼	왘	왴	욐	욬	웈	웤	윀	윜	윸	읔	읰	잌	잨	쟄	쟠	쟼	젘	젴	졐	졬	좈	좤	죀	죜	죸	줔	줰	쥌	쥨	즄	즠	즼	짘	짴	쨐	쨬	쩈	쩤	쪀	쪜	쪸	쫔	쫰	쬌	쬨	쭄	쭠	쭼	쮘	쮴	쯐	쯬	찈	찤	챀	챜	챸	첔	첰	쳌	쳨	촄	촠	촼	쵘	쵴	춐	춬	췈	췤	츀	츜	츸	칔	칰	캌	캨	컄	컠	컼	켘	켴	콐	콬	쾈	쾤	쿀	쿜	쿸	퀔	퀰	큌	큨	킄	킠	킼	탘	탴	턐	턬	텈	텤	톀	톜	톸	퇔	퇰	툌	툨	퉄	퉠	퉼	튘	튴	틐	틬	팈	팤	퍀	퍜	퍸	펔	펰	폌	폨	퐄	퐠	퐼	푘	푴	풐	풬	퓈	퓤	픀	픜	픸	핔	핰	햌	햨	헄	헠	헼	혘	혴	홐	홬	횈	횤	훀	훜	훸	휔	휰	흌	흨	힄	힠
ᇀ	같	갵	걑	걭	겉	겥	곁	곝	곹	괕	괱	굍	굩	궅	궡	궽	귙	귵	긑	긭	깉	깥	꺁	꺝	꺹	껕	껱	꼍	꼩	꽅	꽡	꽽	꾙	꾵	꿑	꿭	뀉	뀥	끁	끝	끹	낕	낱	냍	냩	넅	넡	넽	녙	녵	놑	놭	뇉	뇥	눁	눝	눹	뉕	뉱	늍	늩	닅	닡	닽	댙	댵	덑	덭	뎉	뎥	돁	돝	돹	됕	됱	둍	둩	뒅	뒡	뒽	듙	듵	딑	딭	땉	땥	떁	떝	떹	뗕	뗱	똍	똩	뙅	뙡	뙽	뚙	뚵	뛑	뛭	뜉	뜥	띁	띝	띹	랕	랱	럍	럩	렅	렡	렽	롙	롵	뢑	뢭	룉	룥	뤁	뤝	뤹	륕	륱	릍	릩	맅	맡	맽	먙	먵	멑	멭	몉	몥	뫁	뫝	뫹	묕	묱	뭍	뭩	뮅	뮡	뮽	믙	믵	밑	밭	뱉	뱥	벁	벝	벹	볕	볱	봍	봩	뵅	뵡	뵽	붙	붵	뷑	뷭	븉	븥	빁	빝	빹	뺕	뺱	뻍	뻩	뼅	뼡	뼽	뽙	뽵	뾑	뾭	뿉	뿥	쀁	쀝	쀹	쁕	쁱	삍	삩	샅	샡	샽	섙	섵	셑	셭	솉	솥	쇁	쇝	쇹	숕	숱	쉍	쉩	슅	슡	슽	싙	싵	쌑	쌭	썉	썥	쎁	쎝	쎹	쏕	쏱	쐍	쐩	쑅	쑡	쑽	쒙	쒵	쓑	쓭	씉	씥	앁	앝	앹	얕	얱	엍	엩	옅	옡	옽	왙	왵	욑	욭	웉	웥	윁	윝	윹	읕	읱	잍	잩	쟅	쟡	쟽	젙	젵	졑	졭	좉	좥	죁	죝	죹	줕	줱	쥍	쥩	즅	즡	즽	짙	짵	쨑	쨭	쩉	쩥	쪁	쪝	쪹	쫕	쫱	쬍	쬩	쭅	쭡	쭽	쮙	쮵	쯑	쯭	찉	찥	챁	챝	챹	첕	첱	쳍	쳩	촅	촡	촽	쵙	쵵	춑	춭	췉	췥	츁	츝	츹	칕	칱	캍	캩	컅	컡	컽	켙	켵	콑	콭	쾉	쾥	쿁	쿝	쿹	퀕	퀱	큍	큩	킅	킡	킽	탙	탵	턑	턭	텉	텥	톁	톝	톹	퇕	퇱	툍	툩	퉅	퉡	퉽	튙	튵	틑	틭	팉	팥	퍁	퍝	퍹	펕	펱	폍	폩	퐅	퐡	퐽	푙	푵	풑	풭	퓉	퓥	픁	픝	픹	핕	핱	햍	햩	헅	헡	헽	혙	혵	홑	홭	횉	횥	훁	훝	훹	휕	휱	흍	흩	힅	힡
ᇁ	갚	갶	걒	걮	겊	겦	곂	곞	곺	괖	괲	굎	굪	궆	궢	궾	귚	귶	긒	긮	깊	깦	꺂	꺞	꺺	껖	껲	꼎	꼪	꽆	꽢	꽾	꾚	꾶	꿒	꿮	뀊	뀦	끂	끞	끺	낖	낲	냎	냪	넆	넢	넾	녚	녶	높	놮	뇊	뇦	눂	눞	눺	뉖	뉲	늎	늪	닆	닢	닾	댚	댶	덒	덮	뎊	뎦	돂	돞	돺	됖	됲	둎	둪	뒆	뒢	뒾	듚	듶	딒	딮	땊	땦	떂	떞	떺	뗖	뗲	똎	똪	뙆	뙢	뙾	뚚	뚶	뛒	뛮	뜊	뜦	띂	띞	띺	랖	랲	럎	럪	렆	렢	렾	롚	롶	뢒	뢮	룊	룦	뤂	뤞	뤺	륖	륲	릎	릪	맆	맢	맾	먚	먶	멒	멮	몊	몦	뫂	뫞	뫺	묖	묲	뭎	뭪	뮆	뮢	뮾	믚	믶	밒	밮	뱊	뱦	벂	벞	벺	볖	볲	봎	봪	뵆	뵢	뵾	붚	붶	뷒	뷮	븊	븦	빂	빞	빺	뺖	뺲	뻎	뻪	뼆	뼢	뼾	뽚	뽶	뾒	뾮	뿊	뿦	쀂	쀞	쀺	쁖	쁲	삎	삪	샆	샢	샾	섚	섶	셒	셮	솊	솦	쇂	쇞	쇺	숖	숲	쉎	쉪	슆	슢	슾	싚	싶	쌒	쌮	썊	썦	쎂	쎞	쎺	쏖	쏲	쐎	쐪	쑆	쑢	쑾	쒚	쒶	쓒	쓮	씊	씦	앂	앞	앺	얖	얲	엎	엪	옆	옢	옾	왚	왶	욒	욮	웊	웦	윂	윞	윺	읖	읲	잎	잪	쟆	쟢	쟾	젚	젶	졒	졮	좊	좦	죂	죞	죺	줖	줲	쥎	쥪	즆	즢	즾	짚	짶	쨒	쨮	쩊	쩦	쪂	쪞	쪺	쫖	쫲	쬎	쬪	쭆	쭢	쭾	쮚	쮶	쯒	쯮	찊	찦	챂	챞	챺	첖	첲	쳎	쳪	촆	촢	촾	쵚	쵶	춒	춮	췊	췦	츂	츞	츺	칖	칲	캎	캪	컆	컢	컾	켚	켶	콒	콮	쾊	쾦	쿂	쿞	쿺	퀖	퀲	큎	큪	킆	킢	킾	탚	탶	턒	턮	텊	텦	톂	톞	톺	퇖	퇲	툎	툪	퉆	퉢	퉾	튚	튶	틒	틮	팊	팦	퍂	퍞	퍺	펖	펲	폎	폪	퐆	퐢	퐾	푚	푶	풒	풮	퓊	퓦	픂	픞	픺	핖	핲	햎	햪	헆	헢	헾	혚	혶	홒	홮	횊	횦	훂	훞	훺	휖	휲	흎	흪	힆	힢
ᇂ	갛	갷	걓	걯	겋	겧	곃	곟	곻	괗	괳	굏	굫	궇	궣	궿	귛	귷	긓	긯	깋	깧	꺃	꺟	꺻	껗	껳	꼏	꼫	꽇	꽣	꽿	꾛	꾷	꿓	꿯	뀋	뀧	끃	끟	끻	낗	낳	냏	냫	넇	넣	넿	녛	녷	놓	놯	뇋	뇧	눃	눟	눻	뉗	뉳	늏	늫	닇	닣	닿	댛	댷	덓	덯	뎋	뎧	돃	돟	돻	됗	됳	둏	둫	뒇	뒣	뒿	듛	듷	딓	딯	땋	땧	떃	떟	떻	뗗	뗳	똏	똫	뙇	뙣	뙿	뚛	뚷	뛓	뛯	뜋	뜧	띃	띟	띻	랗	랳	럏	럫	렇	렣	렿	롛	롷	뢓	뢯	룋	룧	뤃	뤟	뤻	륗	륳	릏	릫	맇	맣	맿	먛	먷	멓	멯	몋	몧	뫃	뫟	뫻	묗	묳	뭏	뭫	뮇	뮣	뮿	믛	믷	밓	밯	뱋	뱧	벃	벟	벻	볗	볳	봏	봫	뵇	뵣	뵿	붛	붷	뷓	뷯	븋	븧	빃	빟	빻	뺗	뺳	뻏	뻫	뼇	뼣	뼿	뽛	뽷	뾓	뾯	뿋	뿧	쀃	쀟	쀻	쁗	쁳	삏	삫	샇	샣	샿	섛	섷	셓	셯	솋	솧	쇃	쇟	쇻	숗	숳	쉏	쉫	슇	슣	슿	싛	싷	쌓	쌯	썋	썧	쎃	쎟	쎻	쏗	쏳	쐏	쐫	쑇	쑣	쑿	쒛	쒷	쓓	쓯	씋	씧	앃	앟	앻	얗	얳	엏	엫	옇	옣	옿	왛	왷	욓	욯	웋	웧	윃	윟	윻	읗	읳	잏	잫	쟇	쟣	쟿	젛	젷	졓	졯	좋	좧	죃	죟	죻	줗	줳	쥏	쥫	즇	즣	즿	짛	짷	쨓	쨯	쩋	쩧	쪃	쪟	쪻	쫗	쫳	쬏	쬫	쭇	쭣	쭿	쮛	쮷	쯓	쯯	찋	찧	챃	챟	챻	첗	첳	쳏	쳫	촇	촣	촿	쵛	쵷	춓	춯	췋	췧	츃	츟	츻	칗	칳	캏	캫	컇	컣	컿	켛	켷	콓	콯	쾋	쾧	쿃	쿟	쿻	퀗	퀳	큏	큫	킇	킣	킿	탛	탷	턓	턯	텋	텧	톃	톟	톻	퇗	퇳	툏	툫	퉇	퉣	퉿	튛	튷	틓	틯	팋	팧	퍃	퍟	퍻	펗	펳	폏	폫	퐇	퐣	퐿	푛	푷	풓	풯	퓋	퓧	픃	픟	픻	핗	핳	햏	햫	헇	헣	헿	혛	혷	홓	홯	횋	횧	훃	훟	훻	휗	휳	흏	흫	힇	힣
ᇇ	ㅧ
ᇈ	ㅨ
ᇌ	ㅩ
ᇎ	ㅪ
ᇓ	ㅫ
ᇗ	ㅬ
ᇙ	ㅭ
ᇝ	ㅯ
ᇟ	ㅰ
ᇱ	ㆂ
ᇲ	ㆃ
ᬅ	ᬆ
ᬇ	ᬈ
ᬉ	ᬊ
ᬋ	ᬌ
ᬍ	ᬎ
ᬑ	ᬒ
ᬵ	ᬆ	ᬈ	ᬊ	ᬌ	ᬎ	ᬒ	ᬻ	ᬽ	ᭀ	ᭁ	ᭃ
ᬺ	ᬻ
ᬼ	ᬽ
ᬾ	ᭀ
ᬿ	ᭁ
ᭂ	ᭃ
ᴂ	ᵆ
ᴖ	ᵔ
ᴗ	ᵕ
ᴜ	ᶸ
ᴝ	ᵙ
ᴥ	ᵜ
ᵻ	ᶧ
ᶅ	ᶪ
ᶑ	𐞍
‐	‑
–	︲
—	︱	﹘
′	″	‴	⁗
‵	‶	‷
⁄	¼	½	¾	⅐	⅑	⅒	⅓	⅔	⅕	⅖	⅗	⅘	⅙	⅚	⅛	⅜	⅝	⅞	⅟	↉
₩	￦
←	↚	￩
↑	￪
→	↛	￫
↓	￬
↔	↮
⇐	⇍
⇒	⇏
⇔	⇎
∂	𝛛	𝜕	𝝏	𝞉	𝟃
∃	∄
∇	𝛁	𝛻	𝜵	𝝯	𝞩
∈	∉
∋	∌
∑	⅀
−	⁻	₋
∕	㎧	㎨	㎮	㎯	㏆	㏞	㏟
∣	∤
∥	∦
∫	∬	∭	⨌
∮	∯	∰
∼	≁
≃	≄
≅	≇
≈	≉
≍	≭
≡	≢
≤	≰
≥	≱
≲	≴
≳	≵
≶	≸
≷	≹
≺	⊀
≻	⊁
≼	⋠
≽	⋡
⊂	⊄
⊃	⊅
⊆	⊈
⊇	⊉
⊑	⋢
⊒	⋣
⊢	⊬
⊨	⊭
⊩	⊮
⊫	⊯
⊲	⋪
⊳	⋫
⊴	⋬
⊵	⋭
│	￨
■	￭
○	￮
⦅	｟
⦆	｠
⫝	⫝̸
ⱱ	𐞰
ⵡ	ⵯ
、	︑	﹑	､
。	︒	｡
〈	〈	︿
〉	〉	﹀
《	︽
》	︾
「	﹁	｢
」	﹂	｣
『	﹃
』	﹄
【	︻
】	︼
〒	〶
〔	︹	﹝	🄪	🉀	🉁	🉂	🉃	🉄	🉅	🉆	🉇	🉈
〕	︺	﹞	🄪	🉀	🉁	🉂	🉃	🉄	🉅	🉆	🉇	🉈
〖	︗
〗	︘
う	ゔ
か	が	🈀
き	ぎ
く	ぐ
け	げ
こ	ご
さ	ざ
し	じ
す	ず
せ	ぜ
そ	ぞ
た	だ
ち	ぢ
つ	づ
て	で
と	ど
は	ば	ぱ
ひ	び	ぴ
ふ	ぶ	ぷ
へ	べ	ぺ
ほ	ぼ	ぽ	🈀
よ	ゟ
り	ゟ
゙	が	ぎ	ぐ	げ	ご	ざ	じ	ず	ぜ	ぞ	だ	ぢ	づ	で	ど	ば	び	ぶ	べ	ぼ	ゔ	゛	ゞ	ガ	ギ	グ	ゲ	ゴ	ザ	ジ	ズ	ゼ	ゾ	ダ	ヂ	ヅ	デ	ド	バ	ビ	ブ	ベ	ボ	ヴ	ヷ	ヸ	ヹ	ヺ	ヾ	㌄	㌇	㌎	㌏	㌐	㌑	㌓	㌕	㌘	㌙	㌚	㌡	㌤	㌥	㌦	㌭	㌱	㌲	㌴	㌻	㌼	㌾	㍀	㍊	㍋	㍌	㍎	㍔	㍖	ﾞ	🈓
゚	ぱ	ぴ	ぷ	ぺ	ぽ	゜	パ	ピ	プ	ペ	ポ	㌀	㌂	㌞	㌫	㌬	㌮	㌯	㌰	㌷	㌸	㌺	㌻	㌽	㍀	㍓	ﾟ
ゝ	ゞ
ァ	㌁	㌲	ｧ
ア	㋐	㌀	㌁	㌂	㌃	㌮	㍐	ｱ
ィ	㌳	ｨ
イ	㋑	㌄	㌅	㌋	㌚	㌟	㌪	㌽	㍃	㍄	ｲ
ゥ	ｩ
ウ	ヴ	㋒	㌆	ｳ
ェ	㌴	ｪ
エ	㋓	㌇	㌈	ｴ
ォ	㌆	ｫ
オ	㋔	㌉	㌊	ｵ
カ	ガ	㋕	㌈	㌋	㌌	㌍	㌎	㌏	㌐	㍋	㍌	ｶ
キ	ギ	㋖	㌐	㌑	㌒	㌓	㌔	㌕	㌖	㌗	ｷ
ク	グ	㋗	㌄	㌇	㌕	㌘	㌙	㌚	㌛	㌟	㌡	㌯	㌶	㍃	㍆	㍈	ｸ
ケ	ゲ	㋘	㌜	㍖	ｹ
コ	ゴ	ヿ	㋙	㌝	㌞	㌰	ｺ	🈁
サ	ザ	㋚	㌟	㌠	ｻ	🈂
シ	ジ	㋛	㌡	㌥	㌴	㌻	㍇	ｼ
ス	ズ	㋜	㌇	㌉	㌜	㌤	㌮	㌺	ｽ
セ	ゼ	㋝	㌚	㌢	㌣	㌫	ｾ
ソ	ゾ	㋞	㌷	ｿ
タ	ダ	㋟	㌓	㌤	㌶	㌼	ﾀ
チ	ヂ	㋠	㌅	㌠	㌢	ﾁ
ッ	㌌	㌗	㌩	㌲	㌴	㍅	㍑	㍗	ｯ
ツ	ヅ	㋡	㌪	㌬	㌹	ﾂ
テ	デ	㋢	㌥	ﾃ	🈓
ト	ド	ヿ	㋣	㌀	㌇	㌌	㌖	㌗	㌙	㌣	㌦	㌧	㌩	㌫	㌮	㌲	㌳	㌽	㌾	㍀	㍌	㍍	㍎	㍑	㍖	㍗	ﾄ
ナ	㋤	㌝	㌨	ﾅ
ニ	㋥	㌄	㌑	㌸	ﾆ
ヌ	㋦	ﾇ
ネ	㋧	㌛	ﾈ
ノ	㋨	㌨	㌩	ﾉ
ハ	バ	パ	㋩	㌀	㌪	㌫	㌬	㌭	㍅	㍊	ﾊ
ヒ	ビ	ピ	㋪	㌮	㌯	㌰	㌱	㌸	㍓	ﾋ
フ	ブ	プ	㋫	㌁	㌲	㌳	㌴	㌵	㍔	ﾌ
ヘ	ベ	ペ	㋬	㌂	㌶	㌷	㌸	㌹	㌺	㌻	㌼	ﾍ
ホ	ボ	ポ	㋭	㌞	㌽	㌾	㌿	㍀	㍁	㍂	ﾎ
マ	㋮	㌏	㍃	㍄	㍅	㍆	㍇	ﾏ
ミ	㋯	㍈	㍉	㍊	ﾐ
ム	㋰	㌊	㌕	㌘	㌙	㌠	㍕	ﾑ
メ	㋱	㌖	㍋	㍌	㍍	ﾒ
モ	㋲	ﾓ
ャ	ｬ
ヤ	㋳	㍎	㍏	ﾔ
ュ	㌒	ｭ
ユ	㋴	㍐	ﾕ
ョ	㍇	ｮ
ヨ	㋵	ﾖ
ラ	㋶	㌌	㌕	㌘	㌙	㌲	㌵	㍒	ﾗ
リ	㋷	㌋	㌍	㌒	㌡	㍉	㍊	㍑	㍒	ﾘ
ル	㋸	㌁	㌃	㌓	㌖	㌚	㌝	㌟	㌦	㌭	㌮	㌯	㌱	㌴	㌶	㌹	㌾	㍁	㍄	㍆	㍊	㍍	㍏	㍑	㍓	㍔	ﾙ
レ	㋹	㌭	㍕	㍖	ﾚ
ロ	㋺	㌍	㌎	㌔	㌕	㌖	㌗	㌚	㌛	㍃	㍈	ﾛ
ワ	ヷ	㋻	㌗	㍗	ﾜ
ヰ	ヸ	㋼
ヱ	ヹ	㋽
ヲ	ヺ	㋾	ｦ
ン	㌂	㌄	㌅	㌆	㌉	㌎	㌏	㌙	㌠	㌡	㌢	㌣	㌧	㌫	㌵	㌺	㌽	㌿	㍀	㍂	㍇	㍈	㍌	㍐	㍖	ﾝ
・	･
ー	㌀	㌃	㌇	㌈	㌊	㌍	㌑	㌒	㌓	㌖	㌛	㌜	㌞	㌠	㌤	㌫	㌬	㌭	㌳	㌶	㌻	㌼	㍁	㍂	㍊	㍍	㍎	㍏	㍓	㍔	ｰ
ヽ	ヾ
㒞	㒞
㒹	㒹
㒻	㒻
㓟	㓟
㔕	㔕
㛮	㛮
㛼	㛼
㞁	㞁
㠯	㠯
㡢	㡢
㡼	㡼
㣇	㣇
㣣	㣣
㤜	㤜
㤺	㤺
㨮	㨮
㩬	㩬
㫤	㫤
㬈	㬈
㬙	㬙
㭉	㭉
㮝	㮝	㮝
㰘	㰘
㱎	㱎
㴳	㴳
㶖	㶖
㺬	㺬
㺸	㺸	㺸
㼛	㼛
㿼	㿼
䀈	䀈
䀘	䀘
䀹	䀹	䀹
䁆	䁆
䂖	䂖
䃣	䃣
䄯	䄯
䈂	䈂
䈧	䈧
䊠	䊠
䌁	䌁
䌴	䌴
䍙	䍙
䏕	䏕
䏙	䏙
䐋	䐋
䑫	䑫
䔫	䔫
䕝	䕝
䕡	䕡
䕫	䕫
䗗	䗗
䗹	䗹
䘵	䘵
䚾	䚾
䛇	䛇
䦕	䦕
䧦	䧦
䩮	䩮
䩶	䩶
䪲	䪲
䬳	䬳
䯎	䯎
䳎	䳎
䳭	䳭
䳸	䳸
䵖	䵖
一	⼀	㆒	㈠	㊀	🈩
丁	㆜
七	㈦	㊆
三	㆔	㈢	㊂	🈪	🉁
上	㆖	㊤
下	㆘	㊦
不	不
丙	㆛
並	並
丨	⼁
中	㆗	㊥	🈭
串	串
丶	⼂
丸	丸
丹	丹
丽	丽
丿	⼃
乁	乁
乙	⼄	㆚
九	㈨	㊈
亂	亂
亅	⼅
了	了
二	⼆	㆓	㈡	㊁	🈔	🉂
五	㈤	㊄
亠	⼇
交	🈘
亮	亮
人	⼈	㆟
什	什
仌	仌
代	㈹
令	㋿	令
企	㈽	㊭
休	㉁	㊡
会	㍿
你	你
侀	侀
來	來
例	例
侮	侮	侮
侻	侻
便	便
倂	倂
倫	倫
偺	偺
備	備
像	像
僚	僚
僧	僧	僧
優	㊝
儿	⼉
兀	兀
充	充
免	免	免
兔	兔
兤	兤
入	⼊
內	內
全	全
兩	兩
八	⼋	㈧	㊇
六	㈥	㊅	六
具	具
冀	冀
冂	⼌
再	🈞	再
冒	冒
冕	冕
冖	⼍
冗	冗
写	㊢
冤	冤
冫	⼎
冬	冬
况	况	况
冷	冷
凉	凉
凌	凌
凜	凜
凞	凞
几	⼏
凵	⼐	凵
刀	⼑
刃	刃
切	切	切
列	列
初	🈠
利	利
刺	刺
刻	刻
剆	剆
前	🈜
割	🈹	割
剷	剷
劉	劉
力	⼒	力
劣	劣
劳	劳
労	㈸	㊘
勇	勇	勇
勉	勉	勉
勒	勒
勝	🉇
勞	勞
勤	勤	勤
勵	勵
勹	⼓
勺	勺	勺
包	包
匆	匆
匕	⼔
北	北	北
匚	⼕
匸	⼖
医	㊩
匿	匿
十	⼗	〸	㈩	㊉
卄	〹
卅	〺
卉	卉
卑	卑	卑
協	㈿	㊯
博	博
卜	⼘
卩	⼙
印	㊞
即	即
卵	卵
卽	卽
卿	卿	卿	卿
厂	⼚
厶	⼛
參	參
又	⼜
及	及
双	🈒
叟	叟
口	⼝
句	句
叫	叫
可	🉑
叱	叱
右	㊨	🈮
吆	吆
合	🈴
名	㈴	㊔
吏	吏
吝	吝
吸	吸
吹	🈥
呂	呂
呈	呈
周	周
呼	㈺
和	㋿	㍼
咞	咞
咢	咢
咽	咽
哶	哶
唐	唐
問	㉄
啓	啓
啕	啕
啣	啣
善	善	善
喇	喇
喙	喙	喙
喝	喝	喝
喫	喫
喳	喳
営	🈺
嗀	嗀
嗂	嗂
嗢	嗢
嘆	嘆	嘆
噑	噑
器	器
噴	噴
囗	⼞
四	㆕	㈣	㊃
囹	囹
圖	圖
圗	圗
土	⼟	㈯	㊏
地	㆞
型	型
城	城
埴	埴
堍	堍
報	報
堲	堲
塀	塀
塚	塚	塚
塞	塞
墨	墨
墬	墬
墳	墳
壘	壘
壟	壟
士	⼠
壮	壮
声	🈤
売	売
壷	壷
夂	⼡
夆	夆
夊	⼢
夕	⼣
多	🈕	多
夜	㊰
夢	夢
大	⼤	㍽
天	㆝	🈗
奄	奄
奈	奈
契	契
奔	奔
奢	奢
女	⼥	㊛	女
姘	姘
姬	姬
娛	娛
娧	娧
婢	婢
婦	婦
媵	媵
嬈	嬈
嬨	嬨
嬾	嬾	嬾
子	⼦
字	🈑
学	㈻	㊫
宀	⼧
宅	宅
安	🉃
宗	㊪
寃	寃
寘	寘
寧	寧	寧	寧
寮	寮
寳	寳
寸	⼨
寿	寿
将	将
小	⼩
尢	⼪	尢
尸	⼫
尿	尿
屠	屠
屢	屢
層	層
履	履
屮	⼬	屮	屮
山	⼭
岍	岍
峀	峀
崙	崙
嵃	嵃
嵐	嵐
嵫	嵫
嵮	嵮
嵼	嵼
嶲	嶲
嶺	嶺
巛	⼮
巡	巡
巢	巢
工	⼯
左	㊧	🈬
己	⼰
巽	巽
巾	⼱
帨	帨
帽	帽
幩	幩
干	⼲
平	㍻
年	年
幺	⼳
幼	㉅
广	⼴
度	度
庰	庰
庳	庳
庶	庶
廉	廉
廊	廊	廊
廒	廒
廓	廓
廙	廙
廬	廬
廴	⼵
廾	⼶	廾
弄	弄
弋	⼷
式	㍿
弓	⼸
弢	弢	弢
彐	⼹
当	当
彡	⼺
形	形
彩	彩
彫	彫
彳	⼻
律	律
後	🈝
得	🉐
徚	徚
復	復
徭	徭
心	⼼
忍	忍
志	志
念	念
忹	忹
怒	怒
怜	怜
恵	恵
悁	悁
悔	悔	悔
惇	惇
惘	惘
惡	惡
愈	愈
慄	慄
慈	慈
慌	慌	慌
慎	慎	慎
慠	慠
慨	慨
慺	慺
憎	憎	憎	憎
憐	憐
憤	憤
憯	憯
憲	憲
懞	懞
懲	懲	懲	懲
懶	懶	懶
戀	戀
戈	⼽
成	㍻	成
戛	戛
戮	戮
戴	戴
戶	⼾
手	⼿	🈐
打	🈱	🉅
扝	扝
投	🈧
抱	抱
拉	拉
拏	拏
拓	拓
拔	拔
拼	拼
拾	拾
指	🈯
挽	挽
捐	捐
捕	🈨
捨	捨
捻	捻
掃	掃
掠	掠
掩	掩
揄	揄
揅	揅
揤	揤
搜	搜
搢	搢
摒	摒
摩	摩
摷	摷
摾	摾
撚	撚
撝	撝
擄	擄
支	⽀
攴	⽁
敏	敏	敏
敖	敖
敗	🉈
敬	敬
數	數
文	⽂	㉆
斗	⽃
料	料	🈛
斤	⽄
新	🈟
方	⽅
旅	旅
无	⽆
既	既
旣	旣
日	⽇	㈰	㊐	㏠	㏡	㏢	㏣	㏤	㏥	㏦	㏧	㏨	㏩	㏪	㏫	㏬	㏭	㏮	㏯	㏰	㏱	㏲	㏳	㏴	㏵	㏶	㏷	㏸	㏹	㏺	㏻	㏼	㏽	㏾
明	㍾
易	易
映	🈙
昭	㍼
晉	晉
晴	晴	晴
暈	暈
暑	暑	暑
暜	暜
暴	暴
曆	曆
曰	⽈
更	更
書	書
最	最
月	⽉	㈪	㊊	㋀	㋁	㋂	㋃	㋄	㋅	㋆	㋇	㋈	㋉	㋊	㋋	🈷
有	㈲	㊒	🈶
朗	朗	朗	朗
望	望	望
朡	朡
木	⽊	㈭	㊍
本	🉀
李	李
杓	杓
杖	杖
杞	杞
杻	杻
枅	枅
林	林
柳	柳
柺	柺
栗	栗
栟	栟
株	㈱	㊑	㍿
桒	桒
梁	梁
梅	梅	梅
梎	梎
梨	梨
椔	椔
楂	楂
榣	榣
槪	槪
樂	樂	樂	樂
樓	樓
檨	檨
櫓	櫓
櫛	櫛
欄	欄
欠	⽋
次	次
歔	歔
止	⽌
正	㊣	㍽
歲	歲
歷	歷
歹	⽍	歹
殟	殟
殮	殮
殳	⽎
殺	殺	殺	殺
殻	殻
毋	⽏
母	⺟
比	⽐
毛	⽑
氏	⽒
气	⽓
水	⽔	㈬	㊌
汎	汎
汧	汧
沈	沈
治	㍾
沿	沿
泌	泌
泍	泍
泥	泥
注	㊟
洖	洖
洛	洛
洞	洞
洴	洴
派	派
流	流	流	流
浩	浩
浪	浪
海	海	海
浸	浸
涅	涅
淋	淋
淚	淚
淪	淪
淹	淹
渚	渚
港	港
湮	湮
満	🈵
溜	溜
溺	溺
滇	滇
滋	滋	滋
滑	滑
滛	滛
漏	漏
演	🈦
漢	漢	漢
漣	漣
潮	潮
濆	濆
濫	濫
濾	濾
瀛	瀛
瀞	瀞	瀞
瀹	瀹
灊	灊
火	⽕	㈫	㊋
灰	灰
灷	灷
災	災
炙	炙
炭	炭
点	㍘	㍙	㍚	㍛	㍜	㍝	㍞	㍟	㍠	㍡	㍢	㍣	㍤	㍥	㍦	㍧	㍨	㍩	㍪	㍫	㍬	㍭	㍮	㍯	㍰	🉄
烈	烈
烙	烙
無	🈚
煅	煅
煉	煉
煮	煮	煮
熜	熜
燎	燎
燐	燐
爐	爐
爛	爛
爨	爨
爪	⽖
爫	爫
爵	爵	爵
父	⽗
爻	⽘
爿	⽙
片	⽚
牐	牐
牙	⽛
牛	⽜
牢	牢
特	㈵	㊕
犀	犀
犕	犕
犬	⽝
犯	犯
狀	狀
狼	狼
猪	猪	猪
獵	獵
獺	獺
玄	⽞
率	率	率
玉	⽟
王	王
玥	玥
玲	玲
珞	珞
理	理
琉	琉
琢	琢
瑇	瑇
瑜	瑜
瑩	瑩
瑱	瑱	瑱
璅	璅
璉	璉
璘	璘
瓊	瓊
瓜	⽠
瓦	⽡
甆	甆
甘	⽢
生	⽣	🈢
甤	甤
用	⽤
田	⽥
甲	㆙
申	🈸
男	㊚
画	画
甾	甾
留	留
略	略
異	異	異
疋	⽦
疒	⽧
痢	痢
瘐	瘐
瘝	瘝
瘟	瘟
療	療
癩	癩
癶	⽨
白	⽩
皮	⽪
皿	⽫
益	益	益
盗	🉆
盛	盛
監	㈼	㊬
盧	盧
目	⽬
直	直	直
省	省
眞	眞
真	真	真
着	着
睊	睊	睊
瞋	瞋
瞧	瞧
矛	⽭
矢	⽮
石	⽯
硎	硎
硫	硫
碌	碌	碌
碑	碑
磊	磊
磌	磌	磌
磻	磻
礪	礪
示	⽰
礼	礼
社	㈳	㊓	㍿	社
祈	祈
祉	祉
祐	祐
祖	祖	祖
祝	㈷	㊗	祝
神	神
祥	祥
祭	㉀
祿	祿
禁	🈲
禍	禍
禎	禎
福	福	福
禮	禮
禸	⽱
禾	⽲
秊	秊
秘	㊙
秫	秫
稜	稜
穀	穀	穀
穊	穊
穏	穏
穴	⽳
空	🈳
突	突
窱	窱
立	⽴	立
竮	竮
竹	⽵
笠	笠
箏	㉇
節	節	節
篆	篆
築	築
簾	簾
籠	籠
米	⽶
类	类
粒	粒
精	精
糒	糒
糖	糖
糣	糣
糧	糧
糨	糨
糸	⽷
紀	紀
紐	紐
索	索
累	累
終	🈡
絛	絛
絣	絣
綠	綠
綾	綾
緇	緇
練	練	練	練
縂	縂
縉	縉
縷	縷
繁	繁
繅	繅
缶	⽸
缾	缾
网	⽹
署	署
罹	罹
罺	罺
羅	羅
羊	⽺
羕	羕
羚	羚
羽	⽻	羽
翺	翺
老	⽼	老
者	者	者	者
而	⽽
耒	⽾
耳	⽿
聆	聆
聠	聠
聯	聯
聰	聰
聾	聾
聿	⾀
肉	⾁
肋	肋
肭	肭
育	育
脃	脃
脾	脾
臘	臘
臣	⾂
臨	臨
自	⾃	㉂
臭	臭
至	⾄	㉃
臼	⾅
舁	舁	舁
舄	舄
舌	⾆
舘	舘
舛	⾇
舟	⾈
艮	⾉
良	良
色	⾊
艸	⾋
艹	艹	艹
芋	芋
芑	芑
芝	芝
花	花
芳	芳
芽	芽
若	若	若
苦	苦
茝	茝
茣	茣
茶	茶
荒	荒
荓	荓
荣	荣
莭	莭
莽	莽
菉	菉
菊	菊
菌	菌
菜	菜
菧	菧
華	華
菱	菱
落	落
葉	葉
著	著	著
蓮	蓮
蓱	蓱
蓳	蓳
蓼	蓼
蔖	蔖
蕤	蕤
藍	藍
藺	藺
蘆	蘆
蘒	蘒
蘭	蘭
蘿	蘿
虍	⾌
虐	虐
虜	虜	虜
虧	虧
虩	虩
虫	⾍
蚈	蚈
蚩	蚩
蛢	蛢
蜎	蜎
蜨	蜨
蝫	蝫
蝹	蝹	蝹
螆	螆
螺	螺
蟡	蟡
蠁	蠁
蠟	蠟
血	⾎
行	⾏	行
衠	衠
衣	⾐	衣
裂	裂
裏	裏
裗	裗
裞	裞
裡	裡
裸	裸
裺	裺
褐	褐
襁	襁
襤	襤
襾	⾑
覆	覆
見	⾒	見
視	視	視
角	⾓
解	🈖
言	⾔
誠	誠
說	說	說
調	調
請	請
諒	諒
論	論
諭	諭	諭
諸	諸	諸
諾	諾	諾
謁	謁	謁
謹	謹	謹
識	識
讀	讀
變	變	變
谷	⾕
豆	⾖
豈	豈
豕	⾗	豕
豸	⾘
貝	⾙
財	㈶	㊖
販	🈣
貫	貫
賁	賁
賂	賂
資	㈾	㊮
賈	賈
賓	賓
贈	贈	贈
贛	贛
赤	⾚
走	⾛	🈰
起	起
足	⾜
趼	趼
跋	跋
路	路
跰	跰
身	⾝
車	⾞	車
軔	軔
輦	輦
輪	輪
輸	輸	輸
輻	輻
轢	轢
辛	⾟
辞	辞
辰	⾠	辰
辵	⾡
辶	辶
連	連
逸	逸	逸
遊	🈫
適	㊜
遲	遲
遼	遼
邏	邏
邑	⾢
邔	邔
郎	郎
郞	郞
郱	郱
都	都
鄑	鄑
鄛	鄛
酉	⾣
配	🈻
酪	酪
醙	醙
醴	醴
釆	⾤
里	⾥	里
量	量
金	⾦	㈮	㊎	金
鈴	鈴
鈸	鈸
鉶	鉶
鉼	鉼
鋗	鋗
鋘	鋘
錄	錄
鍊	鍊
鏹	鏹
鐕	鐕
長	⾧
門	⾨
開	開
閭	閭
閷	閷
阜	⾩
阮	阮
陋	陋
降	降
陵	陵
陸	陸
陼	陼
隆	隆
隣	隣
隶	⾪
隷	隷
隸	隸
隹	⾫
雃	雃
離	離
難	難	難
雨	⾬
零	零
雷	雷
霣	霣
露	露
靈	靈
靑	⾭
靖	靖	靖
非	⾮
面	⾯
革	⾰
韋	⾱
韛	韛
韠	韠
韭	⾲
音	⾳
響	響	響
頁	⾴
項	㊠
頋	頋	頋	頋
領	領
頩	頩
頻	頻	頻
類	類
風	⾵
飛	⾶
食	⾷
飢	飢
飯	飯
飼	飼
館	館
餩	餩
首	⾸
香	⾹
馧	馧
馬	⾺
駂	駂
駱	駱
駾	駾
驪	驪
骨	⾻
高	⾼
髟	⾽
鬒	鬒	鬒
鬥	⾾
鬯	⾿
鬲	⿀
鬼	⿁
魚	⿂
魯	魯
鱀	鱀
鱗	鱗
鳥	⿃
鳽	鳽
鵧	鵧
鶴	鶴
鷺	鷺
鸞	鸞
鹵	⿄
鹿	⿅	鹿
麗	麗
麟	麟
麥	⿆
麻	⿇	麻
黃	⿈
黍	⿉
黎	黎
黑	⿊
黹	⿋	黹
黽	⿌
黾	黾
鼅	鼅
鼎	⿍
鼏	鼏
鼓	⿎
鼖	鼖
鼠	⿏
鼻	⿐	鼻
齃	齃
齊	⿑
齒	⿒
龍	⿓	龍
龎	龎
龜	⿔	龜	龜	龜
龟	⻳
龠	⿕
ꙑ	𞁬
ꚉ	𞁊
ꜧ	ꭜ
ꝯ	ꝰ
ꞎ	𐞝
ꬷ	ꭝ
ꭒ	ꭟ
ꭦ	𐞈
ꭧ	𐞭
𐗒	𐗉
𐗚	𐗤
𑂙	𑂚
𑂛	𑂜
𑂥	𑂫
𑂺	𑂚	𑂜	𑂫
𑄧	𑄮	𑄯
𑄱	𑄮
𑄲	𑄯
𑌾	𑍋
𑍇	𑍋	𑍌
𑍗	𑍌
𑎂	𑎃
𑎄	𑎅
𑎋	𑎎
𑎐	𑎑
𑎸	𑏇
𑎻	𑎅
𑏂	𑎎	𑏅	𑏇	𑏈
𑏉	𑎃	𑎑	𑏈
𑒰	𑒼
𑒹	𑒻	𑒼	𑒾
𑒺	𑒻
𑒽	𑒾
𑖯	𑖺	𑖻
𑖸	𑖺
𑖹	𑖻
𑤰	𑤸
𑤵	𑤸
𖄞	𖄡	𖄢	𖄣	𖄥	𖄦	𖄧	𖄨
𖄟	𖄣	𖄤	𖄦	𖄧
𖄠	𖄥	𖄨
𖄩	𖄢	𖄤	𖄧
𖵣	𖵩	𖵪
𖵧	𖵨	𖵩	𖵪
𝅗	𝅗𝅥
𝅘	𝅘𝅥	𝅘𝅥𝅮	𝅘𝅥𝅯	𝅘𝅥𝅰	𝅘𝅥𝅱	𝅘𝅥𝅲
𝅥	𝅗𝅥	𝅘𝅥	𝅘𝅥𝅮	𝅘𝅥𝅯	𝅘𝅥𝅰	𝅘𝅥𝅱	𝅘𝅥𝅲	𝆹𝅥	𝆺𝅥	𝆹𝅥𝅮	𝆺𝅥𝅮	𝆹𝅥𝅯	𝆺𝅥𝅯
𝅮	𝅘𝅥𝅮	𝆹𝅥𝅮	𝆺𝅥𝅮
𝅯	𝅘𝅥𝅯	𝆹𝅥𝅯	𝆺𝅥𝅯
𝅰	𝅘𝅥𝅰
𝅱	𝅘𝅥𝅱
𝅲	𝅘𝅥𝅲
𝆹	𝆹𝅥	𝆹𝅥𝅮	𝆹𝅥𝅯
𝆺	𝆺𝅥	𝆺𝅥𝅮	𝆺𝅥𝅯
𝼄	𐞜
𝼅	𐞟
𝼆	𐞡
𝼈	𐞧
𝼊	𐞹
𝼞	𐞺
𠄢	𠄢
𠔜	𠔜
𠔥	𠔥
𠕋	𠕋
𠘺	𠘺
𠠄	𠠄
𠣞	𠣞
𠨬	𠨬
𠭣	𠭣
𡓤	𡓤
𡚨	𡚨
𡛪	𡛪
𡧈	𡧈
𡬘	𡬘
𡴋	𡴋
𡷤	𡷤
𡷦	𡷦
𢆃	𢆃
𢆟	𢆟
𢌱	𢌱	𢌱
𢛔	𢛔
𢡄	𢡄
𢡊	𢡊
𢬌	𢬌
𢯱	𢯱
𣀊	𣀊
𣊸	𣊸
𣍟	𣍟
𣎓	𣎓
𣎜	𣎜
𣏃	𣏃
𣏕	𣏕
𣑭	𣑭
𣚣	𣚣
𣢧	𣢧
𣪍	𣪍
𣫺	𣫺
𣲼	𣲼
𣴞	𣴞
𣻑	𣻑
𣽞	𣽞
𣾎	𣾎
𤉣	𤉣
𤋮	𤋮
𤎫	𤎫
𤘈	𤘈
𤜵	𤜵
𤠔	𤠔
𤰶	𤰶
𤲒	𤲒
𤾡	𤾡
𤾸	𤾸
𥁄	𥁄
𥃲	𥃲
𥃳	𥃳
𥄙	𥄙
𥄳	𥄳
𥉉	𥉉
𥐝	𥐝
𥘦	𥘦
𥚚	𥚚
𥛅	𥛅
𥥼	𥥼
𥪧	𥪧	𥪧
𥮫	𥮫
𥲀	𥲀
𥳐	𥳐
𥾆	𥾆
𦇚	𦇚
𦈨	𦈨
𦉇	𦉇
𦋙	𦋙
𦌾	𦌾
𦓚	𦓚
𦔣	𦔣
𦖨	𦖨
𦞧	𦞧
𦞵	𦞵
𦬼	𦬼
𦰶	𦰶
𦳕	𦳕
𦵫	𦵫
𦼬	𦼬
𦾱	𦾱
𧃒	𧃒
𧏊	𧏊
𧙧	𧙧
𧢮	𧢮
𧥦	𧥦
𧲨	𧲨
𧻓	𧻓
𧼯	𧼯
𨗒	𨗒
𨗭	𨗭
𨜮	𨜮
𨯺	𨯺
𨵷	𨵷
𩅅	𩅅
𩇟	𩇟
𩈚	𩈚
𩐊	𩐊
𩒖	𩒖
𩖶	𩖶
𩬰	𩬰
𪃎	𪃎
𪄅	𪄅
𪈎	𪈎
𪊑	𪊑
𪎒	𪎒
𪘀	𪘀
`;
